{
  "texts": [
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, serta nenek dari pihaknya sebagai ahli waris, dengan harta 300 juta rupiah dan hutang 25 juta rupiah.",
    "Setelah suami saya meninggal, ahli warisnya terdiri dari saya istrinya, dua anak perempuan kami, serta nenek pewaris, dengan peninggalan 410 juta rupiah dan hutang 40 juta rupiah.",
    "Saya kini janda karena suami berpulang, ahli waris hanya saya, tiga anak perempuan, dan neneknya, dengan harta 370 juta rupiah serta hutang 35 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, empat anak perempuan, serta nenek dari pewaris, sementara peninggalannya 420 juta rupiah dengan hutang 50 juta rupiah.",
    "Saat suami saya wafat, saya bersama lima anak perempuan serta nenek dari suami menjadi ahli waris, dengan harta 480 juta rupiah dan hutang 45 juta rupiah.",
    "Saya kehilangan suami, ia meninggalkan satu anak perempuan dan nenek dari pihaknya bersama saya, dengan warisan 310 juta rupiah serta hutang 30 juta rupiah.",
    "Suami saya meninggal, ahli waris terdiri dari saya, dua anak perempuan, dan nenek dari pewaris, dengan harta 340 juta rupiah dan hutang 25 juta rupiah.",
    "Setelah kepergian suami, saya, tiga anak perempuan, serta nenek pewaris mendapat bagian, dengan harta peninggalan 400 juta rupiah dan hutang 35 juta rupiah.",
    "Suami saya wafat, ahli warisnya adalah saya, empat anak perempuan, serta nenek dari pihaknya, dengan harta 430 juta rupiah dan hutang 40 juta rupiah.",
    "Saya kini menjanda, suami saya meninggal meninggalkan lima anak perempuan dan nenek pewaris, dengan peninggalan 495 juta rupiah dan hutang 50 juta rupiah.",
    "Suami saya sudah tiada, ahli warisnya adalah saya, satu anak perempuan, dan nenek dari pihaknya, dengan harta 320 juta rupiah serta hutang 28 juta rupiah.",
    "Setelah wafat suami saya, ahli waris hanya saya, dua anak perempuan, dan neneknya, dengan harta 360 juta rupiah dan hutang 42 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan tiga anak perempuan dan nenek pewaris bersama saya, dengan harta 410 juta rupiah serta hutang 37 juta rupiah.",
    "Suami saya wafat, ahli waris terdiri dari saya, empat anak perempuan, serta nenek dari pihaknya, dengan peninggalan 380 juta rupiah dan hutang 33 juta rupiah.",
    "Saya kini janda karena suami meninggal, beliau meninggalkan lima anak perempuan dan nenek dari pihaknya, dengan harta 470 juta rupiah serta hutang 45 juta rupiah.",
    "Suami saya berpulang, ahli warisnya adalah saya, satu anak perempuan, serta nenek pewaris, dengan harta 305 juta rupiah dan hutang 22 juta rupiah.",
    "Setelah wafatnya suami saya, ahli waris hanya saya, dua anak perempuan, dan nenek dari pihaknya, dengan peninggalan 375 juta rupiah dan hutang 40 juta rupiah.",
    "Suami saya meninggal dunia, ahli waris terdiri dari saya, tiga anak perempuan, dan nenek dari suami, dengan harta 420 juta rupiah dan hutang 35 juta rupiah.",
    "Saya kini menjanda, karena suami wafat, meninggalkan empat anak perempuan serta nenek dari pihaknya, dengan peninggalan 445 juta rupiah dan hutang 50 juta rupiah.",
    "Suami saya meninggal, ahli warisnya adalah saya, lima anak perempuan, serta nenek pewaris, dengan harta 490 juta rupiah dan hutang 48 juta rupiah.",
    "Suami saya wafat, ahli warisnya hanya saya, satu anak perempuan, serta nenek dari pihaknya, dengan peninggalan 295 juta rupiah dan hutang 20 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan dua anak perempuan dan nenek pewaris bersama saya, dengan harta 340 juta rupiah dan hutang 38 juta rupiah.",
    "Suami saya meninggal, ahli waris terdiri dari saya, tiga anak perempuan, dan nenek dari pihaknya, dengan harta 420 juta rupiah dan hutang 30 juta rupiah.",
    "Setelah wafat suami, ahli waris hanyalah saya, empat anak perempuan, dan nenek pewaris, dengan peninggalan 400 juta rupiah serta hutang 42 juta rupiah.",
    "Saya kini janda, suami meninggalkan lima anak perempuan dan nenek dari pihaknya bersama saya, dengan harta 475 juta rupiah serta hutang 44 juta rupiah.",
    "Suami saya berpulang, ahli warisnya adalah saya, satu anak perempuan, serta nenek pewaris, dengan harta 315 juta rupiah dan hutang 28 juta rupiah.",
    "Setelah suami wafat, saya bersama dua anak perempuan serta nenek dari pihaknya menjadi ahli waris, dengan peninggalan 360 juta rupiah dan hutang 32 juta rupiah.",
    "Suami saya meninggal, ahli waris terdiri dari saya, tiga anak perempuan, dan nenek pewaris, dengan harta 395 juta rupiah dan hutang 39 juta rupiah.",
    "Saya kini kehilangan suami, beliau meninggalkan empat anak perempuan dan nenek dari pihaknya, dengan peninggalan 430 juta rupiah serta hutang 41 juta rupiah.",
    "Suami saya wafat, ahli warisnya adalah saya, lima anak perempuan, serta nenek dari pewaris, dengan harta 480 juta rupiah dan hutang 50 juta rupiah.",
    "Saya menjanda karena suami wafat, ahli waris hanyalah saya, satu anak perempuan, serta nenek dari pihaknya, dengan harta 310 juta rupiah dan hutang 25 juta rupiah.",
    "Setelah kepergian suami, saya bersama dua anak perempuan dan nenek pewaris mendapat bagian, dengan harta 350 juta rupiah serta hutang 30 juta rupiah.",
    "Suami saya meninggal, ahli waris terdiri dari saya, tiga anak perempuan, serta nenek dari pihaknya, dengan peninggalan 415 juta rupiah dan hutang 36 juta rupiah.",
    "Saya kini kehilangan suami, beliau meninggalkan empat anak perempuan dan nenek dari pihaknya, dengan harta 390 juta rupiah dan hutang 34 juta rupiah.",
    "Suami saya wafat, ahli waris hanya saya, lima anak perempuan, dan nenek pewaris, dengan peninggalan 495 juta rupiah dan hutang 49 juta rupiah.",
    "Suami saya sudah tiada, ahli warisnya adalah saya, satu anak perempuan, serta nenek dari pihaknya, dengan harta 305 juta rupiah dan hutang 21 juta rupiah.",
    "Setelah wafatnya suami, saya bersama dua anak perempuan dan nenek dari suami menjadi ahli waris, dengan peninggalan 370 juta rupiah serta hutang 33 juta rupiah.",
    "Suami saya berpulang, ahli warisnya adalah saya, tiga anak perempuan, serta nenek pewaris, dengan harta 420 juta rupiah dan hutang 38 juta rupiah.",
    "Saya menjanda, karena suami wafat meninggalkan empat anak perempuan dan nenek dari pihaknya, dengan harta 440 juta rupiah serta hutang 45 juta rupiah.",
    "Suami saya wafat, ahli waris hanya saya, lima anak perempuan, dan nenek pewaris, dengan peninggalan 490 juta rupiah dan hutang 47 juta rupiah.",
    "Suami saya sudah meninggal, ahli warisnya adalah saya, satu anak perempuan, serta nenek dari pihaknya, dengan harta 325 juta rupiah dan hutang 26 juta rupiah.",
    "Setelah kepergian suami, ahli warisnya hanyalah saya, dua anak perempuan, dan nenek pewaris, dengan peninggalan 360 juta rupiah serta hutang 29 juta rupiah.",
    "Suami saya meninggal dunia, ahli waris terdiri dari saya, tiga anak perempuan, serta nenek dari pihaknya, dengan harta 405 juta rupiah dan hutang 35 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan empat anak perempuan dan nenek pewaris bersama saya, dengan peninggalan 420 juta rupiah dan hutang 40 juta rupiah.",
    "Suami saya wafat, ahli waris hanya saya, lima anak perempuan, dan nenek dari pihaknya, dengan harta 465 juta rupiah dan hutang 43 juta rupiah.",
    "Saya menjanda karena suami meninggal, ahli warisnya terdiri dari saya, satu anak perempuan, dan nenek pewaris, dengan peninggalan 300 juta rupiah serta hutang 22 juta rupiah.",
    "Suami saya meninggal, ahli warisnya adalah saya, dua anak perempuan, serta nenek dari pihaknya, dengan harta 345 juta rupiah dan hutang 27 juta rupiah.",
    "Setelah wafatnya suami, ahli waris terdiri dari saya, tiga anak perempuan, dan nenek pewaris, dengan peninggalan 395 juta rupiah serta hutang 39 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan empat anak perempuan dan nenek dari pihaknya, dengan harta 410 juta rupiah dan hutang 36 juta rupiah.",
    "Suami saya wafat, ahli waris hanya saya, lima anak perempuan, serta nenek pewaris, dengan peninggalan 480 juta rupiah dan hutang 44 juta rupiah.",
    "Saya ditinggal wafat suami tercinta, ia meninggalkan saya, tiga anak perempuan, serta nenek dari suami saya. Hartanya sebesar 420 juta rupiah dan masih ada hutang 25 juta rupiah.",
    "Suami saya berpulang, meninggalkan warisan untuk saya, satu anak perempuan, serta nenek dari pihak suami saya. Tersisa harta 300 juta rupiah dengan hutang 18 juta rupiah.",
    "Setelah suami saya meninggal, ahli warisnya adalah saya, empat anak perempuan, dan nenek dari pewaris. Ia memiliki harta 515 juta rupiah, serta hutang 32 juta rupiah.",
    "Suami saya wafat, dan ahli waris yang tersisa yaitu saya, dua anak perempuan, serta nenek dari suami saya. Tersedia harta 280 juta rupiah dengan hutang 12 juta rupiah.",
    "Saat suami saya berpulang, ia meninggalkan saya, satu anak perempuan, dan nenek dari pihak pewaris. Hartanya 360 juta rupiah dan hutangnya 20 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, lima anak perempuan, serta nenek dari pewaris. Ada harta 600 juta rupiah dengan hutang 40 juta rupiah.",
    "Saya menjadi janda setelah suami saya wafat, meninggalkan dua anak perempuan dan nenek dari suami saya sebagai ahli waris bersama saya. Warisan berupa 470 juta rupiah dan hutang 27 juta rupiah.",
    "Suami saya meninggal, menyisakan saya, empat anak perempuan, serta nenek dari suami saya. Hartanya 520 juta rupiah, sementara hutangnya 34 juta rupiah.",
    "Setelah kepergian suami saya, ahli waris yang ada adalah saya, tiga anak perempuan, serta nenek dari pewaris. Ia meninggalkan harta 410 juta rupiah dengan hutang 28 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, dan nenek dari suami saya. Warisan berupa 295 juta rupiah dengan hutang 15 juta rupiah.",
    "Saya ditinggal wafat oleh suami, ia meninggalkan saya, lima anak perempuan, serta nenek dari pewaris. Harta peninggalan 610 juta rupiah dan hutang 35 juta rupiah.",
    "Suami saya berpulang, ahli warisnya terdiri dari saya, dua anak perempuan, dan nenek dari suami saya. Hartanya sebesar 330 juta rupiah dengan hutang 22 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, empat anak perempuan, serta nenek dari pihak suami saya. Ia mewariskan harta 540 juta rupiah dan hutang 30 juta rupiah.",
    "Setelah suami saya tiada, ahli warisnya ialah saya, satu anak perempuan, dan nenek dari pewaris. Hartanya 275 juta rupiah dengan hutang 18 juta rupiah.",
    "Suami saya meninggal, meninggalkan saya, tiga anak perempuan, dan nenek dari pihak suami saya. Tersisa harta 490 juta rupiah dengan hutang 26 juta rupiah.",
    "Saat suami saya wafat, ia meninggalkan saya, dua anak perempuan, serta nenek dari suami saya. Hartanya 350 juta rupiah dengan hutang 21 juta rupiah.",
    "Saya kehilangan suami saya, dan ia meninggalkan saya, lima anak perempuan, serta nenek dari pewaris. Hartanya 625 juta rupiah dengan hutang 38 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, satu anak perempuan, serta nenek dari pihak suami saya. Warisan 310 juta rupiah dengan hutang 14 juta rupiah.",
    "Setelah suami saya meninggal, ahli waris yang tersisa yaitu saya, empat anak perempuan, dan nenek dari pewaris. Harta 520 juta rupiah, hutang 33 juta rupiah.",
    "Suami saya berpulang, menyisakan saya, dua anak perempuan, serta nenek dari suami saya. Warisan sebesar 345 juta rupiah dan hutang 19 juta rupiah.",
    "Saya menjadi janda karena suami meninggal, ahli warisnya adalah saya, tiga anak perempuan, serta nenek dari pihak suami saya. Ada harta 460 juta rupiah dengan hutang 29 juta rupiah.",
    "Suami saya wafat, ahli warisnya yaitu saya, satu anak perempuan, dan nenek dari pewaris. Harta peninggalan 285 juta rupiah dengan hutang 17 juta rupiah.",
    "Saat suami saya berpulang, ia meninggalkan saya, lima anak perempuan, serta nenek dari suami saya. Tersisa harta 590 juta rupiah dengan hutang 36 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, dua anak perempuan, serta nenek dari pihak pewaris. Hartanya 325 juta rupiah dengan hutang 20 juta rupiah.",
    "Setelah suami saya wafat, ia meninggalkan saya, empat anak perempuan, serta nenek dari suami saya. Warisan 555 juta rupiah dan hutang 31 juta rupiah.",
    "Saya ditinggal suami saya untuk selamanya, ahli warisnya saya, tiga anak perempuan, serta nenek dari pewaris. Ia memiliki harta 440 juta rupiah dengan hutang 25 juta rupiah.",
    "Suami saya wafat, ahli warisnya yaitu saya, satu anak perempuan, serta nenek dari suami saya. Warisan 305 juta rupiah dengan hutang 16 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, lima anak perempuan, serta nenek dari pewaris. Hartanya 620 juta rupiah dengan hutang 37 juta rupiah.",
    "Setelah kepergian suami saya, ahli warisnya adalah saya, dua anak perempuan, serta nenek dari pihak suami saya. Tersisa harta 340 juta rupiah dengan hutang 23 juta rupiah.",
    "Suami saya berpulang, meninggalkan saya, empat anak perempuan, dan nenek dari pewaris. Hartanya 500 juta rupiah, hutang 30 juta rupiah.",
    "Saya kehilangan suami saya, ahli waris yang tersisa adalah saya, tiga anak perempuan, serta nenek dari suami saya. Warisan 435 juta rupiah dengan hutang 28 juta rupiah.",
    "Suami saya meninggal, ahli warisnya yaitu saya, satu anak perempuan, dan nenek dari pewaris. Ia memiliki harta 295 juta rupiah dengan hutang 15 juta rupiah.",
    "Suami saya wafat, ahli warisnya saya, lima anak perempuan, serta nenek dari pihak suami saya. Hartanya 600 juta rupiah dengan hutang 40 juta rupiah.",
    "Setelah suami saya tiada, ia meninggalkan saya, dua anak perempuan, dan nenek dari suami saya. Warisan sebesar 335 juta rupiah dengan hutang 19 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, empat anak perempuan, serta nenek dari pewaris. Ia meninggalkan harta 525 juta rupiah dengan hutang 34 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, serta nenek dari suami saya. Hartanya 310 juta rupiah dengan hutang 14 juta rupiah.",
    "Saat suami saya berpulang, ahli warisnya yaitu saya, tiga anak perempuan, serta nenek dari pewaris. Warisan 450 juta rupiah dengan hutang 27 juta rupiah.",
    "Suami saya meninggal, ahli warisnya terdiri dari saya, dua anak perempuan, dan nenek dari suami saya. Harta 325 juta rupiah dengan hutang 20 juta rupiah.",
    "Saya ditinggal wafat suami, ahli warisnya adalah saya, lima anak perempuan, serta nenek dari pihak pewaris. Hartanya 630 juta rupiah dengan hutang 39 juta rupiah.",
    "Suami saya meninggal, ahli warisnya yaitu saya, empat anak perempuan, serta nenek dari suami saya. Warisan 510 juta rupiah dengan hutang 32 juta rupiah.",
    "Setelah suami saya wafat, ahli warisnya saya, satu anak perempuan, dan nenek dari pewaris. Hartanya 280 juta rupiah dengan hutang 18 juta rupiah.",
    "Suami saya wafat, ahli warisnya yaitu saya, tiga anak perempuan, serta nenek dari pihak suami saya. Ia meninggalkan harta 440 juta rupiah dengan hutang 26 juta rupiah.",
    "Suami saya berpulang, ahli warisnya adalah saya, lima anak perempuan, dan nenek dari suami saya. Hartanya 615 juta rupiah dengan hutang 38 juta rupiah.",
    "Saya menjadi janda karena suami meninggal, ahli warisnya saya, dua anak perempuan, serta nenek dari pewaris. Warisan berupa 335 juta rupiah dengan hutang 21 juta rupiah.",
    "Suami saya meninggal, ahli warisnya adalah saya, empat anak perempuan, serta nenek dari pihak suami saya. Hartanya 525 juta rupiah dengan hutang 33 juta rupiah.",
    "Setelah kepergian suami saya, ahli warisnya saya, tiga anak perempuan, serta nenek dari suami saya. Warisan 455 juta rupiah dengan hutang 27 juta rupiah.",
    "Suami saya wafat, ahli warisnya yaitu saya, satu anak perempuan, dan nenek dari pewaris. Hartanya 300 juta rupiah dengan hutang 16 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, lima anak perempuan, serta nenek dari pihak suami saya. Ia meninggalkan harta 605 juta rupiah dengan hutang 37 juta rupiah.",
    "Suami saya wafat, ahli warisnya yaitu saya, dua anak perempuan, serta nenek dari pewaris. Hartanya 340 juta rupiah dengan hutang 22 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya adalah saya, empat anak perempuan, serta nenek dari suami saya. Warisan berupa 510 juta rupiah dengan hutang 31 juta rupiah."
  ]
}