{
  "texts": [
    "Suami saya wafat dan meninggalkan saya, dua anak laki-laki, serta satu anak perempuan. Warisan yang ada berupa uang tunai sebesar 800 juta. Bagaimana pembagiannya menurut Islam?",
    "Saya kehilangan suami saya dan kami memiliki tiga anak laki-laki serta dua anak perempuan. Beliau meninggalkan tabungan 1,2 miliar tanpa utang. Mohon penjelasan pembagian warisnya.",
    "Setelah suami saya meninggal, saya bersama dua anak laki-laki dan tiga anak perempuan menerima warisan sebesar 950 juta. Bagaimana seharusnya warisan ini dibagi?",
    "Kami baru kehilangan suami saya. Ia meninggalkan saya, satu putra, dan dua putri. Tabungan yang tersisa senilai 600 juta. Bagaimana cara membaginya secara syariat?",
    "Suami saya meninggal tanpa meninggalkan hutang. Kami memiliki dua anak laki-laki dan satu anak perempuan. Harta berupa uang 750 juta. Bagaimana pembagian warisnya?",
    "Saya ditinggal wafat suami saya dan kami dikaruniai tiga anak laki-laki dan satu anak perempuan. Warisan yang tersedia sebesar 1 miliar rupiah. Mohon bantuannya untuk perhitungan waris.",
    "Suami saya baru saja wafat. Ia meninggalkan saya, empat anak laki-laki, dan dua anak perempuan. Tabungan kami sebesar 1,3 miliar. Bagaimana pembagian warisnya?",
    "Saya dan suami memiliki dua putra dan tiga putri. Kini beliau telah tiada dan meninggalkan warisan uang tunai 1,1 miliar. Bagaimana pembagian waris sesuai hukum Islam?",
    "Warisan dari suami saya berupa uang sebesar 900 juta rupiah. Kami memiliki satu anak laki-laki dan dua anak perempuan. Bagaimana cara membaginya?",
    "Setelah kepergian suami saya, saya bersama satu anak laki-laki dan satu anak perempuan menerima tabungan warisan 700 juta. Bagaimana perhitungan hak kami masing-masing?",
    "Saya satu-satunya istri dari almarhum yang meninggal dunia. Kami punya tiga anak laki-laki dan dua anak perempuan. Warisan sebesar 1,2 miliar. Bagaimana dibagi menurut syariat?",
    "Kami baru saja menerima warisan sebesar 850 juta dari suami saya yang telah meninggal. Kami dikaruniai dua putra dan satu putri. Bagaimana sebaiknya dibagikan?",
    "Suami saya meninggal dan meninggalkan saya bersama dua anak laki-laki dan dua anak perempuan. Tidak ada hutang, dan uang warisan sebesar 950 juta. Mohon perhitungan warisnya.",
    "Saya dan suami memiliki satu anak laki-laki dan tiga anak perempuan. Saat ini beliau sudah tiada dan meninggalkan uang 780 juta. Bagaimana pembagian warisnya?",
    "Almarhum suami saya mewariskan tabungan senilai 1 miliar. Kami memiliki empat anak laki-laki dan satu anak perempuan. Bagaimana pembagian waris yang benar?",
    "Saya ingin bertanya mengenai warisan. Suami saya meninggal, dan saya bersama satu anak laki-laki dan dua anak perempuan mewarisi tabungan 700 juta. Bagaimana pembagiannya?",
    "Kami memiliki dua anak laki-laki dan satu anak perempuan. Setelah suami saya meninggal, tersisa uang tunai 800 juta. Mohon penjelasan tentang pembagian waris.",
    "Suami saya wafat dan meninggalkan saya serta tiga anak laki-laki dan dua anak perempuan. Harta warisan yang tersedia 1,1 miliar. Bagaimana pembagiannya?",
    "Saya ditinggal oleh suami tercinta. Kami memiliki satu anak laki-laki dan satu anak perempuan. Warisan berupa uang sebesar 600 juta. Bagaimana cara membaginya?",
    "Kami memiliki lima anak: dua laki-laki dan tiga perempuan. Suami saya meninggal dan meninggalkan uang 1,3 miliar. Bagaimana pembagian warisan kami?",
    "Saya satu-satunya istri dari almarhum. Kami punya dua anak laki-laki dan empat anak perempuan. Uang warisan yang tersisa 1,4 miliar. Bagaimana pembagiannya menurut hukum Islam?",
    "Suami saya meninggal dunia dan meninggalkan saya, dua anak laki-laki, serta satu anak perempuan. Warisan berupa tabungan 750 juta rupiah. Mohon penjelasan pembagiannya.",
    "Warisan sebesar 900 juta ditinggalkan oleh suami saya. Kami memiliki tiga anak laki-laki dan dua anak perempuan. Bagaimana sebaiknya dibagikan?",
    "Saya dan dua anak laki-laki serta satu anak perempuan ditinggal wafat oleh suami saya. Warisan sebesar 800 juta rupiah. Bagaimana pembagian menurut Islam?",
    "Suami saya telah tiada. Kami memiliki satu anak laki-laki dan dua anak perempuan. Warisan berupa uang sebesar 700 juta. Mohon bantuannya dalam pembagian waris.",
    "Setelah kepergian suami saya, kami menerima warisan uang 950 juta. Kami memiliki dua anak laki-laki dan dua anak perempuan. Bagaimana hak masing-masing?",
    "Saya ingin menanyakan soal warisan. Suami saya meninggal, meninggalkan saya serta tiga anak laki-laki dan satu anak perempuan. Harta peninggalan 1 miliar rupiah.",
    "Suami saya wafat dan tidak meninggalkan utang. Kami punya satu putra dan dua putri. Warisan berupa uang sebesar 650 juta. Bagaimana pembagiannya?",
    "Saya dan almarhum suami punya dua anak laki-laki dan satu anak perempuan. Setelah beliau meninggal, tersisa warisan uang 800 juta. Mohon perhitungkan hak kami.",
    "Warisan dari suami saya berupa uang tunai sebesar 900 juta rupiah. Kami dikaruniai dua anak laki-laki dan tiga anak perempuan. Bagaimana seharusnya dibagi?",
    "Saya sebagai istri ditinggal wafat suami saya. Kami punya empat anak laki-laki dan dua anak perempuan. Warisan 1,3 miliar. Bagaimana pembagiannya secara Islam?",
    "Suami saya meninggal dan meninggalkan saya serta satu anak laki-laki dan satu anak perempuan. Harta warisan berupa uang 600 juta. Bagaimana cara pembagiannya?",
    "Saya ditinggal suami saya dan sekarang bersama dua anak laki-laki dan dua anak perempuan. Warisan yang ada sebesar 950 juta. Mohon dijelaskan pembagian warisnya.",
    "Suami saya baru saja wafat. Kami memiliki satu anak laki-laki dan tiga anak perempuan. Warisan 750 juta. Bagaimana cara membaginya menurut ketentuan syariah?",
    "Kami dikaruniai tiga anak laki-laki dan satu anak perempuan. Suami saya meninggalkan tabungan sebesar 1 miliar rupiah. Bagaimana perhitungan warisnya?",
    "Warisan uang 900 juta ditinggalkan oleh suami saya. Kami memiliki dua anak laki-laki dan dua anak perempuan. Tidak ada hutang. Bagaimana pembagiannya?",
    "Saya kehilangan suami saya, dan kami memiliki dua anak laki-laki serta satu anak perempuan. Warisan yang ada senilai 850 juta. Bagaimana pembagian menurut syariat Islam?",
    "Suami saya telah meninggal dunia. Kami dikaruniai tiga anak laki-laki dan tiga anak perempuan. Warisan sebesar 1,2 miliar rupiah. Bagaimana sebaiknya dibagi?",
    "Suami saya wafat dan meninggalkan saya, satu anak laki-laki, dan dua anak perempuan. Uang tabungan yang ada sebesar 700 juta. Bagaimana cara membaginya?",
    "Kami memiliki dua anak laki-laki dan tiga anak perempuan. Setelah suami saya meninggal, tersisa warisan berupa tabungan 950 juta. Bagaimana pembagiannya?",
    "Saya dan suami memiliki satu anak laki-laki dan satu anak perempuan. Setelah suami saya wafat, kami menerima warisan 600 juta. Bagaimana pembagian warisnya?",
    "Warisan sebesar 1 miliar ditinggalkan oleh suami saya. Kami punya dua anak laki-laki dan empat anak perempuan. Bagaimana pembagian sesuai ketentuan Islam?",
    "Suami saya meninggal dunia tanpa meninggalkan utang. Kami dikaruniai tiga anak laki-laki dan dua anak perempuan. Warisan sebesar 1,1 miliar. Bagaimana sebaiknya dibagi?",
    "Saya satu-satunya istri dari almarhum. Kami punya satu anak laki-laki dan dua anak perempuan. Uang yang ditinggalkan sebesar 700 juta. Bagaimana pembagian warisnya?",
    "Kami memiliki tiga anak laki-laki dan tiga anak perempuan. Suami saya meninggal dan meninggalkan warisan sebesar 1,3 miliar. Bagaimana perhitungan pembagiannya?",
    "Saya dan dua anak laki-laki serta satu anak perempuan menerima warisan dari suami saya sebesar 850 juta rupiah. Bagaimana cara membaginya?",
    "Warisan dari suami saya berupa uang tunai senilai 950 juta. Kami memiliki satu anak laki-laki dan dua anak perempuan. Bagaimana perhitungan pembagian warisnya?",
    "Suami saya meninggal, dan kami memiliki dua anak laki-laki dan dua anak perempuan. Tidak ada utang. Warisan berupa uang tunai 1 miliar. Bagaimana pembagiannya?",
    "Saya ditinggal suami yang meninggalkan saya bersama tiga anak laki-laki dan satu anak perempuan. Warisan 1,1 miliar. Bagaimana pembagiannya menurut hukum Islam?",
    "Setelah wafatnya suami saya, saya bersama satu anak laki-laki dan satu anak perempuan menerima warisan uang 700 juta. Mohon dijelaskan cara pembagiannya.",
    "Suami saya baru saja meninggal. Kami dikaruniai dua anak laki-laki dan dua anak perempuan. Warisan beliau berupa tabungan sebesar 950 juta rupiah. Bagaimana seharusnya dibagi?",
    "Setelah wafatnya suami saya, saya bersama tiga anak laki-laki dan satu anak perempuan menerima uang warisan sebesar 1 miliar rupiah. Bagaimana pembagiannya?",
    "Saya kehilangan suami tercinta. Kami memiliki satu putra dan dua putri. Uang warisan yang ditinggalkan sebesar 700 juta. Bagaimana pembagian menurut hukum Islam?",
    "Almarhum suami saya meninggalkan saya, dua anak laki-laki, dan tiga anak perempuan. Warisan senilai 1,1 miliar rupiah. Tolong bantu perhitungannya.",
    "Saya ditinggal wafat suami saya. Kami punya empat anak laki-laki dan dua anak perempuan. Warisan yang tersisa berupa uang tunai 1,3 miliar. Bagaimana pembagian warisnya?",
    "Suami saya meninggal dan tidak memiliki hutang. Kami dikaruniai satu anak laki-laki dan dua anak perempuan. Warisan uang tunai sebesar 750 juta. Mohon penjelasan pembagiannya.",
    "Kami baru menerima warisan sebesar 900 juta dari suami saya yang wafat. Anak-anak kami terdiri dari dua laki-laki dan satu perempuan. Bagaimana cara membaginya?",
    "Suami saya wafat, meninggalkan saya, satu anak laki-laki, dan dua anak perempuan. Tabungan warisan yang ada senilai 650 juta. Bagaimana pembagiannya menurut Islam?",
    "Setelah kepergian suami saya, saya dan ketiga anak kami (dua laki-laki dan satu perempuan) menerima warisan 820 juta rupiah. Bagaimana pembagiannya secara syar'i?",
    "Saya dan almarhum suami memiliki dua anak laki-laki dan tiga anak perempuan. Warisan sebesar 1,2 miliar ditinggalkan oleh beliau. Bagaimana seharusnya dibagi?",
    "Suami saya telah tiada. Kami memiliki satu anak laki-laki dan satu anak perempuan. Warisan yang tersisa sebesar 600 juta. Tolong bantu pembagiannya.",
    "Saya sebagai istri dari suami yang baru saja meninggal, ingin menanyakan pembagian warisan. Kami punya dua putra dan dua putri. Warisan berupa uang 950 juta rupiah.",
    "Warisan dari suami saya berjumlah 1 miliar. Kami dikaruniai tiga anak laki-laki dan dua anak perempuan. Bagaimana perhitungan warisnya?",
    "Saya kehilangan suami saya, dan kami memiliki dua anak laki-laki serta satu anak perempuan. Warisan yang ada berupa uang tunai 800 juta. Bagaimana pembagiannya menurut syariat?",
    "Kami baru kehilangan suami saya. Ia meninggalkan saya, tiga anak laki-laki, dan satu anak perempuan. Warisan sebesar 1,1 miliar rupiah. Mohon perhitungannya.",
    "Suami saya meninggal dunia tanpa meninggalkan hutang. Kami punya satu anak laki-laki dan dua anak perempuan. Uang warisan sebesar 700 juta. Bagaimana sebaiknya dibagikan?",
    "Saya ditinggal wafat suami tercinta. Kami memiliki dua putra dan tiga putri. Warisan senilai 1,3 miliar. Mohon dijelaskan bagian masing-masing.",
    "Setelah suami saya meninggal, saya bersama dua anak laki-laki dan satu anak perempuan mewarisi tabungan 850 juta. Bagaimana sebaiknya pembagiannya?",
    "Suami saya meninggalkan saya dan empat anak, terdiri dari dua anak laki-laki dan dua perempuan. Warisan berupa uang tunai 1 miliar. Bagaimana pembagian waris menurut Islam?",
    "Saya istri dari almarhum. Kami memiliki tiga anak laki-laki dan satu anak perempuan. Warisan 1,1 miliar rupiah. Tolong bantu hitung pembagian warisnya.",
    "Suami saya meninggal, meninggalkan saya, dua anak laki-laki, dan satu anak perempuan. Tidak ada utang, dan harta berupa uang 750 juta. Bagaimana pembagiannya?",
    "Kami punya dua anak laki-laki dan tiga anak perempuan. Setelah suami saya wafat, kami menerima warisan sebesar 1,2 miliar. Bagaimana cara membaginya?",
    "Saya ditinggal wafat suami. Kami dikaruniai satu anak laki-laki dan satu anak perempuan. Warisan yang tersedia 600 juta rupiah. Bagaimana pembagian waris menurut Islam?",
    "Suami saya wafat dan meninggalkan saya, satu anak laki-laki, serta dua anak perempuan. Warisan uang sebesar 700 juta rupiah. Bagaimana seharusnya pembagiannya?",
    "Kami memiliki tiga anak laki-laki dan dua anak perempuan. Setelah kepergian suami saya, tersisa uang warisan 1,1 miliar rupiah. Bagaimana pembagian warisnya?",
    "Suami saya meninggal dunia dan meninggalkan tabungan 900 juta rupiah. Kami memiliki dua anak laki-laki dan satu anak perempuan. Mohon dijelaskan pembagian waris sesuai syariat.",
    "Saya seorang istri yang ditinggal suami. Kami dikaruniai tiga anak laki-laki dan satu anak perempuan. Warisan sebesar 1 miliar. Bagaimana pembagiannya?",
    "Suami saya telah tiada. Kami memiliki dua putra dan dua putri. Harta yang tersisa berupa uang 1,2 miliar. Bagaimana sebaiknya dibagikan?",
    "Warisan dari almarhum suami saya adalah uang tunai 950 juta. Kami memiliki satu anak laki-laki dan dua anak perempuan. Bagaimana perhitungannya?",
    "Saya dan tiga anak saya (dua laki-laki dan satu perempuan) ditinggal suami saya. Warisan yang ada sebesar 800 juta rupiah. Bagaimana cara membaginya?",
    "Kami baru kehilangan suami saya. Ia meninggalkan saya, dua anak laki-laki, dan dua anak perempuan. Warisan 950 juta. Bagaimana sebaiknya dibagi?",
    "Suami saya meninggalkan saya bersama satu anak laki-laki dan satu anak perempuan. Warisan yang ditinggalkan berupa tabungan 600 juta. Mohon penjelasan perhitungannya.",
    "Saya seorang istri dengan tiga anak: dua laki-laki dan satu perempuan. Setelah suami saya meninggal, kami menerima warisan 850 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia. Kami punya dua anak laki-laki dan dua anak perempuan. Warisan berupa uang sebesar 1 miliar. Bagaimana pembagian waris sesuai hukum Islam?",
    "Saya ditinggal wafat suami. Kami memiliki tiga anak laki-laki dan satu anak perempuan. Warisan yang ditinggalkan 1,1 miliar rupiah. Bagaimana sebaiknya dibagi?",
    "Warisan dari suami saya adalah uang tunai sebesar 900 juta. Kami dikaruniai satu anak laki-laki dan dua anak perempuan. Bagaimana pembagiannya menurut Islam?",
    "Kami punya dua anak laki-laki dan satu anak perempuan. Setelah suami saya wafat, tersisa warisan sebesar 850 juta rupiah. Bagaimana cara membaginya secara adil?",
    "Suami saya wafat, dan kami memiliki dua anak laki-laki dan dua anak perempuan. Warisan 1 miliar rupiah. Mohon bantuan perhitungan pembagian warisnya.",
    "Saya dan tiga anak (dua laki-laki, satu perempuan) menerima warisan dari suami saya sebesar 950 juta. Bagaimana pembagian warisnya menurut syariah?",
    "Kami memiliki satu anak laki-laki dan dua anak perempuan. Setelah suami saya meninggal, tersisa warisan berupa uang 700 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal tanpa hutang, meninggalkan saya dan tiga anak: dua laki-laki dan satu perempuan. Warisan berupa uang sebesar 900 juta. Bagaimana cara membaginya?",
    "Saya satu-satunya istri dari almarhum yang meninggalkan dua anak laki-laki dan dua anak perempuan. Warisan 1,2 miliar rupiah. Bagaimana pembagian warisnya?",
    "Setelah wafatnya suami saya, kami menerima warisan sebesar 850 juta rupiah. Anak-anak kami terdiri dari satu putra dan dua putri. Bagaimana seharusnya dibagi?",
    "Warisan dari suami saya berupa tabungan sebesar 1 miliar rupiah. Kami memiliki tiga anak laki-laki dan dua anak perempuan. Mohon pembagian yang sesuai.",
    "Saya kehilangan suami saya. Kami dikaruniai dua anak laki-laki dan satu anak perempuan. Warisan 800 juta. Bagaimana pembagian menurut syariat?",
    "Kami memiliki dua anak laki-laki dan dua anak perempuan. Suami saya meninggal dan meninggalkan harta sebesar 1 miliar. Bagaimana cara membaginya?",
    "Saya ditinggal wafat suami saya. Kami punya satu anak laki-laki dan satu anak perempuan. Warisan yang tersedia 650 juta rupiah. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia. Kami punya dua anak laki-laki dan tiga anak perempuan. Uang yang ditinggalkan sebesar 1,2 miliar. Bagaimana seharusnya dibagi?",
    "Warisan dari almarhum suami saya adalah 950 juta rupiah. Kami memiliki dua anak laki-laki dan satu anak perempuan. Mohon perhitungkan pembagiannya.",
    "Saya ditinggal suami saya yang telah wafat. Kami punya tiga anak laki-laki dan satu anak perempuan. Warisan yang tersisa 1,1 miliar. Bagaimana pembagiannya?"
  ]
}