{
  "texts": [
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Warisan yang ditinggalkan sebesar 350 juta.",
    "Saya baru saja kehilangan suami, beliau meninggalkan dua anak perempuan, ayahnya, dan saya. Harta peninggalan bernilai 720 juta.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, tiga anak perempuan, serta ayah beliau. Total warisan 940 juta.",
    "Beberapa hari lalu, suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Harta warisan 280 juta.",
    "Saya kehilangan suami tercinta, ia meninggalkan dua anak perempuan, ayahnya, dan saya. Kekayaan yang ditinggalkan 650 juta.",
    "Suami saya meninggal, ahli warisnya adalah saya, tiga anak perempuan, dan ayahnya. Nilai warisan 890 juta.",
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Warisan berupa uang tunai sebesar 310 juta.",
    "Saya baru kehilangan suami, ia meninggalkan dua anak perempuan, ayahnya, dan saya. Peninggalan harta mencapai 570 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, tiga anak perempuan, dan ayah beliau. Warisan senilai 960 juta.",
    "Beberapa waktu lalu suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Nilai harta warisan 340 juta.",
    "Suami saya wafat, meninggalkan saya, dua anak perempuan, dan ayahnya. Harta peninggalan sebesar 780 juta.",
    "Saya kehilangan suami, beliau meninggalkan tiga anak perempuan, ayahnya, dan saya. Warisan mencapai 930 juta.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, satu anak perempuan, serta ayahnya. Harta bernilai 400 juta.",
    "Beberapa hari lalu suami saya wafat, meninggalkan saya, dua anak perempuan, dan ayahnya. Peninggalan 690 juta.",
    "Saya kehilangan suami tercinta, ia meninggalkan tiga anak perempuan, ayahnya, dan saya. Harta yang tersisa 950 juta.",
    "Suami saya meninggal, ahli warisnya adalah saya, satu anak perempuan, dan ayah beliau. Warisan senilai 320 juta.",
    "Suami saya wafat, meninggalkan saya, dua anak perempuan, dan ayahnya. Nilai warisan 740 juta.",
    "Saya baru kehilangan suami, ia meninggalkan tiga anak perempuan, ayahnya, dan saya. Peninggalan harta mencapai 910 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, satu anak perempuan, dan ayah beliau. Warisan 390 juta.",
    "Beberapa waktu lalu suami saya wafat, meninggalkan saya, dua anak perempuan, dan ayahnya. Kekayaan 610 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ayahnya. Harta peninggalan bernilai 970 juta.",
    "Saya kehilangan suami tercinta, ia meninggalkan satu anak perempuan, ayahnya, dan saya. Peninggalan senilai 360 juta.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, dua anak perempuan, serta ayahnya. Harta mencapai 750 juta.",
    "Beberapa hari lalu suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ayahnya. Warisan 980 juta.",
    "Saya baru kehilangan suami, beliau meninggalkan satu anak perempuan, ayahnya, dan saya. Kekayaan yang tersisa 330 juta.",
    "Suami saya meninggal, ahli warisnya adalah saya, dua anak perempuan, dan ayahnya. Harta warisan 620 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ayahnya. Peninggalan senilai 900 juta.",
    "Saya kehilangan suami tercinta, ia meninggalkan satu anak perempuan, ayahnya, dan saya. Warisan 350 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, dua anak perempuan, dan ayah beliau. Harta 700 juta.",
    "Beberapa waktu lalu suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ayahnya. Warisan senilai 960 juta.",
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Kekayaan mencapai 310 juta.",
    "Saya kehilangan suami, beliau meninggalkan dua anak perempuan, ayahnya, dan saya. Harta warisan 670 juta.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, tiga anak perempuan, serta ayahnya. Warisan bernilai 940 juta.",
    "Beberapa hari lalu suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Harta 300 juta.",
    "Saya kehilangan suami tercinta, ia meninggalkan dua anak perempuan, ayahnya, dan saya. Peninggalan mencapai 650 juta.",
    "Suami saya meninggal, ahli warisnya adalah saya, tiga anak perempuan, dan ayahnya. Warisan senilai 930 juta.",
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Kekayaan sebesar 340 juta.",
    "Saya baru kehilangan suami, ia meninggalkan dua anak perempuan, ayahnya, dan saya. Harta 690 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, tiga anak perempuan, dan ayah beliau. Warisan mencapai 980 juta.",
    "Beberapa waktu lalu suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Harta bernilai 360 juta.",
    "Suami saya wafat, meninggalkan saya, dua anak perempuan, dan ayahnya. Warisan 720 juta.",
    "Saya kehilangan suami, beliau meninggalkan tiga anak perempuan, ayahnya, dan saya. Harta peninggalan mencapai 950 juta.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, satu anak perempuan, serta ayahnya. Kekayaan 380 juta.",
    "Beberapa hari lalu suami saya wafat, meninggalkan saya, dua anak perempuan, dan ayahnya. Warisan 740 juta.",
    "Saya kehilangan suami tercinta, ia meninggalkan tiga anak perempuan, ayahnya, dan saya. Peninggalan senilai 960 juta.",
    "Suami saya meninggal, ahli warisnya adalah saya, satu anak perempuan, dan ayah beliau. Harta 320 juta.",
    "Suami saya wafat, meninggalkan saya, dua anak perempuan, dan ayahnya. Kekayaan mencapai 770 juta.",
    "Saya baru kehilangan suami, ia meninggalkan tiga anak perempuan, ayahnya, dan saya. Warisan senilai 980 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, satu anak perempuan, dan ayah beliau. Harta warisan 300 juta.",
    "Beberapa waktu lalu suami saya wafat, meninggalkan saya, dua anak perempuan, dan ayahnya. Peninggalan 680 juta.",
    "Setelah suami saya meninggal dunia, saya sebagai istrinya kini menjadi salah satu ahli waris bersama satu anak perempuan kami dan ayah mertua. Harta yang beliau tinggalkan senilai 410 juta rupiah.",
    "Suami saya berpulang beberapa minggu lalu, meninggalkan saya, dua anak perempuan yang masih sekolah, dan ayahnya. Nilai seluruh warisan mencapai 830 juta rupiah.",
    "Kepergian suami saya membawa duka mendalam. Beliau meninggalkan saya, tiga anak perempuan, serta ayahnya. Jumlah harta yang tersisa sekitar 970 juta rupiah.",
    "Saya baru saja kehilangan suami tercinta; ahli waris yang ditinggalkan meliputi saya, satu anak perempuan, dan ayah beliau. Kekayaan peninggalan sebesar 320 juta rupiah.",
    "Wafatnya suami saya membuat saya bersama dua anak perempuan dan ayahnya menjadi penerima warisan senilai 780 juta rupiah.",
    "Suami saya meninggal di usia 54 tahun, meninggalkan saya, tiga anak perempuan, dan ayahnya yang sudah sepuh. Total harta warisan mencapai 950 juta rupiah.",
    "Seusai wafatnya suami, ahli waris yang tersisa hanyalah saya, satu anak perempuan, dan ayah beliau. Nilai harta peninggalan 340 juta rupiah.",
    "Dalam keluarga kami, kini hanya saya, dua anak perempuan, dan ayah mertua yang menjadi ahli waris setelah suami meninggal. Harta beliau bernilai 720 juta rupiah.",
    "Suami saya wafat mendadak, meninggalkan saya, tiga anak perempuan, dan ayahnya. Warisan berupa uang tunai 910 juta rupiah.",
    "Sepeninggal suami, saya dan satu anak perempuan kami bersama ayah beliau menjadi ahli waris dari harta senilai 390 juta rupiah.",
    "Saya kehilangan suami secara tiba-tiba. Beliau meninggalkan dua anak perempuan, ayahnya, dan saya. Total kekayaan yang diwariskan adalah 650 juta rupiah.",
    "Kepergian suami saya membuat saya, tiga anak perempuan, dan ayahnya menjadi ahli waris. Nilai peninggalan mencapai 980 juta rupiah.",
    "Setelah suami saya meninggal dunia, tersisa saya, satu anak perempuan, dan ayahnya sebagai ahli waris. Jumlah harta 310 juta rupiah.",
    "Suami saya meninggal minggu lalu, meninggalkan dua anak perempuan, saya, dan ayahnya. Nilai kekayaan yang diwariskan mencapai 730 juta rupiah.",
    "Dalam musibah ini, suami saya meninggalkan saya, tiga anak perempuan, dan ayah beliau. Warisan bernilai 960 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal, dengan satu anak perempuan dan ayahnya sebagai ahli waris bersama saya. Peninggalan berupa 340 juta rupiah.",
    "Suami saya wafat dan ahli warisnya adalah saya, dua anak perempuan, serta ayahnya. Jumlah harta warisan 780 juta rupiah.",
    "Sepeninggal suami, saya bersama tiga anak perempuan dan ayahnya menerima warisan sebesar 940 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan saya, satu anak perempuan, dan ayahnya. Harta warisan 300 juta rupiah.",
    "Saya kehilangan suami tercinta. Ia meninggalkan dua anak perempuan, saya, dan ayahnya. Warisan bernilai 670 juta rupiah.",
    "Kepergian suami membuat saya, tiga anak perempuan, dan ayah beliau menjadi ahli waris sah atas harta 980 juta rupiah.",
    "Suami saya wafat, ahli warisnya adalah saya, satu anak perempuan, dan ayahnya. Kekayaan yang tersisa 350 juta rupiah.",
    "Setelah suami saya berpulang, saya, dua anak perempuan, dan ayahnya menjadi penerima harta warisan sebesar 740 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan saya, tiga anak perempuan, dan ayahnya. Peninggalan mencapai 920 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan satu anak perempuan, ayahnya, dan saya. Harta warisan 330 juta rupiah.",
    "Dalam keluarga kami, suami saya meninggalkan dua anak perempuan, ayahnya, dan saya. Kekayaan yang diwariskan mencapai 710 juta rupiah.",
    "Suami saya wafat, ahli warisnya adalah saya, tiga anak perempuan, dan ayah beliau. Warisan bernilai 950 juta rupiah.",
    "Setelah wafatnya suami, tersisa saya, satu anak perempuan, dan ayahnya untuk menerima peninggalan 310 juta rupiah.",
    "Saya baru kehilangan suami tercinta. Ia meninggalkan dua anak perempuan, saya, dan ayahnya. Warisan sebesar 690 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, tiga anak perempuan, dan ayahnya. Harta 970 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Nilai peninggalan 300 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan dua anak perempuan, ayahnya, dan saya. Warisan senilai 680 juta rupiah.",
    "Kepergian suami saya membuat saya, tiga anak perempuan, dan ayahnya menjadi ahli waris sah. Harta warisan mencapai 940 juta rupiah.",
    "Suami saya meninggal, ahli warisnya adalah saya, satu anak perempuan, dan ayah beliau. Kekayaan sebesar 350 juta rupiah.",
    "Seusai wafatnya suami, saya bersama dua anak perempuan dan ayahnya menerima warisan 750 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan saya, tiga anak perempuan, dan ayahnya. Harta warisan senilai 980 juta rupiah.",
    "Saya kehilangan suami tercinta, ia meninggalkan satu anak perempuan, ayahnya, dan saya. Warisan sebesar 360 juta rupiah.",
    "Suami saya wafat, ahli warisnya adalah saya, dua anak perempuan, dan ayahnya. Nilai peninggalan 720 juta rupiah.",
    "Dalam keluarga kami, suami saya meninggalkan tiga anak perempuan, ayahnya, dan saya. Harta mencapai 960 juta rupiah.",
    "Sepeninggal suami, saya dan satu anak perempuan kami bersama ayah beliau menerima warisan 340 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan dua anak perempuan, ayahnya, dan saya. Warisan senilai 700 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, tiga anak perempuan, serta ayahnya. Kekayaan mencapai 980 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Harta 310 juta rupiah.",
    "Saya kehilangan suami tercinta, ia meninggalkan dua anak perempuan, ayahnya, dan saya. Peninggalan sebesar 660 juta rupiah.",
    "Suami saya meninggal, ahli warisnya adalah saya, tiga anak perempuan, dan ayahnya. Warisan senilai 930 juta rupiah.",
    "Seusai wafatnya suami, tersisa saya, satu anak perempuan, dan ayahnya sebagai ahli waris sah. Kekayaan 320 juta rupiah.",
    "Saya baru kehilangan suami, beliau meninggalkan dua anak perempuan, ayahnya, dan saya. Warisan bernilai 740 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, tiga anak perempuan, dan ayahnya. Peninggalan mencapai 940 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, dan ayahnya. Harta warisan 300 juta rupiah.",
    "Saya kehilangan suami tercinta, ia meninggalkan dua anak perempuan, ayahnya, dan saya. Kekayaan yang tersisa 680 juta rupiah."
  ]
}