{
  "texts": [
    "Suami saya wafat dan meninggalkan tiga anak laki-laki serta ayah kandungnya. Tersisa harta sebesar 1,3 miliar dengan hutang 400 juta. Mohon bantuan pembagian warisnya.",
    "Suami saya baru saja meninggal dunia. Ia meninggalkan saya, dua anak laki-laki, serta ayah beliau. Warisan senilai 1,1 miliar, sementara hutangnya 200 juta. Bagaimana cara menghitungnya?",
    "Saya kehilangan suami tercinta. Beliau meninggalkan warisan 950 juta dan hutang 180 juta. Kami memiliki satu anak laki-laki dan ayah beliau masih hidup. Bagaimana pembagiannya?",
    "Suami saya meninggal dan meninggalkan empat anak laki-laki serta ayah kandungnya. Harta warisan senilai 1,6 miliar, sedangkan hutang beliau 500 juta. Mohon dijelaskan pembagian warisnya.",
    "Suami saya telah wafat. Ia meninggalkan saya, dua anak laki-laki, dan ayahnya. Warisan yang tersedia 1 miliar, namun masih ada hutang 250 juta. Bagaimana pembagiannya?",
    "Saya istri dari almarhum yang meninggalkan tiga anak laki-laki dan ayahnya. Warisan 1,2 miliar dengan beban hutang 300 juta. Tolong bantu pembagian waris sesuai hukum Islam.",
    "Suami saya berpulang dengan meninggalkan saya, dua anak laki-laki, dan ayah kandung beliau. Harta sebesar 900 juta dan hutang 150 juta. Bagaimana waris dibagi?",
    "Suami saya meninggal dunia. Kami memiliki satu anak laki-laki, dan ayah beliau masih hidup. Warisan yang tersisa 850 juta, namun ada hutang sebesar 100 juta. Mohon bantuannya.",
    "Suami saya wafat, meninggalkan saya, tiga anak laki-laki, serta ayah beliau. Total harta 1,4 miliar dan hutangnya mencapai 450 juta. Bagaimana perhitungan warisnya?",
    "Suami saya meninggal dan hanya meninggalkan dua anak laki-laki serta ayah kandungnya. Warisan 1 miliar dengan hutang 220 juta. Bagaimana pembagiannya?",
    "Suami saya berpulang dan meninggalkan satu anak laki-laki dan ayah beliau. Harta warisan 800 juta, sementara masih ada hutang 130 juta. Mohon panduan pembagiannya.",
    "Saya ditinggal wafat suami yang mewariskan 1,2 miliar dan meninggalkan hutang 350 juta. Ahli warisnya saya, dua anak laki-laki, dan ayah kandung beliau. Bagaimana warisan dibagi?",
    "Suami saya wafat dan meninggalkan saya bersama tiga anak laki-laki serta ayahnya. Warisan 1,3 miliar dan hutang 400 juta. Bagaimana pembagiannya?",
    "Suami saya baru saja wafat. Ia meninggalkan dua anak laki-laki dan ayah kandungnya. Warisan 950 juta dan hutang 150 juta. Bagaimana sebaiknya dibagi?",
    "Suami saya meninggal dunia. Kami memiliki tiga anak laki-laki dan ayah beliau masih hidup. Warisan 1,1 miliar dengan tanggungan hutang 300 juta. Mohon bantuan pembagiannya.",
    "Saya istri dari almarhum yang meninggalkan satu anak laki-laki dan ayah kandung. Warisan senilai 800 juta, hutang 90 juta. Bagaimana cara membaginya?",
    "Suami saya wafat, meninggalkan dua anak laki-laki dan ayahnya. Harta 1 miliar, namun beliau memiliki hutang 210 juta. Bagaimana pembagiannya sesuai hukum Islam?",
    "Suami saya berpulang dan meninggalkan tiga anak laki-laki serta ayah kandungnya. Warisan 1,4 miliar, tapi ada hutang 500 juta. Mohon bantuannya membagi waris.",
    "Suami saya wafat. Kami dikaruniai dua anak laki-laki, dan ayah beliau masih hidup. Warisan 1,1 miliar, tapi masih ada hutang 270 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia, meninggalkan saya, satu anak laki-laki, dan ayahnya. Harta sebesar 750 juta, namun ada hutang 120 juta. Bagaimana warisnya dihitung?",
    "Suami saya meninggal dan meninggalkan dua anak laki-laki serta ayah kandung beliau. Warisan 1,2 miliar, dengan beban hutang 340 juta. Bagaimana warisan dibagi?",
    "Suami saya wafat dan saya ditinggalkan bersama tiga anak laki-laki serta ayah kandung beliau. Harta senilai 1,3 miliar dan hutang 420 juta. Mohon panduan pembagiannya.",
    "Suami saya meninggal. Ia meninggalkan dua anak laki-laki dan ayah kandungnya. Warisan yang ada 1 miliar, hutangnya 250 juta. Bagaimana cara pembagiannya?",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan ayah beliau. Warisan 820 juta, namun masih ada hutang 100 juta. Bagaimana pembagian warisnya?",
    "Suami saya berpulang. Kami memiliki dua anak laki-laki dan ayah beliau masih hidup. Warisan sebesar 1,15 miliar, tapi ada hutang 290 juta. Bagaimana perhitungannya?",
    "Suami saya telah tiada. Ia meninggalkan saya, tiga anak laki-laki, dan ayahnya. Warisan 1,4 miliar dan hutang 450 juta. Mohon bantuannya membagi warisan.",
    "Saya kehilangan suami tercinta yang meninggalkan dua anak laki-laki dan ayah kandung beliau. Warisan sebesar 1 miliar, dengan tanggungan hutang 200 juta. Bagaimana pembagiannya?",
    "Suami saya wafat. Ia meninggalkan saya, satu anak laki-laki, dan ayah beliau. Harta sebesar 800 juta dan hutang 110 juta. Mohon petunjuk pembagiannya.",
    "Suami saya berpulang. Beliau meninggalkan tiga anak laki-laki dan ayah kandungnya. Warisan 1,3 miliar, namun memiliki hutang 400 juta. Bagaimana perhitungannya?",
    "Suami saya wafat dan meninggalkan dua anak laki-laki serta ayah kandung beliau. Warisan 1,05 miliar, dengan hutang 250 juta. Bagaimana pembagiannya?",
    "Saya istri dari suami yang telah meninggal dunia. Ia meninggalkan dua anak laki-laki dan ayah kandungnya. Warisan 980 juta dan hutang 190 juta. Mohon bantuannya.",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan ayah beliau. Warisan 800 juta, dengan beban hutang 100 juta. Bagaimana pembagian warisnya?",
    "Suami saya meninggal dan meninggalkan tiga anak laki-laki serta ayah kandung beliau. Warisan senilai 1,3 miliar, tapi masih ada hutang 400 juta. Bagaimana pembagiannya?",
    "Suami saya wafat dan kami memiliki dua anak laki-laki. Ayah kandung beliau juga masih hidup. Warisan 1 miliar dan hutang 240 juta. Bagaimana warisnya dibagi?",
    "Suami saya berpulang dan meninggalkan saya, satu anak laki-laki, dan ayah beliau. Harta sebesar 780 juta dan hutang 130 juta. Mohon bantuan perhitungannya.",
    "Suami saya meninggal dunia. Kami memiliki dua anak laki-laki dan ayahnya masih hidup. Warisan 1,1 miliar, tapi ada hutang 300 juta. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan saya bersama tiga anak laki-laki dan ayah kandung beliau. Warisan 1,5 miliar dan hutang 450 juta. Bagaimana perhitungan warisnya?",
    "Suami saya baru saja meninggal. Ia meninggalkan dua anak laki-laki dan ayah beliau. Warisan 1 miliar dan hutang 260 juta. Bagaimana warisan dibagi?",
    "Saya ditinggal wafat suami yang meninggalkan satu anak laki-laki dan ayah kandung beliau. Harta warisan 800 juta dan hutang 100 juta. Mohon bantuannya.",
    "Suami saya wafat dan meninggalkan saya bersama dua anak laki-laki serta ayahnya. Warisan 1,1 miliar, namun ada tanggungan hutang 280 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal. Ia meninggalkan saya, tiga anak laki-laki, dan ayah beliau. Warisan 1,4 miliar dan hutang 420 juta. Mohon penjelasan pembagian warisnya.",
    "Suami saya wafat, meninggalkan dua anak laki-laki dan ayah kandungnya. Warisan 1 miliar dengan hutang 250 juta. Bagaimana waris dibagi?",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan ayah beliau. Harta 800 juta dan hutang 120 juta. Mohon bantuannya dalam pembagian.",
    "Suami saya berpulang, meninggalkan saya, dua anak laki-laki, dan ayah kandung beliau. Warisan senilai 1,2 miliar, namun masih ada hutang 350 juta. Bagaimana cara membaginya?",
    "Suami saya wafat dan meninggalkan tiga anak laki-laki serta ayah kandung beliau. Warisan 1,3 miliar dengan hutang 400 juta. Bagaimana seharusnya dibagi?",
    "Suami saya meninggal dan meninggalkan saya serta dua anak laki-laki dan ayahnya. Warisan 1,1 miliar, dengan hutang 270 juta. Mohon bantuannya.",
    "Suami saya wafat, meninggalkan saya bersama satu anak laki-laki dan ayah kandung beliau. Warisan 850 juta dan hutang 140 juta. Bagaimana perhitungan warisnya?",
    "Suami saya berpulang. Ia meninggalkan tiga anak laki-laki dan ayah beliau. Warisan 1,3 miliar dan hutang 380 juta. Mohon bantuannya.",
    "Suami saya meninggal dan mewariskan harta 1 miliar. Ia meninggalkan dua anak laki-laki dan ayah kandung. Namun, beliau masih memiliki hutang 250 juta. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan saya, satu anak laki-laki, dan ayah kandungnya. Warisan senilai 780 juta dan hutang 130 juta. Bagaimana pembagiannya?",
    "Suami saya telah berpulang dan meninggalkan saya, tiga anak laki-laki, serta ayah beliau. Warisan mencapai 1,5 miliar, tetapi masih ada hutang 500 juta. Bagaimana pembagiannya?",
    "Saya kehilangan suami yang meninggalkan dua anak laki-laki dan ayah kandungnya. Warisan 1,1 miliar, namun masih tersisa hutang sebesar 260 juta. Bagaimana sebaiknya waris dibagi?",
    "Suami saya meninggal dunia. Ia meninggalkan satu anak laki-laki, ayah kandungnya, dan harta 750 juta dengan hutang 120 juta. Bagaimana pembagian warisnya?",
    "Suami saya wafat, meninggalkan saya sebagai istri, dua anak laki-laki, dan ayah beliau. Warisan 1,05 miliar dan hutang 240 juta. Bagaimana perhitungannya?",
    "Suami saya meninggal, meninggalkan saya, tiga anak laki-laki, dan ayahnya. Warisan yang tersedia 1,4 miliar dengan tanggungan hutang 430 juta. Bagaimana cara membaginya?",
    "Suami saya baru saja wafat. Ia meninggalkan dua anak laki-laki dan ayah kandung beliau. Warisan 950 juta dan hutang 200 juta. Mohon bantuan pembagian warisnya.",
    "Suami saya wafat dan kami memiliki satu anak laki-laki. Ayah beliau masih hidup. Warisan yang tersisa 800 juta dan hutang 100 juta. Bagaimana waris ini dibagi?",
    "Suami saya berpulang, meninggalkan tiga anak laki-laki dan ayah kandung. Warisan 1,2 miliar dengan hutang 350 juta. Bagaimana pembagian yang tepat?",
    "Saya istri dari suami yang meninggal. Ia meninggalkan dua anak laki-laki dan ayahnya. Warisan senilai 1 miliar dan hutang 230 juta. Bagaimana warisan dibagi?",
    "Suami saya wafat dan meninggalkan satu anak laki-laki serta ayah kandungnya. Warisan 780 juta dan hutang 110 juta. Bagaimana perhitungan warisnya?",
    "Suami saya meninggal dan meninggalkan saya bersama dua anak laki-laki dan ayah beliau. Warisan 1,1 miliar dan hutang 260 juta. Mohon bantuan pembagian waris.",
    "Suami saya wafat. Kami memiliki tiga anak laki-laki dan ayahnya masih hidup. Harta 1,3 miliar dan hutang 400 juta. Bagaimana pembagiannya menurut hukum Islam?",
    "Suami saya meninggal dunia, meninggalkan dua anak laki-laki serta ayah kandung beliau. Warisan 1 miliar dan hutang 250 juta. Mohon penjelasannya.",
    "Saya baru saja kehilangan suami. Ia meninggalkan saya, satu anak laki-laki, dan ayah kandung. Warisan 800 juta dan hutang 120 juta. Bagaimana cara pembagiannya?",
    "Suami saya wafat dan meninggalkan tiga anak laki-laki dan ayah beliau. Warisan sebesar 1,4 miliar dan hutang 420 juta. Bagaimana pembagian warisnya?",
    "Suami saya wafat. Ia meninggalkan dua anak laki-laki serta ayahnya. Harta warisan 1,05 miliar dan hutang 240 juta. Bagaimana seharusnya dibagi?",
    "Suami saya meninggal dunia, meninggalkan satu anak laki-laki dan ayah kandungnya. Warisan senilai 770 juta dengan hutang 130 juta. Bagaimana waris dibagi?",
    "Saya istri dari almarhum. Beliau meninggalkan saya, dua anak laki-laki, dan ayahnya. Warisan 1 miliar dan hutang 220 juta. Mohon bantuan pembagian warisan.",
    "Suami saya wafat dan meninggalkan tiga anak laki-laki serta ayah kandungnya. Warisan sebesar 1,3 miliar, namun masih ada hutang 380 juta. Bagaimana pembagian warisnya?",
    "Suami saya berpulang dan meninggalkan dua anak laki-laki serta ayah kandung beliau. Warisan 1,15 miliar dengan hutang 300 juta. Bagaimana sebaiknya dibagi?",
    "Suami saya wafat. Ia meninggalkan saya, satu anak laki-laki, dan ayahnya. Warisan 800 juta dan hutang 150 juta. Mohon bantuan menghitung warisan.",
    "Suami saya meninggal dan kami memiliki tiga anak laki-laki. Ayah beliau masih hidup. Warisan 1,4 miliar dan hutang 450 juta. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan saya dan dua anak laki-laki serta ayah kandung. Warisan 1,05 miliar dan hutang 260 juta. Mohon penjelasannya.",
    "Suami saya berpulang. Ia meninggalkan saya, satu anak laki-laki, dan ayah kandung beliau. Warisan 770 juta dengan hutang 110 juta. Bagaimana cara membaginya?",
    "Suami saya wafat dan meninggalkan saya, dua anak laki-laki, serta ayah kandung. Warisan 1,2 miliar dan hutang 320 juta. Bagaimana pembagiannya menurut syariat?",
    "Suami saya meninggal dunia. Kami memiliki satu anak laki-laki dan ayah beliau masih hidup. Warisan 780 juta dan hutang 130 juta. Mohon bantuan perhitungan waris.",
    "Suami saya wafat dan meninggalkan tiga anak laki-laki serta ayah beliau. Warisan 1,3 miliar dan hutang 400 juta. Bagaimana cara pembagiannya?",
    "Suami saya berpulang, meninggalkan dua anak laki-laki dan ayah kandung. Warisan 1,1 miliar dan hutang 270 juta. Mohon petunjuk pembagian warisan.",
    "Suami saya meninggal dan meninggalkan saya, satu anak laki-laki, serta ayah beliau. Warisan 800 juta dan hutang 120 juta. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan saya bersama tiga anak laki-laki dan ayah kandungnya. Warisan 1,5 miliar dan hutang 500 juta. Bagaimana perhitungannya?",
    "Suami saya wafat. Ia meninggalkan dua anak laki-laki serta ayah beliau. Warisan 1,1 miliar dan hutang 280 juta. Bagaimana warisnya dibagi?",
    "Suami saya meninggal dunia, meninggalkan satu anak laki-laki dan ayah kandung. Warisan 790 juta dan hutang 110 juta. Mohon perhitungan pembagian warisnya.",
    "Suami saya berpulang dan meninggalkan tiga anak laki-laki dan ayah kandung beliau. Warisan 1,4 miliar dan hutang 430 juta. Bagaimana perhitungannya?",
    "Suami saya wafat, meninggalkan saya sebagai istri, dua anak laki-laki, dan ayah beliau. Warisan 1 miliar dan hutang 240 juta. Bagaimana cara membaginya?",
    "Suami saya wafat dan meninggalkan saya, satu anak laki-laki, serta ayah kandungnya. Harta 760 juta dan hutang 100 juta. Mohon pembagian warisnya.",
    "Suami saya meninggal dunia. Kami memiliki dua anak laki-laki dan ayah beliau masih hidup. Warisan 1,05 miliar dan hutang 250 juta. Bagaimana waris dibagi?",
    "Suami saya wafat, meninggalkan tiga anak laki-laki serta ayah beliau. Warisan 1,3 miliar dan hutang 390 juta. Bagaimana sebaiknya dibagi?",
    "Suami saya berpulang, meninggalkan dua anak laki-laki dan ayah kandungnya. Warisan 1,15 miliar dan hutang 300 juta. Bagaimana pembagiannya?",
    "Suami saya wafat. Ia meninggalkan satu anak laki-laki dan ayahnya. Warisan 780 juta dan hutang 130 juta. Bagaimana perhitungan warisnya?",
    "Suami saya meninggal dan meninggalkan saya, dua anak laki-laki, serta ayah kandung beliau. Warisan 1 miliar dan hutang 260 juta. Mohon pembagiannya.",
    "Suami saya wafat, meninggalkan saya bersama tiga anak laki-laki dan ayah kandung. Warisan 1,4 miliar dan hutang 410 juta. Bagaimana cara membaginya?",
    "Suami saya wafat, meninggalkan dua anak laki-laki serta ayah kandungnya. Warisan 1,1 miliar dan hutang 270 juta. Bagaimana sebaiknya dibagi?",
    "Suami saya berpulang. Ia meninggalkan satu anak laki-laki dan ayahnya. Warisan 770 juta dan hutang 100 juta. Mohon bantuan perhitungan waris.",
    "Suami saya meninggal dunia. Kami memiliki tiga anak laki-laki dan ayah beliau masih hidup. Warisan 1,3 miliar dan hutang 390 juta. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan saya dan dua anak laki-laki serta ayah kandung beliau. Warisan 1,05 miliar dan hutang 250 juta. Mohon bantuan pembagian warisnya.",
    "Suami saya wafat dan meninggalkan satu anak laki-laki serta ayah kandung. Warisan 780 juta dan hutang 110 juta. Bagaimana pembagian yang sesuai?",
    "Suami saya meninggal dan meninggalkan tiga anak laki-laki serta ayahnya. Warisan 1,2 miliar dan hutang 370 juta. Mohon petunjuk perhitungan waris.",
    "Suami saya wafat. Ia meninggalkan dua anak laki-laki dan ayah kandung. Warisan 1 miliar dan hutang 250 juta. Bagaimana cara pembagiannya?",
    "Suami saya berpulang, meninggalkan saya, satu anak laki-laki, dan ayah beliau. Warisan 800 juta dan hutang 120 juta. Mohon bantuannya.",
    "Suami saya meninggal dunia. Ia meninggalkan saya, tiga anak laki-laki, dan ayah kandung. Warisan 1,4 miliar dan hutang 400 juta. Bagaimana pembagian waris sesuai syariat?"
  ]
}