{
  "texts": [
    "Suami saya wafat, meninggalkan dua anak laki-laki, satu anak perempuan, dan ayah kandung beliau. Warisan berupa uang tunai sebesar 1,2 miliar. Bagaimana pembagiannya?",
    "Suami saya baru saja meninggal dunia. Ia meninggalkan saya, tiga anak laki-laki, dua anak perempuan, dan ayah kandungnya. Warisan yang tersedia sebesar 1,6 miliar. Mohon penjelasan pembagiannya.",
    "Saya ditinggal wafat oleh suami tercinta. Kami memiliki satu anak laki-laki dan satu anak perempuan, serta ayah beliau masih hidup. Harta warisan senilai 900 juta. Bagaimana perhitungannya?",
    "Suami saya berpulang dan meninggalkan saya bersama dua anak laki-laki, dua anak perempuan, serta ayah kandungnya. Warisan sebesar 1,3 miliar. Mohon bantuannya dalam pembagian.",
    "Saya istri dari almarhum yang meninggalkan dua anak laki-laki, satu anak perempuan, dan ayahnya. Warisan yang ditinggalkan 1 miliar. Bagaimana cara membaginya?",
    "Suami saya wafat, meninggalkan saya, tiga anak laki-laki, satu anak perempuan, dan ayah kandungnya. Warisan berupa uang tunai sebesar 1,4 miliar. Bagaimana seharusnya dibagi?",
    "Suami saya meninggal dunia dan meninggalkan kami: saya, satu anak laki-laki, dua anak perempuan, serta ayah beliau. Harta warisan yang ada sebesar 850 juta. Mohon bantuannya.",
    "Suami saya telah tiada. Ia meninggalkan dua anak laki-laki, dua anak perempuan, dan ayah kandung beliau. Warisan senilai 1,25 miliar. Bagaimana pembagiannya menurut hukum Islam?",
    "Saya baru saja kehilangan suami. Ia mewariskan harta sebesar 1,1 miliar dan meninggalkan tiga anak laki-laki, satu anak perempuan, serta ayah kandungnya. Mohon penjelasan pembagiannya.",
    "Suami saya wafat dan meninggalkan saya, dua anak laki-laki, satu anak perempuan, dan ayah beliau. Warisan yang tersedia 1 miliar. Bagaimana cara membaginya?",
    "Suami saya meninggal dan meninggalkan satu anak laki-laki, satu anak perempuan, serta ayah kandungnya. Warisan senilai 950 juta. Mohon bantuan perhitungan warisnya.",
    "Suami saya wafat, meninggalkan saya bersama dua anak laki-laki, dua anak perempuan, dan ayah beliau. Warisan sebesar 1,2 miliar. Bagaimana pembagian warisnya?",
    "Suami saya telah meninggal. Kami memiliki tiga anak laki-laki dan dua anak perempuan, sementara ayah beliau masih hidup. Warisan yang tersedia 1,6 miliar. Bagaimana sebaiknya dibagi?",
    "Suami saya meninggal dan meninggalkan saya, satu anak laki-laki, dua anak perempuan, serta ayahnya. Warisan sebesar 980 juta. Bagaimana pembagian warisnya?",
    "Saya ditinggalkan suami tercinta. Beliau meninggalkan dua anak laki-laki, satu anak perempuan, dan ayahnya. Warisan berupa uang tunai sebesar 1 miliar. Mohon petunjuk pembagiannya.",
    "Suami saya wafat. Kami dikaruniai satu anak laki-laki, dua anak perempuan, dan ayah kandung beliau masih hidup. Warisan senilai 890 juta. Bagaimana cara membaginya?",
    "Suami saya berpulang dan meninggalkan saya, tiga anak laki-laki, satu anak perempuan, serta ayahnya. Harta warisan yang ada sebesar 1,3 miliar. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia. Beliau meninggalkan dua anak laki-laki, dua anak perempuan, dan ayah kandung. Warisan 1,25 miliar. Mohon penjelasannya.",
    "Suami saya wafat, meninggalkan saya bersama satu anak laki-laki, satu anak perempuan, dan ayahnya. Harta peninggalan sebesar 900 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dan meninggalkan tiga anak laki-laki, dua anak perempuan, serta ayah kandung beliau. Warisan 1,5 miliar. Bagaimana warisnya dibagi?",
    "Saya kehilangan suami yang meninggalkan dua anak laki-laki, dua anak perempuan, dan ayahnya. Warisan senilai 1,2 miliar. Mohon bantuannya.",
    "Suami saya telah tiada. Ia meninggalkan saya, satu anak laki-laki, dua anak perempuan, dan ayah beliau. Warisan 950 juta. Bagaimana perhitungannya?",
    "Suami saya wafat dan meninggalkan saya bersama dua anak laki-laki, satu anak perempuan, serta ayah kandung. Harta warisan sebesar 1,1 miliar. Mohon petunjuk pembagiannya.",
    "Suami saya meninggal dunia. Kami memiliki tiga anak laki-laki dan satu anak perempuan. Ayah kandung beliau juga masih hidup. Warisan 1,4 miliar. Bagaimana waris ini dibagi?",
    "Suami saya wafat, meninggalkan dua anak laki-laki dan dua anak perempuan serta ayah kandung beliau. Warisan yang tersedia 1,2 miliar. Bagaimana cara membaginya?",
    "Suami saya meninggal, meninggalkan saya dan satu anak laki-laki, satu anak perempuan, serta ayah kandungnya. Warisan sebesar 870 juta. Bagaimana pembagiannya?",
    "Saya baru saja kehilangan suami. Ia meninggalkan dua anak laki-laki, satu anak perempuan, dan ayah beliau. Warisan 1 miliar. Bagaimana perhitungan warisnya?",
    "Suami saya wafat, meninggalkan tiga anak laki-laki, dua anak perempuan, dan ayahnya. Warisan berupa uang tunai sebesar 1,6 miliar. Bagaimana cara pembagiannya?",
    "Suami saya wafat dan meninggalkan satu anak laki-laki, dua anak perempuan, serta ayah kandungnya. Warisan 900 juta. Mohon penjelasan pembagian warisnya.",
    "Suami saya berpulang. Kami memiliki dua anak laki-laki dan satu anak perempuan. Ayah beliau masih hidup. Warisan senilai 1,15 miliar. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia. Ia meninggalkan saya, dua anak laki-laki, dua anak perempuan, dan ayahnya. Warisan sebesar 1,3 miliar. Bagaimana pembagian warisnya?",
    "Saya istri dari almarhum yang meninggalkan satu anak laki-laki, dua anak perempuan, dan ayah kandungnya. Warisan senilai 950 juta. Mohon bantuannya dalam pembagian.",
    "Suami saya wafat dan meninggalkan tiga anak laki-laki, satu anak perempuan, serta ayah beliau. Warisan 1,4 miliar. Bagaimana pembagiannya menurut hukum Islam?",
    "Suami saya telah tiada. Ia meninggalkan saya bersama dua anak laki-laki, satu anak perempuan, dan ayah kandungnya. Harta warisan sebesar 1,1 miliar. Bagaimana waris dibagi?",
    "Suami saya meninggal dunia dan meninggalkan saya, satu anak laki-laki, satu anak perempuan, dan ayah beliau. Warisan 870 juta. Bagaimana pembagiannya?",
    "Suami saya wafat dan meninggalkan saya serta tiga anak laki-laki, dua anak perempuan, dan ayah kandungnya. Harta warisan 1,5 miliar. Mohon bantuan perhitungan warisnya.",
    "Suami saya meninggal, meninggalkan dua anak laki-laki, satu anak perempuan, dan ayahnya. Warisan senilai 1 miliar. Bagaimana seharusnya dibagi?",
    "Suami saya wafat dan kami memiliki satu anak laki-laki, dua anak perempuan. Ayah kandung beliau juga masih hidup. Warisan sebesar 900 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia dan meninggalkan dua anak laki-laki, dua anak perempuan, serta ayah beliau. Warisan 1,2 miliar. Bagaimana perhitungannya?",
    "Suami saya wafat dan meninggalkan saya, satu anak laki-laki, satu anak perempuan, dan ayah kandungnya. Warisan sebesar 890 juta. Mohon penjelasannya.",
    "Suami saya berpulang, meninggalkan tiga anak laki-laki dan satu anak perempuan serta ayah beliau. Warisan 1,35 miliar. Bagaimana cara membaginya?",
    "Suami saya wafat. Kami memiliki dua anak laki-laki dan dua anak perempuan, serta ayah kandung beliau. Harta warisan 1,2 miliar. Bagaimana warisan ini dibagi?",
    "Suami saya meninggal dan meninggalkan saya bersama satu anak laki-laki, dua anak perempuan, dan ayahnya. Warisan senilai 950 juta. Mohon penjelasan pembagiannya.",
    "Suami saya wafat, meninggalkan dua anak laki-laki, satu anak perempuan, dan ayah beliau. Warisan 1 miliar. Bagaimana seharusnya dibagi?",
    "Suami saya telah meninggal. Kami dikaruniai dua anak laki-laki, dua anak perempuan, dan ayah beliau masih hidup. Warisan sebesar 1,3 miliar. Bagaimana pembagian warisnya?",
    "Suami saya wafat, meninggalkan satu anak laki-laki, satu anak perempuan, dan ayah kandungnya. Warisan 880 juta. Mohon bantuannya.",
    "Suami saya meninggal dunia dan meninggalkan tiga anak laki-laki, dua anak perempuan, serta ayah beliau. Warisan 1,6 miliar. Bagaimana waris ini dibagi?",
    "Suami saya wafat dan kami memiliki dua anak laki-laki, satu anak perempuan, dan ayah kandung beliau. Warisan sebesar 1,15 miliar. Bagaimana perhitungannya?",
    "Suami saya berpulang, meninggalkan saya, satu anak laki-laki, dua anak perempuan, dan ayah kandungnya. Warisan 900 juta. Bagaimana cara membaginya?",
    "Suami saya wafat dan meninggalkan dua anak laki-laki, satu anak perempuan, serta ayah kandung beliau. Warisan senilai 1 miliar. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia dan mewariskan harta senilai 1,3 miliar. Ia meninggalkan dua anak laki-laki, satu anak perempuan, dan ayah kandung. Bagaimana pembagian warisnya?",
    "Saya kehilangan suami yang meninggalkan saya bersama tiga anak laki-laki, dua anak perempuan, serta ayah beliau. Warisan yang tersisa adalah 1,5 miliar. Mohon penjelasannya.",
    "Suami saya wafat, meninggalkan saya, dua anak laki-laki dan dua anak perempuan, serta ayah kandungnya. Harta warisan mencapai 1,2 miliar. Bagaimana pembagian yang tepat?",
    "Suami saya meninggal dan meninggalkan satu anak laki-laki, dua anak perempuan, dan ayah kandungnya. Warisan berupa 890 juta. Bagaimana warisnya dibagi?",
    "Saya baru saja kehilangan suami. Ia meninggalkan tiga anak laki-laki, satu anak perempuan, dan ayahnya. Warisan sebesar 1,4 miliar. Mohon bantuan pembagiannya.",
    "Suami saya wafat, meninggalkan dua anak laki-laki dan satu anak perempuan serta ayah kandungnya. Warisan senilai 1 miliar. Bagaimana seharusnya waris dibagi?",
    "Suami saya meninggal dunia. Ia meninggalkan saya, dua anak laki-laki, dua anak perempuan, serta ayah beliau. Warisan 1,3 miliar. Bagaimana perhitungan pembagian waris?",
    "Suami saya wafat dan meninggalkan satu anak laki-laki, dua anak perempuan, dan ayahnya. Harta yang tersedia sebesar 900 juta. Bagaimana pembagiannya?",
    "Saya ditinggal wafat oleh suami yang meninggalkan dua anak laki-laki, satu anak perempuan, dan ayah kandung. Warisan yang ditinggalkan sebesar 1,05 miliar. Bagaimana warisnya?",
    "Suami saya meninggal dan meninggalkan saya bersama tiga anak laki-laki, dua anak perempuan, dan ayah beliau. Warisan senilai 1,6 miliar. Mohon penjelasan pembagiannya.",
    "Suami saya wafat. Kami memiliki satu anak laki-laki, satu anak perempuan, dan ayah kandung beliau masih hidup. Warisan 850 juta. Bagaimana cara membaginya?",
    "Suami saya berpulang dan meninggalkan dua anak laki-laki serta dua anak perempuan. Ayah kandung beliau juga masih hidup. Warisan 1,2 miliar. Bagaimana pembagian warisnya?",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan satu anak perempuan, serta ayahnya. Warisan 800 juta. Mohon bantuan pembagiannya.",
    "Suami saya meninggal dunia dan meninggalkan saya, dua anak laki-laki, satu anak perempuan, dan ayah beliau. Warisan 1 miliar. Bagaimana cara pembagian yang adil?",
    "Suami saya wafat, meninggalkan dua anak laki-laki dan dua anak perempuan serta ayahnya. Warisan sebesar 1,2 miliar. Bagaimana pembagiannya?",
    "Saya ditinggalkan suami tercinta yang meninggalkan tiga anak laki-laki, satu anak perempuan, dan ayah beliau. Warisan 1,4 miliar. Mohon penjelasan pembagian waris.",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan dua anak perempuan serta ayah kandungnya. Warisan yang tersedia sebesar 870 juta. Bagaimana waris dibagi?",
    "Suami saya meninggal dan meninggalkan dua anak laki-laki dan satu anak perempuan serta ayahnya. Warisan senilai 1 miliar. Mohon panduan pembagiannya.",
    "Suami saya wafat. Kami memiliki dua anak laki-laki dan dua anak perempuan, serta ayah beliau masih hidup. Warisan 1,2 miliar. Bagaimana pembagian waris sesuai syariat?",
    "Suami saya berpulang dan meninggalkan saya bersama satu anak laki-laki, satu anak perempuan, dan ayah kandungnya. Warisan 850 juta. Bagaimana perhitungannya?",
    "Suami saya meninggal dan meninggalkan dua anak laki-laki, dua anak perempuan, serta ayah beliau. Warisan 1,25 miliar. Mohon penjelasan pembagian warisnya.",
    "Suami saya wafat dan kami memiliki tiga anak laki-laki, satu anak perempuan, serta ayah kandung beliau. Warisan 1,35 miliar. Bagaimana pembagian warisan yang benar?",
    "Suami saya meninggal dunia. Beliau meninggalkan saya, satu anak laki-laki, dua anak perempuan, dan ayah kandung. Warisan 900 juta. Bagaimana warisan dibagi?",
    "Suami saya wafat dan meninggalkan dua anak laki-laki serta satu anak perempuan. Ayah beliau masih hidup. Warisan yang tersedia sebesar 1,1 miliar. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia dan meninggalkan saya, satu anak laki-laki, satu anak perempuan, serta ayah kandung beliau. Warisan senilai 850 juta. Bagaimana pembagian warisnya?",
    "Suami saya wafat. Ia meninggalkan dua anak laki-laki, dua anak perempuan, dan ayah kandungnya. Warisan sebesar 1,2 miliar. Bagaimana cara membaginya?",
    "Suami saya berpulang, meninggalkan saya, tiga anak laki-laki, satu anak perempuan, dan ayah beliau. Harta warisan 1,3 miliar. Mohon perhitungannya.",
    "Suami saya meninggal dan meninggalkan dua anak laki-laki, satu anak perempuan, serta ayah kandung beliau. Warisan 1 miliar. Bagaimana waris dibagi?",
    "Suami saya wafat, meninggalkan saya dengan satu anak laki-laki, dua anak perempuan, dan ayah beliau. Warisan 900 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia dan meninggalkan saya, dua anak laki-laki, dua anak perempuan, dan ayah kandung. Warisan 1,3 miliar. Bagaimana warisan ini dibagikan?",
    "Suami saya wafat. Ia meninggalkan dua anak laki-laki dan satu anak perempuan serta ayah kandungnya. Warisan 1,05 miliar. Bagaimana pembagiannya menurut Islam?",
    "Suami saya berpulang dan meninggalkan saya bersama satu anak laki-laki, satu anak perempuan, dan ayah beliau. Warisan 850 juta. Mohon perhitungannya.",
    "Suami saya wafat dan meninggalkan dua anak laki-laki, dua anak perempuan, serta ayah kandung. Warisan senilai 1,2 miliar. Bagaimana sebaiknya dibagi?",
    "Suami saya wafat. Ia meninggalkan saya, satu anak laki-laki dan dua anak perempuan serta ayah kandungnya. Warisan 890 juta. Bagaimana waris dibagi?",
    "Suami saya meninggal dunia dan meninggalkan dua anak laki-laki, satu anak perempuan, serta ayahnya. Warisan 1 miliar. Mohon bantuan pembagian waris.",
    "Suami saya wafat. Kami memiliki satu anak laki-laki, satu anak perempuan, dan ayah kandung beliau. Warisan yang ditinggalkan 870 juta. Bagaimana pembagian warisnya?",
    "Suami saya meninggal dan meninggalkan saya bersama tiga anak laki-laki dan satu anak perempuan serta ayah beliau. Warisan sebesar 1,4 miliar. Bagaimana seharusnya dibagi?",
    "Suami saya wafat. Ia meninggalkan dua anak laki-laki, dua anak perempuan, dan ayah kandungnya. Warisan 1,25 miliar. Bagaimana cara pembagiannya?",
    "Suami saya wafat, meninggalkan saya, satu anak laki-laki, dua anak perempuan, dan ayah beliau. Warisan 910 juta. Bagaimana perhitungannya?",
    "Suami saya meninggal dan meninggalkan dua anak laki-laki, satu anak perempuan, dan ayahnya. Warisan 1,05 miliar. Bagaimana warisan ini dibagi?",
    "Suami saya wafat dan kami memiliki satu anak laki-laki, satu anak perempuan, serta ayah kandung beliau. Warisan 880 juta. Bagaimana pembagian warisnya?",
    "Suami saya meninggal dunia. Ia meninggalkan dua anak laki-laki, dua anak perempuan, dan ayah kandung. Warisan 1,2 miliar. Mohon pembagiannya.",
    "Suami saya wafat dan meninggalkan saya bersama tiga anak laki-laki, satu anak perempuan, serta ayahnya. Warisan 1,35 miliar. Bagaimana pembagian waris yang benar?",
    "Suami saya berpulang. Ia meninggalkan satu anak laki-laki, dua anak perempuan, dan ayah kandungnya. Warisan 890 juta. Bagaimana waris dibagi?",
    "Suami saya wafat dan meninggalkan dua anak laki-laki serta satu anak perempuan. Ayah beliau masih hidup. Warisan sebesar 1,05 miliar. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia dan meninggalkan saya, satu anak laki-laki, dua anak perempuan, dan ayah kandung beliau. Warisan 900 juta. Mohon penjelasan pembagiannya.",
    "Suami saya wafat, meninggalkan dua anak laki-laki, dua anak perempuan, serta ayahnya. Warisan 1,2 miliar. Bagaimana pembagiannya menurut hukum Islam?",
    "Suami saya wafat dan meninggalkan saya bersama satu anak laki-laki, satu anak perempuan, dan ayah kandung. Warisan 860 juta. Bagaimana waris ini dibagi?",
    "Suami saya meninggal dunia. Ia meninggalkan saya, dua anak laki-laki, satu anak perempuan, dan ayahnya. Warisan 1 miliar. Bagaimana cara membaginya?",
    "Suami saya wafat dan meninggalkan dua anak laki-laki, dua anak perempuan, serta ayah kandung beliau. Warisan 1,25 miliar. Mohon pembagian warisnya."
  ]
}