{
	"texts": [
		"Ayah saya telah wafat. Beliau meninggalkan ibu saya dan saya serta satu saudara laki-laki. Warisan berupa uang tunai sebesar 800 juta rupiah. Namun, beliau masih memiliki hutang sebesar 200 juta. Bagaimana pembagian warisnya?",
		"Saya ingin menanyakan warisan ayah saya. Beliau meninggalkan seorang istri dan dua anak laki-laki. Uang warisan yang tersedia sebesar 1 miliar, tapi ada hutang 150 juta rupiah. Bagaimana pembagian yang tepat?",
		"Ayah saya meninggal dunia, meninggalkan ibu saya dan saya sebagai anak tunggal. Warisan berupa uang 500 juta rupiah. Namun, beliau memiliki hutang sebesar 100 juta rupiah. Bagaimana pembagiannya?",
		"Kami baru saja kehilangan ayah. Beliau meninggalkan istri dan tiga anak laki-laki. Warisan berupa uang 1,2 miliar rupiah. Hutangnya mencapai 300 juta. Bagaimana sebaiknya pembagian warisan dilakukan?",
		"Ayah saya wafat dan meninggalkan tabungan senilai 700 juta rupiah, namun masih memiliki hutang sebesar 200 juta rupiah. Beliau meninggalkan seorang istri dan dua anak laki-laki. Bagaimana pembagiannya?",
		"Saya ingin bertanya tentang warisan ayah saya. Beliau meninggal dunia dan meninggalkan ibu saya, saya, serta dua saudara laki-laki. Warisan sebesar 900 juta, tetapi ada utang 250 juta. Bagaimana perhitungan warisnya?",
		"Ayah saya telah meninggal dan memiliki hutang sebesar 100 juta rupiah. Beliau meninggalkan seorang istri dan satu anak laki-laki, yaitu saya. Tabungan yang tersedia 600 juta. Bagaimana pembagian warisnya?",
		"Saya anak laki-laki dari almarhum ayah saya. Beliau meninggalkan ibu saya dan dua anak laki-laki. Harta warisan berupa 850 juta, dengan utang 300 juta. Mohon penjelasan pembagian sesuai syariat.",
		"Ayah saya telah tiada. Ia meninggalkan istri dan empat anak laki-laki. Warisan 1,5 miliar dan hutang 400 juta rupiah. Bagaimana pembagian yang sesuai dengan hukum Islam?",
		"Saya ingin mengetahui bagaimana menghitung warisan ayah saya. Beliau meninggal dengan meninggalkan ibu saya dan tiga anak laki-laki. Warisan 1 miliar, hutang 150 juta rupiah. Bagaimana warisnya dibagi?",
		"Ayah saya wafat dan memiliki tanggungan hutang sebesar 120 juta. Warisan berupa tabungan 700 juta. Beliau meninggalkan seorang istri dan dua anak laki-laki. Mohon bantuannya menghitung warisan.",
		"Kami kehilangan ayah kami. Beliau meninggalkan seorang istri dan lima anak laki-laki. Tabungan 2 miliar, tapi ada hutang 600 juta. Bagaimana pembagian warisan setelah dikurangi utang?",
		"Saya satu-satunya anak laki-laki dari ayah saya yang meninggal. Beliau meninggalkan ibu saya dan memiliki hutang 80 juta rupiah. Warisan berupa uang 500 juta. Bagaimana pembagiannya?",
		"Ayah saya meninggal dan meninggalkan seorang istri serta tiga anak laki-laki. Warisan berupa uang 1,1 miliar rupiah. Ada hutang 250 juta. Bagaimana sebaiknya warisan dibagi?",
		"Ayah saya wafat dengan meninggalkan istri dan dua anak laki-laki. Warisan 850 juta rupiah. Hutang yang belum dibayar sebesar 200 juta rupiah. Bagaimana pembagian warisan sesuai hukum Islam?",
		"Saya ingin bertanya tentang perhitungan warisan. Ayah saya meninggal dunia dengan meninggalkan ibu saya dan saya serta dua saudara laki-laki. Warisan 950 juta, dan ada utang 300 juta. Bagaimana warisnya?",
		"Saya adalah anak laki-laki dari ayah saya yang telah meninggal. Ia meninggalkan ibu saya dan satu anak laki-laki. Warisan berupa 600 juta, dengan utang 150 juta rupiah. Bagaimana cara menghitung warisnya?",
		"Ayah saya telah meninggal dunia dan meninggalkan utang sebesar 200 juta rupiah. Warisan yang tersisa 700 juta. Beliau meninggalkan seorang istri dan tiga anak laki-laki. Bagaimana pembagiannya?",
		"Kami sedang mengurus harta warisan ayah kami. Beliau meninggal dengan meninggalkan istri dan dua anak laki-laki. Warisan berupa 800 juta, namun ada hutang 180 juta. Bagaimana pembagian menurut syariat?",
		"Saya ingin penjelasan tentang pembagian waris ayah saya yang meninggal. Beliau meninggalkan seorang istri dan empat anak laki-laki. Warisan 1,3 miliar rupiah. Utangnya mencapai 350 juta. Bagaimana perhitungannya?",
		"Ayah saya wafat dan hanya meninggalkan saya serta ibu saya. Saya anak tunggal. Warisan 500 juta, dengan hutang 100 juta rupiah. Bagaimana waris dibagi?",
		"Ayah saya meninggal, meninggalkan ibu saya dan saya serta dua saudara laki-laki. Warisan 900 juta dan utang sebesar 250 juta rupiah. Bagaimana pembagiannya menurut hukum Islam?",
		"Saya ingin mengetahui bagaimana membagi warisan ayah saya. Beliau meninggalkan ibu saya dan satu anak laki-laki. Warisan berupa 400 juta, tapi ada hutang 80 juta. Bagaimana warisnya?",
		"Ayah saya telah meninggal dan memiliki hutang sebesar 200 juta rupiah. Warisan berupa tabungan 850 juta rupiah. Beliau meninggalkan istri dan dua anak laki-laki. Bagaimana pembagiannya?",
		"Saya ingin bertanya mengenai warisan ayah saya. Beliau meninggalkan ibu saya dan tiga anak laki-laki. Warisan berupa uang 1 miliar, ada hutang sebesar 300 juta. Bagaimana waris tersebut dibagi?",
		"Kami baru saja kehilangan ayah. Warisan sebesar 1,1 miliar dan ada hutang 400 juta rupiah. Beliau meninggalkan seorang istri dan empat anak laki-laki. Bagaimana pembagiannya?",
		"Ayah saya wafat dan meninggalkan istri serta dua anak laki-laki. Warisan berupa uang 700 juta rupiah. Namun beliau memiliki utang 200 juta. Bagaimana perhitungan warisnya?",
		"Saya ingin mengetahui perhitungan warisan ayah saya yang wafat. Beliau meninggalkan ibu saya dan saya sebagai anak laki-laki tunggal. Warisan 550 juta, hutang 150 juta. Bagaimana dibagi?",
		"Ayah saya meninggal dan meninggalkan harta senilai 1 miliar rupiah, serta hutang sebesar 300 juta. Beliau meninggalkan seorang istri dan tiga anak laki-laki. Bagaimana pembagiannya?",
		"Saya anak laki-laki dari ayah saya yang telah meninggal. Beliau meninggalkan istri dan lima anak laki-laki. Warisan berupa uang 2 miliar, namun ada utang 800 juta. Bagaimana pembagiannya?",
		"Ayah saya wafat, meninggalkan ibu saya dan dua anak laki-laki. Warisan senilai 950 juta rupiah. Namun, beliau memiliki utang 400 juta. Bagaimana pembagiannya secara syariat?",
		"Kami sedang mengurus pembagian warisan ayah kami. Beliau meninggal dan meninggalkan seorang istri serta tiga anak laki-laki. Warisan 1,3 miliar, tapi masih ada hutang 500 juta. Bagaimana dibagi?",
		"Ayah saya meninggal dan hanya meninggalkan ibu saya serta saya seorang diri sebagai anak laki-laki. Warisan 450 juta, ada utang 100 juta. Bagaimana pembagian warisnya?",
		"Ayah saya telah meninggal dunia dan meninggalkan tabungan 600 juta rupiah. Beliau meninggalkan istri dan dua anak laki-laki, namun memiliki hutang 200 juta. Bagaimana perhitungannya?",
		"Saya ingin bertanya mengenai warisan ayah saya yang wafat. Beliau meninggalkan ibu saya dan tiga anak laki-laki. Warisan berupa uang 1 miliar rupiah, tapi ada utang 350 juta. Bagaimana cara membaginya?",
		"Ayah saya wafat dan memiliki utang sebesar 250 juta rupiah. Warisan 800 juta. Beliau meninggalkan istri dan dua anak laki-laki. Bagaimana pembagian waris setelah utang dilunasi?",
		"Saya adalah anak laki-laki dari pewaris yang meninggal. Beliau meninggalkan ibu saya dan saya sebagai anak tunggal. Warisan 600 juta, ada utang 200 juta rupiah. Bagaimana pembagian menurut hukum Islam?",
		"Ayah saya wafat dan meninggalkan tabungan senilai 700 juta rupiah. Beliau juga memiliki utang 250 juta rupiah. Pewaris yang ditinggalkan adalah istri dan tiga anak laki-laki. Bagaimana pembagian warisnya?",
		"Saya anak laki-laki dari ayah saya yang wafat. Beliau meninggalkan ibu saya dan dua saudara laki-laki. Warisan 950 juta rupiah, namun ada hutang 300 juta. Bagaimana seharusnya pembagiannya?",
		"Ayah saya telah meninggal, meninggalkan istri dan empat anak laki-laki. Warisan berupa uang 1,4 miliar rupiah. Terdapat hutang 450 juta. Bagaimana warisan dibagikan?",
		"Saya ingin bertanya tentang warisan ayah saya yang meninggal. Beliau meninggalkan ibu saya dan saya sebagai anak laki-laki tunggal. Warisan 500 juta, dengan utang 120 juta. Bagaimana pembagiannya?",
		"Ayah saya wafat dan meninggalkan harta warisan senilai 1 miliar rupiah. Beliau memiliki hutang 300 juta dan meninggalkan istri serta tiga anak laki-laki. Bagaimana pembagian warisnya?",
		"Saya sebagai anak laki-laki ingin bertanya tentang warisan ayah saya. Ia meninggalkan ibu saya dan dua anak laki-laki. Warisan 850 juta, ada utang 250 juta. Bagaimana cara membaginya?",
		"Ayah saya meninggal dan memiliki tanggungan utang sebesar 200 juta. Beliau meninggalkan seorang istri dan tiga anak laki-laki. Uang warisan sebesar 900 juta rupiah. Bagaimana pembagiannya?",
		"Ayah saya wafat dan meninggalkan istri serta empat anak laki-laki. Warisan 1,3 miliar rupiah. Namun, beliau berutang sebesar 400 juta. Bagaimana perhitungannya?",
		"Saya anak tunggal dari ayah saya yang wafat. Ia meninggalkan ibu saya dan warisan sebesar 600 juta rupiah, namun memiliki hutang 150 juta. Bagaimana pembagian warisnya?",
		"Kami kehilangan ayah dan sedang mengurus warisan. Beliau meninggalkan istri dan dua anak laki-laki. Warisan 800 juta, utang 200 juta. Bagaimana pembagian setelah pelunasan utang?",
		"Ayah saya wafat, meninggalkan ibu saya dan saya serta tiga saudara laki-laki. Warisan berupa 1,5 miliar, dengan utang 500 juta. Bagaimana pembagiannya menurut syariat Islam?",
		"Saya ingin bertanya mengenai harta peninggalan ayah saya. Beliau meninggal dan meninggalkan seorang istri dan dua anak laki-laki. Warisan sebesar 750 juta rupiah, ada utang 250 juta. Bagaimana warisnya?",
		"Ayah saya meninggal dan memiliki utang sebesar 300 juta. Warisan berupa uang tunai 1 miliar rupiah. Beliau meninggalkan istri dan tiga anak laki-laki. Bagaimana pembagian warisnya menurut Islam?",
		"Saya ingin menanyakan warisan ayah saya. Beliau meninggalkan ibu saya, saya, dan satu saudara laki-laki. Warisan berupa uang 700 juta rupiah, tetapi ayah memiliki hutang 200 juta. Bagaimana pembagiannya?",
		"Ayah saya wafat dan meninggalkan harta warisan sebesar 800 juta rupiah. Beliau meninggalkan seorang istri dan dua anak laki-laki. Namun, beliau juga memiliki utang sebesar 250 juta. Bagaimana warisan itu dibagi?",
		"Kami kehilangan ayah kandung kami. Ia meninggalkan ibu kami dan tiga anak laki-laki. Harta warisan berupa uang 1,2 miliar rupiah dan masih ada utang sebesar 400 juta. Bagaimana pembagian yang sesuai?",
		"Saya sebagai anak laki-laki dari pewaris ingin bertanya. Ayah saya meninggal, meninggalkan istri dan empat anak laki-laki. Warisan berupa tabungan 1,5 miliar rupiah dan utang sebesar 500 juta. Bagaimana perhitungannya?",
		"Ayah saya baru saja meninggal dunia. Ia meninggalkan seorang istri dan dua anak laki-laki. Uang warisan senilai 900 juta rupiah, tapi ada utang 300 juta rupiah. Bagaimana pembagian warisnya?",
		"Kami baru saja menguburkan ayah. Beliau meninggalkan ibu dan lima anak laki-laki. Warisan berupa uang 2 miliar, namun terdapat utang 750 juta. Bagaimana cara pembagian warisan?",
		"Ayah saya wafat. Beliau meninggalkan saya sebagai anak laki-laki tunggal dan seorang istri. Warisan 600 juta rupiah, tetapi ada utang 180 juta. Mohon penjelasan perhitungannya.",
		"Saya anak laki-laki dari ayah saya yang telah wafat. Beliau meninggalkan ibu saya dan dua saudara laki-laki. Warisan sebesar 950 juta dan utang 350 juta rupiah. Bagaimana pembagiannya?",
		"Ayah saya meninggal dunia dan meninggalkan ibu saya serta tiga anak laki-laki. Harta warisan berupa uang 1 miliar rupiah. Namun, beliau memiliki tanggungan hutang 400 juta. Bagaimana warisan dibagi?",
		"Ayah kami baru saja wafat. Ia meninggalkan ibu dan empat anak laki-laki. Warisan berupa 1,3 miliar rupiah, dan ada utang sebesar 500 juta. Bagaimana perhitungan waris setelah pelunasan utang?",
		"Saya anak laki-laki tunggal dari pewaris. Ayah saya wafat, meninggalkan seorang istri dan tabungan sebesar 550 juta rupiah. Beliau punya utang 150 juta. Bagaimana pembagiannya?",
		"Saya ingin tahu perhitungan warisan ayah saya. Beliau meninggalkan seorang istri dan dua anak laki-laki. Warisan 750 juta rupiah, utang 200 juta. Bagaimana dibagi menurut hukum Islam?",
		"Kami sedang mengurus warisan ayah kami. Beliau meninggalkan ibu dan tiga anak laki-laki. Harta yang ditinggalkan senilai 1,1 miliar dan utang 350 juta rupiah. Bagaimana pembagiannya?",
		"Ayah saya wafat. Warisan yang tersisa sebesar 600 juta rupiah, sementara utangnya 100 juta. Beliau meninggalkan seorang istri dan dua anak laki-laki. Bagaimana pembagian warisnya?",
		"Ayah saya sudah tidak ada. Beliau meninggalkan ibu saya dan saya serta satu saudara laki-laki. Warisan berupa 700 juta rupiah, dan ada hutang sebesar 200 juta. Bagaimana perhitungannya?",
		"Saya ingin bertanya soal warisan ayah saya. Beliau meninggal dan meninggalkan ibu saya serta empat anak laki-laki. Warisan 1,4 miliar dan utang 500 juta. Bagaimana pembagiannya menurut Islam?",
		"Ayah saya meninggal dunia. Beliau meninggalkan ibu saya dan tiga anak laki-laki. Warisan 1 miliar, dengan utang 250 juta. Bagaimana seharusnya warisan dibagikan?",
		"Ayah saya wafat dan meninggalkan saya sebagai anak laki-laki tunggal dan seorang istri. Warisan 500 juta dan utang sebesar 120 juta rupiah. Bagaimana pembagiannya menurut syariat?",
		"Saya anak laki-laki dari pewaris yang wafat. Beliau meninggalkan ibu saya dan dua saudara laki-laki. Warisan 900 juta, dengan utang 300 juta rupiah. Bagaimana cara membaginya?",
		"Ayah saya baru meninggal. Ia meninggalkan seorang istri dan tiga anak laki-laki. Harta warisan berupa uang 1,2 miliar dan ada utang 450 juta. Bagaimana pembagiannya?",
		"Ayah saya wafat dan mewariskan uang 800 juta rupiah. Namun ia juga meninggalkan hutang 250 juta. Pewarisnya adalah seorang istri dan dua anak laki-laki. Bagaimana pembagiannya?",
		"Saya ingin tahu bagaimana membagi warisan ayah saya. Beliau meninggalkan istri saya dan saya satu-satunya anak laki-laki. Warisan 600 juta dan utang 200 juta rupiah. Bagaimana perhitungannya?",
		"Ayah saya wafat, meninggalkan ibu saya dan empat anak laki-laki. Warisan 1,5 miliar dan utang sebesar 600 juta rupiah. Bagaimana pembagian warisan secara syariat?",
		"Ayah saya meninggal dan meninggalkan seorang istri serta dua anak laki-laki. Warisan berupa uang 700 juta rupiah. Ada utang sebesar 180 juta rupiah. Bagaimana pembagian yang benar?",
		"Saya ingin bertanya tentang warisan ayah saya. Beliau meninggalkan ibu saya dan saya sebagai anak laki-laki tunggal. Warisan 500 juta, dan ada hutang 130 juta. Bagaimana pembagiannya?",
		"Ayah saya telah tiada dan meninggalkan warisan berupa tabungan 900 juta rupiah serta utang sebesar 300 juta. Beliau meninggalkan seorang istri dan tiga anak laki-laki. Bagaimana pembagian warisnya?",
		"Ayah saya meninggal dunia. Ia meninggalkan ibu saya dan dua anak laki-laki. Warisan senilai 850 juta dan hutang sebesar 250 juta rupiah. Bagaimana cara membaginya?",
		"Saya ingin bertanya tentang pembagian warisan ayah saya. Beliau wafat, meninggalkan istri dan lima anak laki-laki. Warisan 2,1 miliar dan utang 700 juta rupiah. Bagaimana seharusnya dibagikan?",
		"Ayah saya wafat dan meninggalkan istri serta tiga anak laki-laki. Warisan 1,3 miliar dan utang 400 juta. Bagaimana pembagiannya menurut hukum Islam?",
		"Saya anak laki-laki dari ayah yang baru saja meninggal. Beliau meninggalkan ibu saya dan satu saudara laki-laki. Warisan 800 juta dan utang 300 juta rupiah. Bagaimana pembagiannya?",
		"Kami kehilangan ayah kami. Ia meninggalkan ibu dan empat anak laki-laki. Warisan 1,5 miliar dan utang 500 juta. Bagaimana pembagian warisnya secara adil?",
		"Saya ingin berkonsultasi mengenai warisan ayah saya. Beliau wafat, meninggalkan ibu saya dan dua anak laki-laki. Warisan 950 juta dan utang 350 juta. Bagaimana pembagian yang benar?",
		"Ayah saya telah tiada dan memiliki utang sebesar 280 juta rupiah. Warisan berupa tabungan 850 juta rupiah. Beliau meninggalkan istri dan dua anak laki-laki. Bagaimana cara pembagiannya?",
		"Saya anak tunggal dari pewaris. Ayah saya wafat, meninggalkan istri dan tabungan 500 juta rupiah. Terdapat utang sebesar 100 juta. Bagaimana pembagian warisnya?",
		"Ayah saya wafat dan meninggalkan ibu serta tiga anak laki-laki. Warisan 1,2 miliar rupiah, tetapi ada hutang sebesar 400 juta. Bagaimana pembagiannya menurut Islam?",
		"Saya ingin menanyakan pembagian warisan ayah saya. Beliau meninggal dunia dan meninggalkan seorang istri serta dua anak laki-laki. Warisan 750 juta dan utang 200 juta. Bagaimana perhitungannya?",
		"Ayah saya wafat dan mewariskan uang sebesar 950 juta rupiah, dengan utang 300 juta. Pewarisnya adalah seorang istri dan empat anak laki-laki. Bagaimana pembagian waris yang benar?",
		"Saya ingin mengetahui warisan dari ayah saya yang telah meninggal. Beliau meninggalkan istri saya dan saya serta satu saudara laki-laki. Warisan 850 juta dan utang 250 juta. Bagaimana pembagiannya?",
		"Kami sedang mengurus warisan ayah kami. Ia meninggalkan seorang istri dan lima anak laki-laki. Warisan berupa uang 2 miliar dan utang 700 juta. Bagaimana perhitungannya?",
		"Saya anak laki-laki dari ayah saya yang meninggal dunia. Ia meninggalkan ibu saya dan dua saudara laki-laki. Warisan sebesar 1 miliar dan utang 350 juta. Bagaimana waris dibagi?",
		"Ayah saya telah wafat dan meninggalkan harta warisan sebesar 1,1 miliar rupiah. Ia memiliki utang sebesar 300 juta rupiah. Beliau meninggalkan seorang istri dan tiga anak laki-laki. Bagaimana pembagian yang adil?",
		"Saya ingin bertanya tentang harta warisan ayah saya. Beliau meninggalkan istri saya dan saya satu-satunya anak laki-laki. Warisan 600 juta dan utang 180 juta. Bagaimana pembagiannya?",
		"Ayah saya meninggal dunia, meninggalkan ibu saya dan empat anak laki-laki. Warisan sebesar 1,4 miliar dan utang 500 juta. Bagaimana pembagian warisan menurut Islam?",
		"Kami sedang membagi warisan ayah saya yang baru saja meninggal. Ia meninggalkan istri dan dua anak laki-laki. Warisan 800 juta rupiah, dan utang 250 juta. Bagaimana pembagiannya?",
		"Saya anak laki-laki tunggal dari ayah saya yang meninggal. Beliau meninggalkan istri dan warisan 550 juta rupiah. Namun ada utang 150 juta. Bagaimana pembagiannya?",
		"Ayah saya meninggal dunia, meninggalkan istri dan tiga anak laki-laki. Warisan 1,2 miliar dan utang 400 juta rupiah. Bagaimana cara menghitung warisnya?",
		"Kami baru saja kehilangan ayah kami. Ia meninggalkan ibu dan lima anak laki-laki. Warisan sebesar 2 miliar rupiah dan utang 700 juta. Bagaimana pembagiannya?",
		"Saya ingin tahu warisan ayah saya yang telah meninggal. Beliau meninggalkan istri dan dua anak laki-laki. Warisan 850 juta dan utang 300 juta rupiah. Bagaimana pembagian menurut syariat?",
		"Ayah saya wafat dan meninggalkan tabungan senilai 900 juta. Ia memiliki utang 280 juta rupiah dan meninggalkan seorang istri serta dua anak laki-laki. Bagaimana pembagiannya?",
		"Ayah saya meninggal, meninggalkan ibu saya dan saya serta tiga saudara laki-laki. Warisan 1,4 miliar dan utang 500 juta rupiah. Bagaimana cara membagi warisnya?"
	]
}
