{
	"texts": [
		"Ayah saya wafat dan meninggalkan ibu saya sebagai satu-satunya istri, dua anak laki-laki, dan satu anak perempuan. Harta peninggalannya berupa tabungan sebesar 500 juta rupiah. Tidak ada hutang. Bagaimana pembagian warisnya?",
		"Suami dari ibu saya, yaitu ayah kandung saya, telah meninggal. Ia meninggalkan istri, tiga anak laki-laki, dan dua anak perempuan. Terdapat harta warisan dalam bentuk uang tunai sejumlah 1 miliar rupiah, tanpa ada hutang. Bagaimana perhitungannya?",
		"Ayah saya berpulang dan meninggalkan warisan berupa tabungan senilai 750 juta rupiah. Beliau meninggalkan ibu saya sebagai istri beliau, serta satu anak laki-laki dan dua anak perempuan. Tidak ada utang yang tersisa. Bagaimana waris dibagi?",
		"Orang tua saya, tepatnya ayah saya, meninggal dunia. Beliau meninggalkan seorang istri, dua putra, dan satu putri. Harta yang ditinggalkan berupa tabungan senilai 400 juta rupiah tanpa adanya tanggungan utang. Bagaimana pembagiannya menurut hukum Islam?",
		"Ayah saya telah tiada. Beliau meninggalkan ibu saya sebagai istri sah, bersama tiga anak laki-laki dan satu anak perempuan. Warisan berupa simpanan uang 900 juta rupiah, tanpa hutang. Mohon dijelaskan cara pembagian warisnya.",
		"Ayah meninggal dan meninggalkan ibu saya, satu kakak laki-laki saya, dan dua adik perempuan saya. Harta peninggalannya adalah tabungan sebesar 620 juta rupiah. Tidak ada utang. Bagaimana seharusnya warisan dibagikan?",
		"Ayah saya wafat dan meninggalkan seorang istri, dua anak laki-laki, dan satu anak perempuan. Beliau meninggalkan harta sebesar 700 juta rupiah tanpa hutang. Bagaimana distribusi warisnya?",
		"Ayah saya telah meninggal dunia. Warisan berupa uang tunai senilai 800 juta rupiah ditinggalkan untuk ibu saya, dua anak laki-laki, dan tiga anak perempuan. Tidak ada kewajiban utang yang belum dibayar. Bagaimana cara membaginya?",
		"Ayah saya wafat dan meninggalkan satu istri, tiga anak laki-laki, serta dua anak perempuan. Harta warisan berupa tabungan 1,2 miliar rupiah. Tidak ada hutang. Mohon penjelasan pembagian warisnya.",
		"Ayah saya meninggal dunia. Beliau meninggalkan istri (ibu saya), serta dua anak laki-laki dan satu anak perempuan. Warisan berupa simpanan uang sebesar 500 juta rupiah. Tidak ada hutang yang perlu dilunasi. Bagaimana waris tersebut dibagikan?",
		"Ayah saya berpulang dan menyisakan tabungan sebesar 400 juta rupiah. Beliau meninggalkan satu istri, satu anak laki-laki, dan dua anak perempuan. Tidak ada hutang yang diwariskan. Bagaimana pembagian warisnya?",
		"Suami dari ibu saya telah meninggal. Ia memiliki seorang istri, tiga anak laki-laki, dan dua anak perempuan. Uang warisan yang ditinggalkan sebesar 950 juta rupiah. Tidak terdapat utang. Bagaimana cara membaginya?",
		"Ayah saya telah tiada dan meninggalkan seorang istri, dua anak laki-laki, serta satu anak perempuan. Harta warisan sebesar 600 juta rupiah dan tidak ada beban hutang. Bagaimana waris dibagikan menurut Islam?",
		"Ayah saya meninggal dunia tanpa meninggalkan utang. Beliau meninggalkan ibu saya, dua anak laki-laki, dan satu anak perempuan. Uang yang diwariskan sebesar 700 juta rupiah. Bagaimana pembagiannya?",
		"Telah meninggal ayah saya. Ia meninggalkan ibu saya sebagai istri sah, bersama tiga anak laki-laki dan dua anak perempuan. Warisan berupa uang tabungan senilai 1 miliar rupiah tanpa utang. Mohon penjelasan pembagian waris.",
		"Ayah kami wafat dan meninggalkan satu istri, dua putra, dan dua putri. Warisannya berupa tabungan 850 juta rupiah, tidak ada utang. Bagaimana sebaiknya pembagian warisan dilakukan?",
		"Ayah saya meninggal dan meninggalkan ibu, dua anak laki-laki, serta tiga anak perempuan. Harta warisan sebesar 780 juta rupiah. Tidak ada hutang yang tersisa. Bagaimana warisan dibagi?",
		"Ayah saya telah berpulang. Beliau meninggalkan satu orang istri, dua anak laki-laki, dan satu anak perempuan. Warisan berupa uang tunai sebesar 550 juta rupiah, tanpa adanya utang. Bagaimana pembagian warisnya?",
		"Ayah saya wafat tanpa meninggalkan utang. Beliau meninggalkan ibu saya, dua anak laki-laki, dan dua anak perempuan. Harta warisan berupa tabungan senilai 620 juta rupiah. Mohon penjelasan pembagian warisnya.",
		"Suami dari ibu saya, ayah kami, telah tiada. Warisan berupa tabungan 700 juta rupiah, tanpa utang. Beliau meninggalkan satu istri, satu anak laki-laki, dan tiga anak perempuan. Bagaimana pembagian warisnya?",
		"Ayah saya wafat dan tidak memiliki utang. Warisan yang ditinggalkan adalah uang sebesar 500 juta rupiah. Beliau meninggalkan ibu saya, satu anak laki-laki, dan satu anak perempuan. Bagaimana perhitungan warisnya?",
		"Ayah saya telah meninggal dunia dan meninggalkan ibu saya sebagai istri, serta dua anak laki-laki dan dua anak perempuan. Harta warisan berupa uang tunai sebesar 900 juta rupiah. Tidak ada hutang. Bagaimana pembagiannya?",
		"Ayah saya meninggal. Beliau memiliki satu istri, dua anak laki-laki, dan satu anak perempuan. Warisan berupa tabungan 450 juta rupiah tanpa hutang. Bagaimana waris dibagi?",
		"Ayah saya wafat. Beliau meninggalkan seorang istri, satu anak laki-laki, dan dua anak perempuan. Warisan berupa tabungan sebesar 600 juta rupiah dan tidak ada utang. Bagaimana pembagian waris menurut syariat?",
		"Telah meninggal ayah saya, meninggalkan ibu saya sebagai istri sah beliau, serta dua anak laki-laki dan satu anak perempuan. Warisan berupa uang 700 juta rupiah. Tidak ada hutang. Mohon dijelaskan pembagian warisnya.",
		"Ayah saya berpulang dan meninggalkan warisan berupa tabungan sebesar 500 juta rupiah. Pewarisnya adalah satu istri, satu anak laki-laki, dan dua anak perempuan. Tanpa hutang. Bagaimana pembagian yang sesuai?",
		"Ayah kami meninggal dunia tanpa meninggalkan utang. Beliau meninggalkan satu istri, tiga anak laki-laki, dan satu anak perempuan. Warisan berupa uang sebesar 1 miliar rupiah. Bagaimana pembagiannya?",
		"Ayah saya telah tiada. Ibu saya sebagai istri sah beliau masih hidup. Kami tiga bersaudara terdiri dari dua laki-laki dan satu perempuan. Harta peninggalan berupa tabungan 650 juta rupiah. Tidak ada hutang. Bagaimana waris dibagikan?",
		"Ayah saya wafat meninggalkan ibu saya, dua anak laki-laki, dan dua anak perempuan. Warisan yang ditinggalkan adalah uang tunai senilai 800 juta rupiah. Tidak ada utang. Bagaimana cara membaginya?",
		"Ayah saya meninggal dan meninggalkan seorang istri, satu anak laki-laki, serta dua anak perempuan. Warisan berupa tabungan 580 juta rupiah tanpa adanya hutang. Mohon dijelaskan pembagiannya.",
		"Ayah saya telah wafat. Beliau meninggalkan ibu saya sebagai istri, bersama dua anak laki-laki dan satu anak perempuan. Warisan berupa uang simpanan sebesar 720 juta rupiah. Tidak ada utang yang perlu diselesaikan. Bagaimana pembagian warisnya?",
		"Ayah saya meninggal dunia. Warisan berupa tabungan senilai 650 juta rupiah. Pewarisnya terdiri dari seorang istri, dua anak laki-laki, dan satu anak perempuan. Tidak ada utang. Bagaimana seharusnya warisan dibagi?",
		"Ayah kami telah berpulang. Ia meninggalkan ibu kami, dua saudara laki-laki, dan satu saudara perempuan. Harta peninggalannya adalah tabungan 480 juta rupiah tanpa utang. Bagaimana pembagian waris secara Islam?",
		"Ayah saya meninggal dan meninggalkan satu istri, satu anak laki-laki, dan dua anak perempuan. Tidak ada utang. Harta warisan berupa uang sebesar 530 juta rupiah. Bagaimana pembagian waris sesuai syariat?",
		"Ayah saya wafat dan meninggalkan ibu saya, dua anak laki-laki, serta dua anak perempuan. Warisan berupa tabungan sebesar 700 juta rupiah. Beliau tidak memiliki hutang. Bagaimana cara membaginya?",
		"Ayah saya telah tiada, meninggalkan seorang istri, dua anak laki-laki, dan satu anak perempuan. Tidak ada utang. Harta yang ditinggalkan berupa simpanan sebesar 610 juta rupiah. Bagaimana pembagian warisnya?",
		"Ayah saya meninggal. Warisannya berupa uang senilai 800 juta rupiah. Beliau meninggalkan seorang istri, satu anak laki-laki, dan tiga anak perempuan. Tidak ada beban hutang. Bagaimana pembagian waris sesuai hukum Islam?",
		"Ayah saya telah wafat, tidak meninggalkan hutang. Beliau mewariskan tabungan senilai 550 juta rupiah. Ahli waris terdiri dari satu istri, dua anak laki-laki, dan satu anak perempuan. Bagaimana pembagian warisnya?",
		"Ayah saya meninggal dunia. Beliau meninggalkan ibu saya sebagai istri sah, dua anak laki-laki, dan satu anak perempuan. Harta yang ditinggalkan berupa tabungan senilai 770 juta rupiah tanpa hutang. Mohon penjelasan pembagiannya.",
		"Ayah saya wafat dan tidak memiliki hutang. Ia meninggalkan seorang istri, satu anak laki-laki, serta dua anak perempuan. Harta warisan berupa uang 600 juta rupiah. Bagaimana perhitungan warisnya?",
		"Ayah saya telah berpulang dan meninggalkan ibu saya, dua anak laki-laki, dan dua anak perempuan. Warisan berupa simpanan tunai sebesar 850 juta rupiah, tanpa utang. Bagaimana pembagian warisan tersebut?",
		"Ayah saya meninggal dunia. Beliau tidak memiliki hutang. Harta peninggalan berupa tabungan 950 juta rupiah. Pewarisnya adalah satu istri, tiga anak laki-laki, dan satu anak perempuan. Bagaimana waris dibagi?",
		"Ayah saya wafat. Ia meninggalkan ibu saya sebagai satu-satunya istri, serta dua anak laki-laki dan satu anak perempuan. Warisan berupa uang tunai sebesar 500 juta rupiah. Tidak ada hutang. Mohon penjelasan pembagiannya.",
		"Ayah saya telah meninggal dunia dan meninggalkan ibu saya sebagai istri, bersama dua anak laki-laki dan satu anak perempuan. Warisan yang ditinggalkan berupa tabungan sebesar 750 juta rupiah tanpa utang. Bagaimana pembagian warisnya?",
		"Ayah saya berpulang dan meninggalkan satu istri, dua anak laki-laki, serta dua anak perempuan. Harta warisan berupa uang tunai sebesar 900 juta rupiah tanpa ada hutang. Bagaimana pembagian menurut syariat Islam?",
		"Ayah saya meninggal. Beliau meninggalkan ibu saya, satu anak laki-laki, dan dua anak perempuan. Warisan berupa uang sebesar 670 juta rupiah, tidak ada hutang. Bagaimana cara membaginya?",
		"Ayah saya wafat dan meninggalkan seorang istri, tiga anak laki-laki, serta satu anak perempuan. Tidak ada hutang. Harta warisan berupa simpanan uang sebesar 1 miliar rupiah. Bagaimana pembagian warisnya?",
		"Ayah saya meninggal dunia tanpa meninggalkan utang. Beliau meninggalkan ibu saya, dua anak laki-laki, dan satu anak perempuan. Harta warisan berupa tabungan 720 juta rupiah. Bagaimana pembagiannya?",
		"Ayah saya telah tiada. Beliau meninggalkan istri, satu anak laki-laki, dan dua anak perempuan. Warisan berupa uang tunai 580 juta rupiah tanpa utang. Bagaimana pembagian waris secara Islam?",
		"Ayah saya meninggal dan meninggalkan seorang istri, dua anak laki-laki, serta dua anak perempuan. Tidak ada utang yang perlu diselesaikan. Warisan berupa uang sebesar 800 juta rupiah. Bagaimana pembagian warisnya?",
		"Ayah saya telah wafat. Beliau meninggalkan ibu saya, dua anak laki-laki, dan satu anak perempuan. Warisan berupa uang sebesar 900 juta rupiah. Bagaimana pembagiannya?",
		"Kami baru saja kehilangan ayah. Beliau meninggalkan seorang istri, tiga anak laki-laki, dan dua anak perempuan. Harta warisan yang ditinggalkan sebesar 1,2 miliar. Bagaimana pembagian waris sesuai hukum Islam?",
		"Saya anak laki-laki dari pewaris yang meninggal dunia. Ayah saya meninggalkan istri, dua anak laki-laki, dan tiga anak perempuan. Warisan yang tersedia adalah 1 miliar. Bagaimana pembagiannya?",
		"Ayah saya wafat dan meninggalkan ibu saya, satu saudara laki-laki, serta satu saudara perempuan. Warisan sebesar 600 juta rupiah. Mohon penjelasan pembagiannya.",
		"Kami sedang mengurus harta warisan ayah. Beliau meninggalkan seorang istri, empat anak laki-laki, dan satu anak perempuan. Warisan berupa uang tunai sebesar 1,3 miliar. Bagaimana pembagiannya?",
		"Saya ingin menanyakan warisan ayah saya. Beliau wafat, meninggalkan ibu saya, saya sendiri, satu saudara laki-laki, dan dua saudara perempuan. Warisan sebesar 950 juta. Bagaimana perhitungan warisnya?",
		"Ayah saya meninggal dan meninggalkan seorang istri, dua anak laki-laki, dan dua anak perempuan. Uang warisan senilai 850 juta. Bagaimana warisan tersebut dibagikan?",
		"Kami anak-anak almarhum ayah kami ingin mengetahui pembagian warisan. Beliau meninggalkan ibu kami, tiga anak laki-laki, dan dua anak perempuan. Warisan 1,1 miliar rupiah. Bagaimana cara membaginya?",
		"Ayah saya wafat dan meninggalkan tabungan sebesar 700 juta. Beliau meninggalkan ibu saya, saya, dua saudara laki-laki, dan satu saudara perempuan. Bagaimana pembagiannya?",
		"Saya anak laki-laki dari ayah saya yang wafat. Beliau meninggalkan istri dan empat anak, yaitu dua laki-laki dan dua perempuan. Warisan 900 juta rupiah. Mohon penjelasan pembagian warisnya?",
		"Ayah saya telah meninggal. Ia meninggalkan istri, dua anak laki-laki, dan satu anak perempuan. Warisan berupa uang tunai sebesar 800 juta. Bagaimana pembagian menurut hukum Islam?",
		"Kami baru saja kehilangan ayah kami. Beliau meninggalkan ibu, lima anak laki-laki, dan dua anak perempuan. Warisan 2 miliar rupiah. Bagaimana pembagiannya?",
		"Saya satu dari tiga anak laki-laki yang ditinggal ayah. Beliau juga memiliki dua anak perempuan dan satu istri. Warisan berupa uang tunai 1,5 miliar rupiah. Bagaimana pembagiannya?",
		"Ayah saya wafat dan meninggalkan harta senilai 600 juta. Beliau meninggalkan ibu saya, saya, satu saudara laki-laki, dan dua saudara perempuan. Bagaimana warisan ini dibagi?",
		"Ayah saya telah tiada. Beliau meninggalkan seorang istri, dua anak laki-laki, dan satu anak perempuan. Warisan berupa uang sebesar 750 juta. Bagaimana pembagiannya?",
		"Saya ingin bertanya perihal warisan ayah saya. Beliau wafat dan meninggalkan ibu saya serta tiga anak laki-laki dan dua anak perempuan. Warisan 1,1 miliar. Bagaimana perhitungannya?",
		"Ayah saya meninggal dunia dan meninggalkan ibu saya, dua anak laki-laki, dan satu anak perempuan. Warisan berupa 900 juta. Bagaimana pembagiannya menurut syariat Islam?",
		"Saya ingin tahu pembagian warisan dari ayah saya. Beliau meninggalkan istri, saya sendiri, satu saudara laki-laki, dan dua saudara perempuan. Warisan senilai 800 juta. Bagaimana pembagian warisnya?",
		"Ayah saya wafat. Pewaris yang ditinggalkan adalah seorang istri, tiga anak laki-laki, dan satu anak perempuan. Warisan 1 miliar rupiah. Bagaimana sebaiknya dibagikan?",
		"Ayah saya meninggal dunia dan meninggalkan ibu saya serta lima anak, terdiri atas tiga laki-laki dan dua perempuan. Warisan 1,3 miliar. Bagaimana pembagiannya?",
		"Saya satu dari dua anak laki-laki yang ditinggalkan ayah. Beliau juga memiliki dua anak perempuan dan satu istri. Warisan 900 juta rupiah. Mohon bantuan pembagian warisnya.",
		"Ayah saya telah wafat dan meninggalkan seorang istri, dua anak laki-laki, dan satu anak perempuan. Warisan berupa uang 750 juta. Bagaimana cara membaginya?",
		"Kami kehilangan ayah dan ingin mengetahui pembagian warisnya. Beliau meninggalkan ibu kami, empat anak laki-laki, dan satu anak perempuan. Warisan sebesar 1,4 miliar. Bagaimana perhitungannya?",
		"Ayah saya wafat. Beliau meninggalkan ibu saya, dua anak laki-laki, dan dua anak perempuan. Harta warisan senilai 1 miliar rupiah. Bagaimana pembagiannya?",
		"Saya anak laki-laki dari ayah saya yang meninggal. Beliau meninggalkan ibu saya dan lima anak lainnya, terdiri atas tiga laki-laki dan dua perempuan. Warisan sebesar 1,5 miliar rupiah. Bagaimana pembagian warisnya?",
		"Ayah saya meninggal dan meninggalkan istri serta empat anak laki-laki dan satu anak perempuan. Warisan 1,6 miliar. Bagaimana pembagiannya menurut hukum Islam?",
		"Saya ingin tahu bagaimana menghitung warisan ayah saya. Beliau wafat dan meninggalkan ibu saya, dua anak laki-laki, dan dua anak perempuan. Harta 1 miliar. Bagaimana pembagian warisnya?",
		"Ayah saya wafat, meninggalkan ibu saya dan empat anak: dua laki-laki dan dua perempuan. Warisan berupa tabungan 900 juta. Bagaimana perhitungan warisnya?",
		"Kami anak-anak dari almarhum ayah kami ingin tahu pembagian warisan. Beliau meninggalkan istri, tiga anak laki-laki, dan dua anak perempuan. Warisan 1,2 miliar. Bagaimana cara membaginya?",
		"Saya anak laki-laki dari ayah saya yang telah meninggal. Beliau meninggalkan ibu saya, satu saudara laki-laki, dan dua saudara perempuan. Warisan 850 juta. Bagaimana pembagiannya?",
		"Ayah saya wafat. Beliau meninggalkan istri serta dua anak laki-laki dan satu anak perempuan. Warisan senilai 700 juta rupiah. Bagaimana seharusnya dibagi?",
		"Kami ingin membagi warisan ayah kami yang wafat. Ia meninggalkan seorang istri, dua anak laki-laki, dan dua anak perempuan. Warisan 950 juta. Mohon panduan pembagiannya.",
		"Ayah saya telah meninggal dan meninggalkan seorang istri serta empat anak laki-laki dan dua anak perempuan. Warisan sebesar 1,7 miliar. Bagaimana pembagian warisnya?",
		"Saya ingin bertanya mengenai warisan ayah saya. Beliau meninggalkan istri, dua anak laki-laki, dan tiga anak perempuan. Warisan berupa uang tunai 1 miliar. Bagaimana sebaiknya dibagikan?",
		"Ayah saya meninggal dan meninggalkan ibu saya, dua anak laki-laki, dan satu anak perempuan. Warisan berupa tabungan senilai 800 juta. Bagaimana pembagiannya?",
		"Kami sedang mengurus warisan ayah. Ia meninggalkan istri dan lima anak: tiga laki-laki dan dua perempuan. Warisan 1,4 miliar. Bagaimana perhitungan warisnya?",
		"Saya anak laki-laki dari ayah saya yang meninggal. Beliau meninggalkan istri, dua anak laki-laki, dan satu anak perempuan. Warisan sebesar 750 juta rupiah. Bagaimana dibagi menurut Islam?",
		"Ayah saya wafat dan meninggalkan ibu saya serta tiga anak laki-laki dan dua anak perempuan. Warisan berupa uang tunai 1,2 miliar rupiah. Bagaimana pembagiannya?",
		"Saya ingin mengetahui pembagian warisan ayah saya. Beliau wafat dan meninggalkan seorang istri, dua anak laki-laki, dan dua anak perempuan. Warisan 1 miliar. Bagaimana cara membaginya?",
		"Ayah saya meninggal, meninggalkan ibu saya dan lima anak: tiga laki-laki dan dua perempuan. Warisan berupa uang 1,5 miliar. Bagaimana pembagiannya?",
		"Saya anak laki-laki dari almarhum. Beliau meninggalkan istri dan empat anak: dua laki-laki dan dua perempuan. Warisan sebesar 1 miliar rupiah. Bagaimana pembagiannya?",
		"Kami baru saja kehilangan ayah. Ia meninggalkan ibu dan lima anak laki-laki serta satu anak perempuan. Warisan 1,8 miliar. Bagaimana seharusnya dibagi?",
		"Ayah saya meninggal dunia. Ia meninggalkan seorang istri, tiga anak laki-laki, dan dua anak perempuan. Warisan senilai 1,1 miliar rupiah. Bagaimana pembagian warisnya?",
		"Saya anak laki-laki dari pewaris yang meninggal. Beliau meninggalkan istri dan dua anak laki-laki serta dua anak perempuan. Warisan 950 juta. Bagaimana perhitungannya?",
		"Ayah saya wafat dan meninggalkan ibu saya serta tiga anak laki-laki dan satu anak perempuan. Warisan berupa tabungan 1,2 miliar. Bagaimana cara pembagiannya?",
		"Saya ingin tahu cara membagi warisan ayah saya. Ia meninggalkan istri, dua anak laki-laki, dan satu anak perempuan. Warisan 800 juta rupiah. Bagaimana perhitungannya?",
		"Ayah saya meninggal dan meninggalkan istri, tiga anak laki-laki, dan dua anak perempuan. Warisan senilai 1,4 miliar. Bagaimana pembagiannya?",
		"Kami anak-anak dari ayah kami yang telah meninggal ingin tahu cara pembagian waris. Beliau meninggalkan istri, dua anak laki-laki, dan dua anak perempuan. Warisan 1 miliar rupiah. Bagaimana dibagi?",
		"Saya anak laki-laki dari ayah saya yang wafat. Ia meninggalkan ibu saya dan tiga anak lainnya: satu laki-laki dan dua perempuan. Warisan sebesar 900 juta. Bagaimana pembagian warisnya?",
		"Ayah saya telah wafat, meninggalkan seorang istri, dua anak laki-laki, dan dua anak perempuan. Warisan sebesar 1,2 miliar. Bagaimana perhitungannya?"
	]
}
