{
  "texts": [
    "Suami saya meninggal dunia, meninggalkan saya, satu anak perempuan, dan ibunya, dengan harta 850 juta serta hutang 150 juta.",
    "Baru-baru ini suami saya wafat, ahli warisnya adalah saya, dua anak perempuan, dan ibu beliau. Harta peninggalan 1,2 miliar, namun ada hutang 200 juta.",
    "Suami saya berpulang, meninggalkan saya, tiga anak perempuan, dan ibunya. Total warisan 1,8 miliar, dengan kewajiban hutang 300 juta.",
    "Saya kehilangan suami tercinta, yang meninggalkan satu anak perempuan, ibunya, dan saya. Peninggalan 900 juta dan hutang 120 juta.",
    "Suami saya meninggal, ahli warisnya saya, dua anak perempuan, dan ibu beliau. Warisan 1,15 miliar, hutang 250 juta.",
    "Saya baru kehilangan suami. Beliau meninggalkan saya, tiga anak perempuan, dan ibunya, dengan harta 1,7 miliar serta hutang 280 juta.",
    "Suami saya wafat, meninggalkan satu anak perempuan, ibunya, dan saya. Kekayaan 820 juta, hutang 100 juta.",
    "Minggu lalu suami saya meninggal, ahli warisnya adalah saya, dua anak perempuan, dan ibu beliau. Harta 1,3 miliar, namun ada hutang 220 juta.",
    "Suami saya berpulang ke rahmatullah, meninggalkan saya, tiga anak perempuan, dan ibunya. Warisan 1,9 miliar, hutang 350 juta.",
    "Suami saya meninggal dunia, meninggalkan saya, satu anak perempuan, dan ibunya. Harta 880 juta, hutang 110 juta.",
    "Saya baru kehilangan suami tercinta. Beliau meninggalkan dua anak perempuan, ibunya, dan saya. Peninggalan 1,25 miliar, hutang 200 juta.",
    "Suami saya wafat, ahli warisnya saya, tiga anak perempuan, dan ibunya. Harta 1,85 miliar, hutang 320 juta.",
    "Suami saya meninggal, meninggalkan satu anak perempuan, ibunya, dan saya. Warisan 900 juta, hutang 150 juta.",
    "Beberapa hari lalu suami saya berpulang, ahli warisnya adalah saya, dua anak perempuan, dan ibu beliau. Harta 1,1 miliar, hutang 180 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Peninggalan 1,76 miliar, hutang 290 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, satu anak perempuan, dan ibunya. Kekayaan 870 juta, hutang 130 juta.",
    "Baru-baru ini suami saya wafat, meninggalkan dua anak perempuan, ibunya, dan saya. Harta 1,2 miliar, hutang 210 juta.",
    "Saya kehilangan suami tercinta. Beliau meninggalkan tiga anak perempuan, ibunya, dan saya. Warisan 1,83 miliar, hutang 310 juta.",
    "Suami saya meninggal, meninggalkan saya, satu anak perempuan, dan ibunya. Peninggalan 890 juta, hutang 120 juta.",
    "Suami saya wafat, ahli warisnya adalah saya, dua anak perempuan, dan ibu beliau. Harta 1,16 miliar, hutang 250 juta.",
    "Suami saya berpulang, meninggalkan saya, tiga anak perempuan, dan ibunya. Kekayaan 1,88 miliar, hutang 330 juta.",
    "Saya baru kehilangan suami. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Warisan 840 juta, hutang 140 juta.",
    "Suami saya meninggal dunia, meninggalkan dua anak perempuan, ibunya, dan saya. Harta 1,19 miliar, hutang 200 juta.",
    "Minggu lalu suami saya wafat, ahli warisnya saya, tiga anak perempuan, dan ibunya. Peninggalan 1,82 miliar, hutang 300 juta.",
    "Suami saya meninggal, meninggalkan saya, satu anak perempuan, dan ibunya. Kekayaan 810 juta, hutang 100 juta.",
    "Saya baru kehilangan suami tercinta. Beliau meninggalkan dua anak perempuan, ibunya, dan saya. Warisan 1,14 miliar, hutang 230 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Harta 1,79 miliar, hutang 310 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, satu anak perempuan, dan ibunya. Peninggalan 830 juta, hutang 110 juta.",
    "Beberapa hari lalu suami saya wafat, meninggalkan dua anak perempuan, ibunya, dan saya. Warisan 1,21 miliar, hutang 240 juta.",
    "Suami saya meninggal, meninggalkan saya, tiga anak perempuan, dan ibunya. Kekayaan 1,86 miliar, hutang 320 juta.",
    "Suami saya wafat, meninggalkan satu anak perempuan, ibunya, dan saya. Harta 800 juta, hutang 90 juta.",
    "Saya kehilangan suami tercinta. Beliau meninggalkan dua anak perempuan, ibunya, dan saya. Peninggalan 1,18 miliar, hutang 220 juta.",
    "Suami saya meninggal dunia, meninggalkan saya, tiga anak perempuan, dan ibunya. Warisan 1,81 miliar, hutang 340 juta.",
    "Baru-baru ini suami saya wafat, ahli warisnya adalah saya, satu anak perempuan, dan ibunya. Harta 850 juta, hutang 130 juta.",
    "Suami saya meninggal, meninggalkan dua anak perempuan, ibunya, dan saya. Kekayaan 1,15 miliar, hutang 210 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Peninggalan 1,84 miliar, hutang 300 juta.",
    "Saya baru kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Warisan 820 juta, hutang 100 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, dua anak perempuan, dan ibunya. Harta 1,22 miliar, hutang 250 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Kekayaan 1,9 miliar, hutang 360 juta.",
    "Suami saya meninggal, meninggalkan satu anak perempuan, ibunya, dan saya. Peninggalan 880 juta, hutang 120 juta.",
    "Beberapa hari lalu suami saya wafat, ahli warisnya adalah saya, dua anak perempuan, dan ibunya. Harta 1,13 miliar, hutang 200 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Warisan 1,87 miliar, hutang 310 juta.",
    "Saya baru kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Kekayaan 810 juta, hutang 110 juta.",
    "Suami saya meninggal dunia, meninggalkan dua anak perempuan, ibunya, dan saya. Peninggalan 1,2 miliar, hutang 230 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Harta 1,8 miliar, hutang 300 juta.",
    "Baru-baru ini suami saya wafat, ahli warisnya adalah saya, satu anak perempuan, dan ibunya. Warisan 850 juta, hutang 130 juta.",
    "Suami saya meninggal, meninggalkan dua anak perempuan, ibunya, dan saya. Kekayaan 1,17 miliar, hutang 220 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Peninggalan 1,83 miliar, hutang 310 juta.",
    "Saya kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Warisan 800 juta, hutang 90 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, dua anak perempuan, dan ibunya. Harta 1,25 miliar, hutang 250 juta.",
    "Suami saya wafat, meninggalkan saya, satu anak perempuan, dan ibunya. Warisan 880 juta, dengan hutang 120 juta.",
    "Saya baru saja kehilangan suami, beliau meninggalkan dua anak perempuan, ibunya, dan saya. Peninggalan 1,28 miliar, hutang 240 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, tiga anak perempuan, dan ibunya. Harta 1,85 miliar, hutang 320 juta.",
    "Baru-baru ini suami saya wafat, meninggalkan saya, satu anak perempuan, dan ibunya. Kekayaan 830 juta, hutang 110 juta.",
    "Suami saya meninggal, meninggalkan dua anak perempuan, ibunya, dan saya. Warisan 1,19 miliar, hutang 230 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Peninggalan 1,78 miliar, hutang 310 juta.",
    "Saya kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Harta 820 juta, hutang 100 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, dua anak perempuan, dan ibunya. Kekayaan 1,26 miliar, hutang 260 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Warisan 1,9 miliar, hutang 350 juta.",
    "Suami saya meninggal, meninggalkan satu anak perempuan, ibunya, dan saya. Peninggalan 870 juta, hutang 130 juta.",
    "Beberapa hari lalu suami saya wafat, ahli warisnya adalah saya, dua anak perempuan, dan ibunya. Harta 1,18 miliar, hutang 210 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Kekayaan 1,86 miliar, hutang 330 juta.",
    "Saya baru kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Warisan 810 juta, hutang 90 juta.",
    "Suami saya meninggal dunia, meninggalkan dua anak perempuan, ibunya, dan saya. Peninggalan 1,21 miliar, hutang 250 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Harta 1,83 miliar, hutang 300 juta.",
    "Baru-baru ini suami saya wafat, ahli warisnya adalah saya, satu anak perempuan, dan ibunya. Kekayaan 850 juta, hutang 120 juta.",
    "Suami saya meninggal, meninggalkan dua anak perempuan, ibunya, dan saya. Warisan 1,15 miliar, hutang 220 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Peninggalan 1,88 miliar, hutang 350 juta.",
    "Saya kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Harta 800 juta, hutang 100 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, dua anak perempuan, dan ibunya. Kekayaan 1,23 miliar, hutang 240 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Warisan 1,8 miliar, hutang 320 juta.",
    "Suami saya meninggal, meninggalkan satu anak perempuan, ibunya, dan saya. Peninggalan 820 juta, hutang 110 juta.",
    "Beberapa hari lalu suami saya wafat, ahli warisnya adalah saya, dua anak perempuan, dan ibunya. Harta 1,16 miliar, hutang 200 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Kekayaan 1,87 miliar, hutang 340 juta.",
    "Saya baru kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Warisan 850 juta, hutang 130 juta.",
    "Suami saya meninggal dunia, meninggalkan dua anak perempuan, ibunya, dan saya. Peninggalan 1,27 miliar, hutang 270 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Harta 1,82 miliar, hutang 300 juta.",
    "Baru-baru ini suami saya wafat, ahli warisnya adalah saya, satu anak perempuan, dan ibunya. Kekayaan 880 juta, hutang 140 juta.",
    "Suami saya meninggal, meninggalkan dua anak perempuan, ibunya, dan saya. Warisan 1,2 miliar, hutang 230 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Peninggalan 1,85 miliar, hutang 310 juta.",
    "Saya kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Harta 830 juta, hutang 110 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, dua anak perempuan, dan ibunya. Kekayaan 1,24 miliar, hutang 250 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Warisan 1,9 miliar, hutang 360 juta.",
    "Suami saya meninggal, meninggalkan satu anak perempuan, ibunya, dan saya. Peninggalan 810 juta, hutang 100 juta.",
    "Beberapa hari lalu suami saya wafat, ahli warisnya adalah saya, dua anak perempuan, dan ibunya. Harta 1,22 miliar, hutang 240 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Kekayaan 1,89 miliar, hutang 350 juta.",
    "Saya baru kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Warisan 820 juta, hutang 110 juta.",
    "Suami saya meninggal dunia, meninggalkan dua anak perempuan, ibunya, dan saya. Peninggalan 1,18 miliar, hutang 210 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Harta 1,84 miliar, hutang 320 juta.",
    "Baru-baru ini suami saya wafat, ahli warisnya adalah saya, satu anak perempuan, dan ibunya. Kekayaan 850 juta, hutang 120 juta.",
    "Suami saya meninggal, meninggalkan dua anak perempuan, ibunya, dan saya. Warisan 1,25 miliar, hutang 250 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Peninggalan 1,81 miliar, hutang 300 juta.",
    "Saya kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Harta 800 juta, hutang 90 juta.",
    "Suami saya meninggal dunia, ahli warisnya saya, dua anak perempuan, dan ibunya. Kekayaan 1,2 miliar, hutang 220 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Warisan 1,88 miliar, hutang 340 juta.",
    "Suami saya meninggal, meninggalkan satu anak perempuan, ibunya, dan saya. Peninggalan 870 juta, hutang 130 juta.",
    "Beberapa hari lalu suami saya wafat, ahli warisnya adalah saya, dua anak perempuan, dan ibunya. Harta 1,17 miliar, hutang 210 juta.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan ibunya. Kekayaan 1,86 miliar, hutang 330 juta.",
    "Saya baru kehilangan suami tercinta. Beliau meninggalkan satu anak perempuan, ibunya, dan saya. Warisan 840 juta, hutang 120 juta.",
    "Suami saya meninggal dunia, meninggalkan dua anak perempuan, ibunya, dan saya. Peninggalan 1,26 miliar, hutang 260 juta."
  ]
}