{
	"texts": [
		"Ayah saya telah wafat. Beliau meninggalkan ibu saya sebagai istri sahnya dan saya bersama satu saudara laki-laki. Warisan yang ditinggalkan berupa uang tunai sebesar 500 juta rupiah. Tidak ada hutang yang harus dibayar. Bagaimana pembagian warisnya?",
		"Saya kehilangan ayah kandung saya beberapa waktu lalu. Beliau meninggalkan seorang istri, yaitu ibu saya, serta dua anak laki-laki termasuk saya. Tabungan yang ditinggalkan sebesar 750 juta rupiah, dan tidak ada utang. Mohon penjelasan tentang pembagian warisan menurut hukum Islam.",
		"Ayah saya telah meninggal dunia. Warisan beliau meliputi uang sebesar 1 miliar rupiah. Beliau meninggalkan ibu saya dan kami tiga bersaudara laki-laki. Tidak ada beban utang apapun. Bagaimana warisan tersebut sebaiknya dibagi?",
		"Orang tua saya telah berpulang. Yang meninggal adalah ayah saya. Beliau meninggalkan ibu saya serta empat anak laki-laki. Tersisa tabungan sebesar 600 juta rupiah tanpa hutang. Bagaimana pembagian warisnya?",
		"Saya ingin menanyakan tentang warisan ayah saya yang telah meninggal. Beliau meninggalkan seorang istri dan dua anak laki-laki. Tidak ada hutang, dan warisannya berupa uang 850 juta rupiah. Bagaimana hukum pembagiannya?",
		"Ayah saya wafat beberapa waktu lalu. Harta yang tersisa adalah tabungan senilai 900 juta rupiah. Beliau meninggalkan istri sah dan satu orang anak laki-laki, yaitu saya sendiri. Tidak ada tanggungan hutang. Bagaimana warisnya dibagi?",
		"Saya adalah anak laki-laki dari almarhum ayah saya. Ayah meninggalkan seorang istri dan saya sendiri sebagai anak laki-laki tunggal. Warisan beliau berupa 400 juta rupiah dalam bentuk tabungan. Tidak ada hutang yang tersisa. Bagaimana pembagiannya?",
		"Ayah saya telah tiada. Beliau meninggalkan ibu saya dan kami dua anak laki-laki. Warisan berupa uang 700 juta rupiah dan tidak ada hutang. Mohon bantuannya dalam pembagian waris.",
		"Saya ingin menanyakan soal pembagian warisan ayah saya. Ayah meninggalkan satu istri dan tiga anak laki-laki. Tidak ada hutang, dan ada tabungan sebesar 1,2 miliar rupiah. Bagaimana cara membaginya?",
		"Kami baru saja kehilangan ayah kami. Beliau meninggalkan ibu dan dua anak laki-laki. Harta warisan berupa uang tunai sebesar 650 juta rupiah tanpa hutang. Bagaimana perhitungan warisnya?",
		"Ayah kandung saya telah meninggal dunia. Beliau hanya meninggalkan seorang istri dan saya serta satu adik laki-laki. Tidak ada hutang, dan terdapat uang sebesar 300 juta rupiah. Bagaimana pembagiannya menurut syariat?",
		"Saya ingin tahu pembagian warisan dari ayah saya yang sudah wafat. Beliau meninggalkan seorang istri dan empat anak laki-laki. Warisan berupa 1 miliar rupiah dan tidak ada hutang. Mohon penjelasan.",
		"Saya anak laki-laki dari ayah saya yang telah meninggal. Beliau meninggalkan ibu saya serta saya dan dua saudara laki-laki. Harta yang diwariskan sebesar 850 juta rupiah tanpa ada hutang. Bagaimana pembagiannya?",
		"Ayah saya wafat tanpa meninggalkan hutang. Beliau hanya meninggalkan ibu saya dan tiga anak laki-laki. Warisan berupa uang tabungan senilai 900 juta rupiah. Bagaimana cara membaginya?",
		"Saya ingin konsultasi mengenai warisan. Ayah saya meninggal dan meninggalkan seorang istri serta dua anak laki-laki. Tidak ada hutang dan harta warisan berupa uang 500 juta rupiah. Bagaimana pembagiannya?",
		"Saya adalah anak dari pewaris yang telah meninggal. Ayah saya meninggalkan seorang istri dan kami lima anak laki-laki. Warisan berupa tabungan senilai 1,5 miliar rupiah. Tidak ada hutang. Bagaimana pembagiannya?",
		"Ayah saya telah berpulang. Beliau meninggalkan ibu saya serta saya dan satu saudara laki-laki. Tidak ada hutang dan terdapat uang sebesar 600 juta rupiah. Mohon bantuannya menghitung warisan.",
		"Saya ingin menanyakan pembagian warisan ayah saya. Beliau meninggalkan ibu saya dan tiga anak laki-laki. Tidak ada hutang dan warisan berupa uang 950 juta rupiah. Bagaimana cara menghitungnya?",
		"Ayah saya wafat tanpa meninggalkan hutang. Warisan yang ada berupa tabungan 700 juta rupiah. Beliau meninggalkan seorang istri dan dua anak laki-laki. Bagaimana pembagiannya menurut syariat Islam?",
		"Saya adalah anak laki-laki tunggal. Ayah saya telah wafat dan meninggalkan ibu saya. Uang warisan berjumlah 500 juta rupiah dan tidak ada hutang. Bagaimana pembagiannya?",
		"Kami kehilangan ayah tercinta. Beliau meninggalkan istri dan empat anak laki-laki. Warisan berupa uang 1,2 miliar rupiah. Tidak ada utang. Bagaimana seharusnya warisan tersebut dibagi?",
		"Ayah saya telah tiada dan meninggalkan harta. Beliau meninggalkan ibu saya dan saya sebagai satu-satunya anak laki-laki. Harta warisan berupa tabungan 400 juta rupiah. Tidak ada utang. Bagaimana warisnya?",
		"Saya ingin bertanya mengenai warisan dari ayah saya yang sudah meninggal. Beliau meninggalkan seorang istri dan tiga anak laki-laki. Warisan berupa 800 juta rupiah. Tidak ada tanggungan hutang. Bagaimana pembagiannya?",
		"Ayah saya wafat dan hanya meninggalkan saya serta ibu saya. Saya satu-satunya anak laki-laki. Uang warisan berjumlah 350 juta rupiah. Tanpa hutang. Bagaimana warisnya?",
		"Saya ingin menanyakan pembagian harta waris. Ayah saya meninggal dan meninggalkan satu istri serta dua anak laki-laki. Tidak ada hutang dan terdapat uang 600 juta rupiah. Bagaimana pembagiannya?",
		"Ayah saya berpulang tanpa meninggalkan hutang. Beliau meninggalkan seorang istri dan saya beserta satu adik laki-laki. Harta warisan berupa 700 juta rupiah. Bagaimana pembagian waris menurut hukum Islam?",
		"Saya adalah anak laki-laki dari seorang ayah yang sudah meninggal. Beliau juga meninggalkan seorang istri. Tidak ada hutang. Warisan berupa tabungan senilai 400 juta rupiah. Bagaimana pembagiannya?",
		"Ayah saya sudah meninggal dunia. Warisan berupa uang sebesar 900 juta rupiah. Beliau meninggalkan ibu saya dan dua anak laki-laki. Tanpa ada hutang. Bagaimana sebaiknya pembagiannya?",
		"Saya ingin bertanya tentang harta peninggalan ayah saya. Beliau meninggal dan meninggalkan istri serta satu anak laki-laki, yaitu saya. Tidak ada utang, dan warisannya senilai 300 juta rupiah. Bagaimana warisnya?",
		"Kami sedang mengurus warisan dari ayah kami yang telah tiada. Beliau meninggalkan ibu dan dua anak laki-laki. Tidak ada hutang dan harta berupa uang 800 juta rupiah. Mohon dijelaskan pembagiannya.",
		"Ayah saya meninggal dunia dan meninggalkan ibu saya serta saya dan tiga saudara laki-laki. Tidak ada hutang, dan terdapat warisan sebesar 1 miliar rupiah. Bagaimana pembagiannya?",
		"Saya ingin mengetahui pembagian warisan ayah saya. Beliau meninggal dan meninggalkan seorang istri serta empat anak laki-laki. Warisan berupa tabungan 1,3 miliar rupiah. Tidak ada hutang. Bagaimana hukumnya?",
		"Ayah saya wafat dan hanya meninggalkan istri serta satu anak laki-laki. Saya adalah anak laki-laki tersebut. Tidak ada hutang, dan uang warisan 500 juta rupiah. Bagaimana perhitungannya?",
		"Saya satu-satunya anak laki-laki dari ayah saya yang sudah meninggal. Beliau juga meninggalkan seorang istri. Tidak ada hutang. Warisan berupa tabungan senilai 400 juta rupiah. Bagaimana pembagiannya?",
		"Saya ingin bertanya tentang warisan ayah saya. Beliau meninggalkan istri dan dua anak laki-laki. Warisan berupa uang 750 juta rupiah. Tidak ada hutang. Mohon penjelasan pembagian sesuai hukum Islam.",
		"Ayah saya telah tiada. Beliau meninggalkan ibu saya dan kami tiga bersaudara laki-laki. Warisan berupa uang senilai 900 juta rupiah dan tidak ada utang. Bagaimana warisnya dibagi?",
		"Saya anak laki-laki dari almarhum ayah saya. Beliau meninggalkan ibu saya serta saya dan dua saudara laki-laki. Warisan sebesar 1,1 miliar rupiah tanpa hutang. Bagaimana pembagiannya?",
		"Kami baru saja kehilangan ayah. Beliau meninggalkan satu istri dan dua anak laki-laki. Tidak ada utang, dan terdapat tabungan sebesar 600 juta rupiah. Mohon dijelaskan pembagian warisnya.",
		"Ayah saya telah wafat dan meninggalkan ibu saya serta empat anak laki-laki. Warisan berupa uang sebesar 1,5 miliar rupiah. Tidak ada hutang yang harus dibayar. Bagaimana perhitungan warisnya?",
		"Saya adalah anak laki-laki dari pewaris. Ayah saya meninggal dan hanya meninggalkan ibu saya dan saya sendiri. Uang warisan sebesar 450 juta rupiah. Tidak ada utang. Bagaimana sebaiknya warisan dibagi?",
		"Saya ingin menanyakan warisan ayah saya yang sudah meninggal. Beliau meninggalkan ibu saya dan dua anak laki-laki. Tidak ada hutang. Uang warisan berjumlah 700 juta rupiah. Bagaimana perhitungan menurut Islam?",
		"Ayah saya telah meninggal dunia. Beliau meninggalkan ibu saya dan kami bertiga bersaudara laki-laki. Warisan berupa uang senilai 850 juta rupiah tanpa hutang. Bagaimana pembagiannya?",
		"Saya ingin memahami warisan yang ditinggalkan ayah saya. Beliau wafat dan meninggalkan seorang istri dan tiga anak laki-laki. Tidak ada hutang. Uang warisan sebesar 1 miliar rupiah. Bagaimana pembagiannya?",
		"Saya adalah salah satu anak laki-laki dari ayah saya yang telah meninggal. Beliau meninggalkan seorang istri dan dua anak laki-laki. Warisan berupa uang sebesar 700 juta rupiah. Tidak ada hutang. Bagaimana pembagiannya?",
		"Ayah saya wafat dan meninggalkan harta dalam bentuk tabungan senilai 1 miliar rupiah. Beliau meninggalkan ibu saya serta saya dan satu saudara laki-laki. Tidak ada hutang sama sekali. Bagaimana warisan tersebut dibagi?",
		"Ayah saya sudah meninggal dunia. Beliau meninggalkan ibu saya sebagai istri sah dan kami tiga bersaudara laki-laki. Uang warisan sejumlah 800 juta rupiah dan tidak ada hutang. Bagaimana cara membaginya?",
		"Saya ingin menanyakan pembagian warisan ayah saya. Beliau meninggalkan seorang istri dan empat anak laki-laki. Warisan berupa uang sebesar 1,4 miliar rupiah dan tanpa hutang. Bagaimana pembagian yang sesuai syariat?",
		"Ayah saya meninggal tanpa meninggalkan utang. Beliau hanya meninggalkan ibu saya dan dua anak laki-laki. Harta warisan berupa uang senilai 500 juta rupiah. Bagaimana pembagiannya?",
		"Saya anak laki-laki dari seorang ayah yang telah tiada. Ayah meninggalkan ibu saya dan saya serta tiga saudara laki-laki. Tidak ada utang. Warisan berupa uang tabungan senilai 1,2 miliar rupiah. Bagaimana warisnya?",
		"Ayah saya meninggal beberapa bulan lalu. Beliau meninggalkan seorang istri dan saya serta satu adik laki-laki. Harta yang tersisa berupa uang 650 juta rupiah. Tidak ada utang. Bagaimana pembagian waris menurut Islam?",
		"Saya ingin bertanya tentang warisan peninggalan ayah saya. Beliau meninggalkan ibu saya dan lima anak laki-laki. Warisan berupa uang 1,7 miliar rupiah, tanpa hutang. Bagaimana pembagiannya?",
		"Saya satu dari dua anak laki-laki pewaris. Ayah kami meninggal dunia dan meninggalkan istri serta dua anak laki-laki. Warisan berupa 900 juta rupiah dan tidak ada utang. Bagaimana perhitungan warisnya?",
		"Ayah saya wafat dan hanya meninggalkan saya dan ibu saya. Saya adalah anak laki-laki tunggal. Warisan berupa uang 500 juta rupiah dan tanpa hutang. Bagaimana hukum pembagiannya?",
		"Kami kehilangan ayah kami yang telah meninggal dunia. Beliau meninggalkan ibu kami dan tiga anak laki-laki. Warisan sebesar 1 miliar rupiah dan tidak ada utang. Bagaimana pembagiannya secara Islam?",
		"Saya ingin tahu bagaimana membagi harta waris ayah saya. Beliau meninggalkan ibu saya dan empat anak laki-laki. Harta berupa tabungan sebesar 1,3 miliar rupiah. Tidak ada utang. Bagaimana perhitungannya?",
		"Ayah saya sudah meninggal dan meninggalkan warisan senilai 850 juta rupiah. Beliau meninggalkan seorang istri dan dua anak laki-laki. Tanpa hutang. Bagaimana waris dibagi?",
		"Saya sebagai anak laki-laki dari pewaris ingin bertanya. Ayah saya meninggal, meninggalkan istri dan saya serta dua saudara laki-laki. Tidak ada hutang. Uang warisan sebesar 1 miliar rupiah. Bagaimana pembagiannya?",
		"Ayah saya wafat meninggalkan seorang istri dan lima anak laki-laki. Tidak ada hutang dan warisan berupa tabungan 2 miliar rupiah. Mohon penjelasan pembagian waris menurut Islam.",
		"Saya anak laki-laki dari ayah saya yang baru saja wafat. Beliau meninggalkan ibu saya serta saya dan satu saudara laki-laki. Warisan berupa uang 700 juta rupiah. Tidak ada utang. Bagaimana pembagiannya?",
		"Saya ingin bertanya soal harta warisan dari ayah saya. Beliau meninggal dan hanya meninggalkan ibu saya dan tiga anak laki-laki. Tidak ada hutang. Uang warisan sebesar 1,1 miliar rupiah. Bagaimana pembagian warisnya?",
		"Ayah saya telah tiada dan meninggalkan ibu saya serta empat anak laki-laki. Warisan berupa tabungan 1,5 miliar rupiah. Tidak ada utang. Bagaimana cara membaginya?",
		"Saya sebagai ahli waris ingin tahu perhitungan warisan ayah saya. Beliau meninggal dan meninggalkan istri dan dua anak laki-laki. Warisan berupa 650 juta rupiah tanpa hutang. Bagaimana pembagiannya?",
		"Kami baru saja kehilangan ayah. Beliau meninggalkan ibu dan tiga anak laki-laki. Tidak ada hutang. Warisan berupa uang 900 juta rupiah. Bagaimana pembagiannya?",
		"Saya ingin konsultasi tentang pembagian warisan ayah saya yang telah meninggal. Beliau meninggalkan seorang istri dan satu anak laki-laki, yaitu saya sendiri. Tidak ada utang. Warisan berupa uang 300 juta rupiah. Bagaimana cara membaginya?",
		"Saya adalah anak laki-laki tunggal dari ayah saya yang meninggal. Beliau meninggalkan seorang istri. Harta yang ditinggalkan berupa tabungan 450 juta rupiah. Tanpa utang. Bagaimana warisnya?",
		"Ayah saya wafat dan tidak memiliki utang. Beliau meninggalkan seorang istri dan dua anak laki-laki. Warisan berupa 800 juta rupiah. Bagaimana pembagian yang sesuai hukum Islam?",
		"Saya ingin menanyakan warisan dari ayah saya. Beliau meninggalkan ibu saya dan lima anak laki-laki. Tidak ada hutang. Warisan berupa uang 2 miliar rupiah. Bagaimana pembagiannya?",
		"Kami baru saja kehilangan ayah kandung kami. Beliau meninggalkan seorang istri dan dua anak laki-laki. Tidak ada utang. Harta warisan berupa uang sebesar 600 juta rupiah. Bagaimana waris dibagi?",
		"Ayah saya meninggal dan mewariskan uang sebesar 1 miliar rupiah. Beliau meninggalkan ibu saya serta saya dan dua saudara laki-laki. Tidak ada hutang. Bagaimana pembagiannya menurut syariat?",
		"Saya ingin mengetahui pembagian warisan ayah saya. Beliau wafat, meninggalkan seorang istri dan tiga anak laki-laki. Warisan berupa 900 juta rupiah. Tidak ada hutang. Bagaimana perhitungannya?",
		"Ayah saya sudah meninggal dan hanya meninggalkan saya serta ibu saya. Saya anak laki-laki tunggal. Tidak ada hutang. Warisan sebesar 400 juta rupiah. Bagaimana pembagian yang tepat?",
		"Kami kehilangan ayah beberapa waktu lalu. Beliau meninggalkan ibu dan empat anak laki-laki. Uang warisan berjumlah 1,4 miliar rupiah. Tanpa utang. Bagaimana pembagiannya menurut Islam?",
		"Saya ingin mengetahui pembagian harta peninggalan ayah saya. Beliau wafat, meninggalkan seorang istri dan dua anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 800 juta rupiah. Bagaimana pembagiannya?",
		"Ayah saya meninggal dan hanya meninggalkan satu istri serta satu anak laki-laki. Saya adalah anak tunggal. Warisan berupa 500 juta rupiah. Tidak ada hutang. Bagaimana pembagiannya?",
		"Saya satu dari tiga anak laki-laki dari ayah saya yang telah tiada. Beliau juga meninggalkan seorang istri. Tidak ada hutang. Warisan berupa uang tunai 950 juta rupiah. Bagaimana cara membaginya?",
		"Kami sedang mengurus warisan ayah kami yang telah wafat. Beliau meninggalkan istri dan lima anak laki-laki. Harta sebesar 2,2 miliar rupiah dan tanpa hutang. Bagaimana pembagian waris menurut syariat?",
		"Ayah saya telah berpulang. Beliau meninggalkan ibu saya dan saya sebagai satu-satunya anak laki-laki. Tidak ada hutang dan ada uang sebesar 400 juta rupiah. Bagaimana pembagiannya?",
		"Saya ingin bertanya tentang warisan ayah saya. Beliau meninggalkan ibu saya serta saya dan dua saudara laki-laki. Tidak ada hutang. Uang warisan berjumlah 1 miliar rupiah. Bagaimana pembagiannya?",
		"Saya adalah ahli waris dari ayah saya yang telah tiada. Beliau meninggalkan seorang istri dan tiga anak laki-laki. Tidak ada hutang. Warisan berupa tabungan senilai 1,2 miliar rupiah. Bagaimana pembagiannya?",
		"Ayah saya meninggal dunia tanpa meninggalkan hutang. Beliau meninggalkan ibu saya dan saya sebagai anak laki-laki tunggal. Warisan berupa uang 450 juta rupiah. Bagaimana waris dibagi?",
		"Saya anak dari ayah saya yang meninggal dunia. Beliau meninggalkan istri dan dua anak laki-laki. Harta berupa uang 700 juta rupiah. Tidak ada utang. Mohon penjelasan pembagian menurut Islam.",
		"Ayah saya meninggal dan mewariskan uang 1,1 miliar rupiah. Beliau meninggalkan ibu saya dan tiga anak laki-laki. Tidak ada tanggungan utang. Bagaimana cara menghitung pembagian warisan?",
		"Kami anak-anak laki-laki dari pewaris ingin tahu hukum pembagian waris. Ayah kami meninggal, meninggalkan seorang istri dan empat anak laki-laki. Warisan 1,3 miliar rupiah. Tidak ada hutang. Bagaimana pembagiannya?",
		"Saya satu-satunya anak laki-laki. Ayah saya wafat dan meninggalkan seorang istri. Uang warisan berjumlah 350 juta rupiah. Tidak ada hutang. Bagaimana warisan dibagi?",
		"Ayah saya wafat, meninggalkan istri dan dua anak laki-laki. Tidak ada utang dan harta warisan berupa uang 600 juta rupiah. Bagaimana pembagiannya secara Islam?",
		"Saya ingin bertanya mengenai harta peninggalan ayah saya. Beliau meninggalkan ibu saya serta tiga anak laki-laki. Warisan sebesar 1 miliar rupiah tanpa utang. Bagaimana pembagiannya?",
		"Saya anak laki-laki tunggal dari pewaris. Ayah saya meninggal dan meninggalkan seorang istri. Tidak ada hutang. Uang warisan sebesar 500 juta rupiah. Bagaimana pembagiannya menurut syariat?",
		"Ayah saya meninggal dan tidak memiliki utang. Beliau meninggalkan istri dan dua anak laki-laki. Warisan berupa uang 750 juta rupiah. Bagaimana cara membaginya?",
		"Kami ingin mengetahui perhitungan warisan ayah kami. Beliau wafat meninggalkan seorang istri dan lima anak laki-laki. Warisan 1,8 miliar rupiah. Tanpa utang. Bagaimana pembagiannya?",
		"Saya ingin penjelasan tentang warisan ayah saya. Beliau meninggal dan meninggalkan istri serta tiga anak laki-laki. Harta berupa uang 1 miliar rupiah. Tidak ada hutang. Bagaimana pembagiannya?",
		"Ayah saya wafat, meninggalkan ibu saya dan saya serta satu saudara laki-laki. Tidak ada utang. Uang warisan sebesar 800 juta rupiah. Bagaimana cara pembagiannya?",
		"Saya ingin mengetahui warisan dari ayah saya yang meninggal. Beliau meninggalkan istri dan satu anak laki-laki saja. Tidak ada hutang dan warisan sebesar 500 juta rupiah. Bagaimana pembagiannya?",
		"Saya anak laki-laki dari almarhum ayah saya. Beliau meninggalkan ibu saya dan saya sendiri. Warisan berupa uang 400 juta rupiah. Tidak ada utang. Bagaimana cara pembagian warisnya?"
	]
}
