{
  "texts": [
    "Suami saya wafat, meninggalkan saya sebagai istri, satu anak perempuan, serta kakek dari ayah pewaris. Harta yang ditinggalkan sekitar 320 juta rupiah.",
    "Saya kehilangan suami tercinta, yang meninggalkan saya, dua anak perempuan, dan kakek dari suami saya. Nilai harta warisnya mencapai 410 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya terdiri dari saya sebagai istri, empat anak perempuan, serta kakek dari jalur ayah beliau. Peninggalannya sebesar 385 juta rupiah.",
    "Setelah suami saya pergi untuk selamanya, beliau meninggalkan saya, tiga anak perempuan, dan kakek dari ayah pewaris. Jumlah hartanya 450 juta rupiah.",
    "Suami saya tutup usia, ahli warisnya adalah saya, satu anak perempuan, dan kakek dari ayahnya. Harta warisan tercatat 370 juta rupiah.",
    "Saya menjadi janda setelah suami wafat, meninggalkan dua anak perempuan dan kakek dari suami saya bersama saya. Harta yang ada sebesar 420 juta rupiah.",
    "Suami saya berpulang, ahli warisnya terdiri dari saya, lima anak perempuan, serta kakek dari pihak ayah beliau. Peninggalan hartanya 399 juta rupiah.",
    "Setelah suami saya meninggal, warisan beliau terdiri dari saya, satu anak perempuan, dan kakek dari ayahnya. Nilai peninggalannya mencapai 315 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan saya, empat anak perempuan, dan kakek dari ayah pewaris. Harta peninggalannya senilai 470 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, dua anak perempuan, dan kakek dari pihak ayah. Warisannya 360 juta rupiah.",
    "Suami saya berpulang, meninggalkan saya, satu anak perempuan, serta kakek dari suami saya. Nilai harta peninggalan sekitar 325 juta rupiah.",
    "Setelah suami wafat, ahli warisnya saya, tiga anak perempuan, dan kakek dari jalur ayah beliau. Hartanya 410 juta rupiah.",
    "Suami saya meninggal, ahli warisnya termasuk saya, empat anak perempuan, dan kakek dari pihak ayahnya. Peninggalan senilai 430 juta rupiah.",
    "Saya menjadi janda setelah suami pergi, meninggalkan satu anak perempuan dan kakek dari ayah pewaris bersama saya. Nilai hartanya 390 juta rupiah.",
    "Suami saya wafat, ahli warisnya saya, dua anak perempuan, dan kakek dari ayah suami saya. Harta mencapai 340 juta rupiah.",
    "Suami saya meninggal dunia, warisannya dibagi kepada saya, lima anak perempuan, dan kakek dari pihak ayah. Nilai peninggalan 480 juta rupiah.",
    "Setelah suami berpulang, beliau meninggalkan saya, tiga anak perempuan, serta kakek dari ayahnya. Hartanya sebesar 350 juta rupiah.",
    "Suami saya tutup usia, ahli warisnya terdiri dari saya, satu anak perempuan, dan kakek dari jalur ayah beliau. Harta warisnya 325 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan saya, dua anak perempuan, dan kakek dari ayah pewaris. Jumlah hartanya 405 juta rupiah.",
    "Suami saya meninggal, ahli warisnya adalah saya, empat anak perempuan, dan kakek dari ayahnya. Peninggalan senilai 460 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan kakek dari pihak ayah pewaris. Harta 375 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal, ahli warisnya saya, satu anak perempuan, dan kakek dari ayah beliau. Harta peninggalan 345 juta rupiah.",
    "Suami saya berpulang, meninggalkan saya, dua anak perempuan, serta kakek dari pihak ayahnya. Nilai harta 410 juta rupiah.",
    "Setelah suami saya meninggal, warisan diberikan kepada saya, empat anak perempuan, dan kakek dari ayah suami. Jumlah harta 470 juta rupiah.",
    "Suami saya tutup usia, ahli warisnya saya, satu anak perempuan, dan kakek dari ayahnya. Peninggalan sebesar 315 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan saya, tiga anak perempuan, dan kakek dari jalur ayahnya. Nilai hartanya 430 juta rupiah.",
    "Suami saya meninggal, ahli warisnya saya, dua anak perempuan, serta kakek dari pihak ayah. Harta mencapai 360 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, lima anak perempuan, dan kakek dari ayah pewaris. Harta warisan senilai 490 juta rupiah.",
    "Setelah suami saya meninggal dunia, ahli warisnya adalah saya, empat anak perempuan, dan kakek dari ayahnya. Nilai peninggalan 450 juta rupiah.",
    "Suami saya berpulang, meninggalkan saya, satu anak perempuan, dan kakek dari ayah beliau. Hartanya 310 juta rupiah.",
    "Saya menjadi janda, ahli warisnya saya, tiga anak perempuan, dan kakek dari ayah suami. Warisan bernilai 420 juta rupiah.",
    "Suami saya tutup usia, meninggalkan saya, dua anak perempuan, dan kakek dari jalur ayahnya. Jumlah harta 350 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, empat anak perempuan, serta kakek dari pihak ayah. Nilai peninggalan 460 juta rupiah.",
    "Setelah suami wafat, beliau meninggalkan saya, satu anak perempuan, dan kakek dari ayah pewaris. Harta warisannya 340 juta rupiah.",
    "Suami saya wafat, ahli warisnya saya, dua anak perempuan, dan kakek dari pihak ayahnya. Jumlah harta 375 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya adalah saya, tiga anak perempuan, serta kakek dari ayah suami saya. Hartanya 410 juta rupiah.",
    "Suami saya meninggal, meninggalkan saya, lima anak perempuan, dan kakek dari pihak ayah pewaris. Harta peninggalan 495 juta rupiah.",
    "Suami saya tutup usia, ahli warisnya saya, satu anak perempuan, dan kakek dari ayahnya. Peninggalan 315 juta rupiah.",
    "Suami saya meninggal dunia, warisan beliau dibagi kepada saya, dua anak perempuan, dan kakek dari jalur ayah. Nilai harta 350 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal, ahli warisnya saya, empat anak perempuan, dan kakek dari pihak ayah. Harta senilai 465 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, tiga anak perempuan, dan kakek dari ayah pewaris. Jumlah harta 380 juta rupiah.",
    "Suami saya berpulang, ahli warisnya saya, satu anak perempuan, serta kakek dari ayahnya. Harta peninggalan 325 juta rupiah.",
    "Setelah suami wafat, beliau meninggalkan saya, dua anak perempuan, dan kakek dari jalur ayahnya. Warisannya 355 juta rupiah.",
    "Suami saya meninggal, ahli warisnya saya, empat anak perempuan, dan kakek dari pihak ayah. Nilai peninggalan 460 juta rupiah.",
    "Suami saya tutup usia, meninggalkan saya, lima anak perempuan, dan kakek dari ayah pewaris. Harta mencapai 490 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya saya, satu anak perempuan, dan kakek dari ayah suami saya. Peninggalan senilai 315 juta rupiah.",
    "Suami saya wafat, ahli warisnya terdiri dari saya, tiga anak perempuan, dan kakek dari pihak ayahnya. Harta 405 juta rupiah.",
    "Suami saya berpulang, meninggalkan saya, dua anak perempuan, serta kakek dari jalur ayah. Nilai hartanya 350 juta rupiah.",
    "Setelah suami meninggal, warisan diberikan kepada saya, empat anak perempuan, dan kakek dari ayahnya. Jumlahnya 470 juta rupiah.",
    "Suami saya tutup usia, ahli warisnya saya, satu anak perempuan, dan kakek dari ayah pewaris. Harta peninggalan 320 juta rupiah.",
    "Setelah kepergian suami tercinta, saya sebagai istrinya, bersama seorang anak perempuan dan kakek dari pihak ayah pewaris menjadi ahli warisnya. Harta peninggalan sekitar 210 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan saya, dua anak perempuan, dan kakek dari ayah suami saya sebagai ahli waris. Total peninggalan beliau 350 juta rupiah.",
    "Sejak suami saya wafat, saya bersama tiga anak perempuan dan kakek dari jalur ayah suami saya berhak atas harta warisan. Nilainya mencapai 480 juta rupiah.",
    "Kepergian suami meninggalkan saya, empat anak perempuan, dan kakek dari ayahnya untuk menerima peninggalan senilai 260 juta rupiah.",
    "Setelah wafatnya suami saya, ahli waris yang ada hanyalah saya, satu anak perempuan, dan kakek dari jalur ayah suami saya. Peninggalan beliau sebesar 190 juta rupiah.",
    "Suami saya berpulang, meninggalkan harta senilai 310 juta rupiah yang menjadi hak saya, tiga anak perempuan, serta kakek dari ayah pewaris.",
    "Saya sebagai istri, bersama dua anak perempuan dan kakek dari jalur ayah suami saya, menerima warisan sebesar 400 juta rupiah setelah beliau wafat.",
    "Saat suami meninggal, ahli warisnya hanya saya, satu anak perempuan, dan kakek dari pihak ayahnya. Harta peninggalan sebesar 280 juta rupiah.",
    "Kepergian suami meninggalkan saya, empat anak perempuan, dan kakek dari jalur ayah pewaris, dengan harta sekitar 320 juta rupiah.",
    "Setelah suami wafat, saya bersama dua anak perempuan dan kakek dari pihak ayahnya berhak menerima peninggalan sebesar 360 juta rupiah.",
    "Suami saya meninggal, menyisakan warisan sebesar 270 juta rupiah untuk saya, satu anak perempuan, dan kakek dari ayahnya.",
    "Dengan wafatnya suami, ahli waris yang tersisa hanyalah saya, tiga anak perempuan, dan kakek dari jalur ayahnya. Nilai harta sekitar 450 juta rupiah.",
    "Suami berpulang, meninggalkan saya, dua anak perempuan, dan kakek dari pihak ayahnya, dengan peninggalan 300 juta rupiah.",
    "Saya kehilangan suami, dan kini bersama empat anak perempuan serta kakek dari ayahnya menerima warisan senilai 380 juta rupiah.",
    "Setelah kepergian suami, warisan sebesar 260 juta rupiah dibagikan kepada saya, satu anak perempuan, dan kakek dari jalur ayahnya.",
    "Suami saya wafat, ahli warisnya adalah saya, tiga anak perempuan, dan kakek dari pihak ayah pewaris, dengan harta 340 juta rupiah.",
    "Saya sebagai istri, bersama dua anak perempuan dan kakek dari jalur ayahnya, menerima peninggalan 410 juta rupiah setelah beliau wafat.",
    "Meninggalnya suami menyisakan saya, empat anak perempuan, dan kakek dari ayahnya sebagai penerima warisan 370 juta rupiah.",
    "Seusai suami meninggal, saya bersama satu anak perempuan dan kakek dari jalur ayahnya menerima peninggalan sebesar 220 juta rupiah.",
    "Harta warisan suami sebesar 330 juta rupiah menjadi hak saya, dua anak perempuan, dan kakek dari ayahnya setelah beliau wafat.",
    "Saya ditinggalkan suami, ahli warisnya adalah saya, tiga anak perempuan, dan kakek dari pihak ayahnya, dengan warisan senilai 490 juta rupiah.",
    "Setelah kepergian suami, peninggalan sebesar 310 juta rupiah dibagikan kepada saya, satu anak perempuan, dan kakek dari jalur ayahnya.",
    "Suami saya wafat, meninggalkan saya, dua anak perempuan, dan kakek dari ayahnya sebagai ahli waris, dengan harta 270 juta rupiah.",
    "Seusai suami berpulang, saya bersama empat anak perempuan dan kakek dari jalur ayahnya menerima peninggalan 420 juta rupiah.",
    "Kepergian suami menyisakan warisan 350 juta rupiah untuk saya, satu anak perempuan, dan kakek dari pihak ayahnya.",
    "Saya sebagai istri, bersama tiga anak perempuan dan kakek dari jalur ayah suami saya, menerima warisan sebesar 300 juta rupiah.",
    "Meninggalnya suami membawa peninggalan 280 juta rupiah yang menjadi hak saya, dua anak perempuan, dan kakek dari ayahnya.",
    "Seusai suami wafat, ahli waris yang ada hanyalah saya, empat anak perempuan, dan kakek dari jalur ayahnya. Nilai harta sekitar 390 juta rupiah.",
    "Suami saya berpulang, meninggalkan saya, satu anak perempuan, dan kakek dari ayahnya, dengan harta senilai 250 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya adalah saya, dua anak perempuan, dan kakek dari jalur ayahnya, dengan peninggalan 320 juta rupiah.",
    "Setelah suami wafat, harta sebesar 370 juta rupiah dibagikan kepada saya, tiga anak perempuan, dan kakek dari pihak ayahnya.",
    "Suami saya meninggal dunia, meninggalkan saya, empat anak perempuan, dan kakek dari jalur ayahnya, dengan warisan 430 juta rupiah.",
    "Dengan meninggalnya suami, ahli waris yang tersisa hanyalah saya, satu anak perempuan, dan kakek dari pihak ayahnya, dengan harta 210 juta rupiah.",
    "Kepergian suami menyisakan peninggalan 340 juta rupiah untuk saya, dua anak perempuan, dan kakek dari jalur ayahnya.",
    "Saya ditinggal suami, dan bersama tiga anak perempuan serta kakek dari ayahnya menerima warisan 400 juta rupiah.",
    "Meninggalnya suami menyisakan saya, empat anak perempuan, dan kakek dari jalur ayahnya sebagai ahli waris, dengan harta 360 juta rupiah.",
    "Setelah wafatnya suami, saya bersama satu anak perempuan dan kakek dari ayahnya menerima peninggalan sebesar 230 juta rupiah.",
    "Warisan sebesar 310 juta rupiah menjadi hak saya, dua anak perempuan, dan kakek dari jalur ayahnya setelah suami saya wafat.",
    "Suami saya berpulang, ahli warisnya adalah saya, tiga anak perempuan, dan kakek dari pihak ayahnya, dengan harta 380 juta rupiah.",
    "Seusai kepergian suami, saya bersama empat anak perempuan dan kakek dari jalur ayahnya menerima peninggalan 420 juta rupiah.",
    "Harta sebesar 250 juta rupiah menjadi hak saya, satu anak perempuan, dan kakek dari ayahnya setelah suami saya meninggal.",
    "Saya kehilangan suami, meninggalkan dua anak perempuan dan kakek dari jalur ayahnya sebagai ahli waris bersama saya, dengan harta 330 juta rupiah.",
    "Setelah suami meninggal, warisan sebesar 360 juta rupiah dibagikan kepada saya, tiga anak perempuan, dan kakek dari pihak ayahnya.",
    "Kepergian suami menyisakan saya, empat anak perempuan, dan kakek dari jalur ayahnya, dengan harta senilai 410 juta rupiah.",
    "Seusai suami wafat, saya bersama satu anak perempuan dan kakek dari ayahnya menerima peninggalan sebesar 220 juta rupiah.",
    "Suami saya berpulang, meninggalkan harta sebesar 300 juta rupiah yang menjadi hak saya, dua anak perempuan, dan kakek dari jalur ayahnya.",
    "Setelah meninggalnya suami, saya bersama tiga anak perempuan dan kakek dari pihak ayahnya menerima warisan 390 juta rupiah.",
    "Suami saya wafat, ahli warisnya adalah saya, empat anak perempuan, dan kakek dari jalur ayahnya, dengan harta senilai 370 juta rupiah.",
    "Seusai suami berpulang, peninggalan sebesar 260 juta rupiah menjadi hak saya, satu anak perempuan, dan kakek dari ayahnya.",
    "Kepergian suami menyisakan saya, dua anak perempuan, dan kakek dari jalur ayahnya, dengan warisan senilai 340 juta rupiah."
  ]
}