{
  "texts": [
    "Suami saya baru saja wafat, beliau meninggalkan saya sebagai istri, satu anak laki-laki, dua anak perempuan, serta seorang kakek. Harta yang ditinggalkan sekitar Rp350.000.000.",
    "Suami saya meninggal dunia, ahli warisnya yaitu istrinya, dua anak lelaki, tiga anak perempuan, dan kakeknya. Harta warisan ada Rp410.000.000.",
    "Saya kehilangan suami, ia pergi meninggalkan saya, seorang putra, seorang putri, dan kakeknya. Jumlah harta peninggalan Rp280.000.000.",
    "Almarhum suami saya mewariskan untuk saya, dua anak laki-laki, dua anak perempuan, dan kakeknya. Hartanya sekitar Rp500.000.000.",
    "Suami saya berpulang, ia meninggalkan saya, seorang anak lelaki, tiga anak perempuan, dan seorang kakek. Harta sekitar Rp325.000.000.",
    "Saat suami saya wafat, ahli waris yang tersisa yaitu saya istrinya, dua putra, seorang putri, serta kakeknya. Harta yang ditinggalkan Rp290.000.000.",
    "Suami saya meninggalkan warisan sebesar Rp450.000.000 untuk saya, dua anak laki-laki, dua anak perempuan, dan seorang kakek.",
    "Ketika suami saya meninggal, yang menjadi ahli waris adalah saya istrinya, satu anak laki-laki, satu anak perempuan, serta kakek. Nilai harta Rp310.000.000.",
    "Suami saya berpulang, ahli warisnya adalah saya, tiga putra, dan dua putri, ditambah seorang kakek. Jumlah harta Rp370.000.000.",
    "Suami saya wafat, beliau meninggalkan saya istri, satu anak lelaki, empat anak perempuan, serta kakeknya. Warisan senilai Rp400.000.000.",
    "Suami saya telah meninggal dunia, ahli warisnya meliputi saya istrinya, tiga anak laki-laki, satu anak perempuan, dan seorang kakek. Harta warisan Rp520.000.000.",
    "Suami saya meninggalkan harta Rp340.000.000 untuk dibagi kepada saya istrinya, dua putra, dua putri, dan kakek.",
    "Ketika suami saya wafat, ahli warisnya yaitu saya, seorang anak laki-laki, seorang anak perempuan, dan seorang kakek. Jumlah harta Rp275.000.000.",
    "Almarhum suami saya mewariskan untuk saya, tiga anak perempuan, seorang anak laki-laki, dan kakeknya. Harta sekitar Rp460.000.000.",
    "Suami saya meninggal dunia, beliau meninggalkan saya istri, satu putra, dua putri, serta kakek. Warisannya Rp320.000.000.",
    "Saya kehilangan suami, ia meninggalkan saya, empat anak laki-laki, seorang anak perempuan, dan seorang kakek. Harta Rp550.000.000.",
    "Suami saya berpulang, ia meninggalkan saya istrinya, dua anak lelaki, tiga anak perempuan, serta kakeknya. Harta Rp480.000.000.",
    "Suami saya wafat, ahli warisnya adalah saya istri, satu anak laki-laki, tiga anak perempuan, dan seorang kakek. Hartanya Rp330.000.000.",
    "Suami saya meninggal, ahli warisnya yaitu saya istrinya, dua putra, seorang putri, serta kakek. Jumlah harta Rp360.000.000.",
    "Saat suami saya wafat, beliau meninggalkan saya, tiga anak laki-laki, dua anak perempuan, dan seorang kakek. Warisan Rp510.000.000.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya istrinya, satu anak lelaki, satu anak perempuan, dan seorang kakek. Nilai harta Rp300.000.000.",
    "Suami saya meninggalkan warisan Rp420.000.000 untuk dibagi kepada saya, dua anak laki-laki, dua anak perempuan, dan kakek.",
    "Ketika suami saya meninggal, ia meninggalkan saya istrinya, seorang putra, tiga putri, serta kakeknya. Hartanya Rp370.000.000.",
    "Suami saya berpulang, ahli warisnya adalah saya, empat anak laki-laki, dua anak perempuan, dan seorang kakek. Harta Rp600.000.000.",
    "Suami saya wafat, beliau meninggalkan saya istrinya, dua putra, satu putri, serta kakeknya. Harta peninggalan Rp310.000.000.",
    "Almarhum suami saya meninggalkan harta Rp490.000.000, ahli warisnya saya istrinya, tiga anak lelaki, dan dua anak perempuan serta kakeknya.",
    "Suami saya telah meninggal dunia, ahli warisnya yaitu saya, seorang anak laki-laki, seorang anak perempuan, serta seorang kakek. Jumlah harta Rp280.000.000.",
    "Suami saya berpulang, ia meninggalkan saya istri, dua anak lelaki, tiga anak perempuan, dan kakeknya. Warisan Rp430.000.000.",
    "Suami saya wafat, ahli warisnya meliputi saya, satu anak laki-laki, empat anak perempuan, dan kakek. Hartanya Rp400.000.000.",
    "Suami saya meninggal, ia meninggalkan saya istrinya, tiga anak lelaki, dua anak perempuan, dan kakek. Warisan Rp520.000.000.",
    "Suami saya meninggalkan harta Rp350.000.000, ahli warisnya yaitu saya, seorang anak laki-laki, seorang anak perempuan, dan seorang kakek.",
    "Saat suami saya wafat, beliau meninggalkan saya istri, dua anak laki-laki, dua anak perempuan, serta kakeknya. Harta Rp390.000.000.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, satu anak lelaki, tiga anak perempuan, dan seorang kakek. Jumlah harta Rp310.000.000.",
    "Almarhum suami saya mewariskan harta Rp460.000.000 untuk saya, tiga putra, seorang putri, dan kakeknya.",
    "Suami saya berpulang, ia meninggalkan saya, dua anak lelaki, tiga anak perempuan, dan kakeknya. Warisan Rp440.000.000.",
    "Suami saya wafat, ahli warisnya adalah saya, seorang anak laki-laki, seorang anak perempuan, serta kakek. Nilai harta Rp300.000.000.",
    "Suami saya meninggal dunia, ahli warisnya saya istrinya, tiga anak laki-laki, dua anak perempuan, dan seorang kakek. Harta Rp510.000.000.",
    "Suami saya meninggalkan warisan Rp340.000.000, ahli warisnya yaitu saya, satu anak lelaki, satu anak perempuan, dan seorang kakek.",
    "Ketika suami saya wafat, ia meninggalkan saya istri, dua anak laki-laki, dua anak perempuan, dan kakek. Warisan Rp420.000.000.",
    "Suami saya berpulang, ahli warisnya adalah saya, seorang putra, tiga putri, serta seorang kakek. Hartanya Rp330.000.000.",
    "Suami saya wafat, beliau meninggalkan saya istrinya, empat anak laki-laki, seorang anak perempuan, dan kakeknya. Harta Rp570.000.000.",
    "Almarhum suami saya meninggalkan harta Rp360.000.000, ahli warisnya saya, dua anak lelaki, dua anak perempuan, serta kakek.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya istri, seorang anak laki-laki, seorang anak perempuan, dan seorang kakek. Hartanya Rp310.000.000.",
    "Suami saya berpulang, ia meninggalkan saya, tiga anak lelaki, dua anak perempuan, serta kakeknya. Warisan Rp480.000.000.",
    "Suami saya wafat, ahli warisnya adalah saya, satu anak laki-laki, empat anak perempuan, dan seorang kakek. Jumlah harta Rp400.000.000.",
    "Suami saya meninggal dunia, ahli warisnya yaitu saya, dua anak lelaki, tiga anak perempuan, serta kakeknya. Hartanya Rp450.000.000.",
    "Suami saya meninggalkan harta Rp310.000.000 untuk saya, seorang anak laki-laki, seorang anak perempuan, dan seorang kakek.",
    "Saat suami saya wafat, ia meninggalkan saya istrinya, tiga anak lelaki, dua anak perempuan, dan seorang kakek. Warisan Rp490.000.000.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, seorang anak laki-laki, tiga anak perempuan, dan kakek. Nilai harta Rp350.000.000.",
    "Suami saya wafat, ia meninggalkan saya istrinya, dua anak lelaki, dua anak perempuan, dan seorang kakek. Harta peninggalan Rp430.000.000.",
    "Suami saya meninggal dunia, meninggalkan saya sebagai istri, dua orang putra, seorang anak perempuan, serta kakeknya. Hartanya berjumlah Rp350.000.000, bagaimana pembagiannya?",
    "Suamiku wafat, ahli warisnya terdiri dari istrinya, tiga anak laki-laki, dua anak perempuan, serta kakeknya, dengan harta Rp420.000.000. Bagaimana cara pembagiannya?",
    "Suamiku baru saja tiada, beliau meninggalkan seorang istri, dua anak lelaki, satu anak perempuan, dan seorang kakek, dengan total harta Rp280.000.000. Mohon pembagiannya.",
    "Suami saya berpulang, ahli waris yang tersisa yaitu saya sebagai istri, dua anak laki-laki, dua anak perempuan, serta kakeknya. Harta beliau Rp310.000.000. Bagaimana pembagiannya?",
    "Suamiku sudah meninggal, meninggalkan harta Rp450.000.000 untuk dibagi kepada istrinya, tiga anak laki-laki, satu anak perempuan, dan seorang kakek. Bagaimana rinciannya?",
    "Suami saya meninggal, ahli warisnya adalah istri, seorang anak lelaki, dua anak perempuan, dan seorang kakek. Harta Rp360.000.000, bagaimana pembagiannya?",
    "Suamiku wafat, pewaris meninggalkan istri, dua anak laki-laki, tiga anak perempuan, dan seorang kakek. Jumlah harta Rp400.000.000. Bagaimana cara membaginya?",
    "Suamiku sudah tiada, beliau meninggalkan saya istri, satu anak laki-laki, satu anak perempuan, dan seorang kakek. Nilai harta Rp270.000.000. Mohon pembagiannya.",
    "Suami saya berpulang, ahli waris terdiri dari istri, dua anak laki-laki, seorang anak perempuan, dan kakeknya. Hartanya Rp325.000.000. Bagaimana pembagiannya?",
    "Suamiku meninggal dunia, meninggalkan harta Rp500.000.000 untuk ahli waris berupa istri, tiga anak laki-laki, dua anak perempuan, dan seorang kakek. Bagaimana rinciannya?",
    "Suami saya wafat, ahli waris yang ditinggalkan adalah istri, dua anak laki-laki, dan kakeknya. Harta warisan sebesar Rp290.000.000. Bagaimana pembagiannya?",
    "Suamiku berpulang, beliau meninggalkan saya istri, tiga anak perempuan, dua anak laki-laki, serta kakek. Hartanya Rp340.000.000. Mohon hitungannya.",
    "Suami saya sudah tiada, ahli warisnya ada istri, seorang anak laki-laki, dua anak perempuan, dan kakek. Hartanya Rp310.000.000. Bagaimana pembagian yang benar?",
    "Suamiku wafat, meninggalkan istri, dua anak laki-laki, satu anak perempuan, serta kakek. Hartanya Rp375.000.000. Mohon pembagiannya.",
    "Suamiku baru saja meninggal, beliau meninggalkan saya istri, tiga anak lelaki, seorang anak perempuan, serta kakeknya. Hartanya Rp430.000.000. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia, ahli waris yang tersisa ialah istri, satu anak laki-laki, tiga anak perempuan, dan kakek. Harta Rp280.000.000. Bagaimana cara membaginya?",
    "Suami saya wafat, ahli warisnya terdiri dari istri, dua anak laki-laki, dua anak perempuan, dan kakeknya. Harta warisan Rp390.000.000. Bagaimana pembagiannya?",
    "Suamiku tiada, meninggalkan saya sebagai istri, tiga anak laki-laki, seorang anak perempuan, serta kakeknya. Hartanya Rp450.000.000. Bagaimana pembagiannya?",
    "Suamiku wafat, ahli waris ada istri, dua anak lelaki, dua anak perempuan, serta seorang kakek. Jumlah harta Rp320.000.000. Bagaimana cara membaginya?",
    "Suami saya sudah meninggal, beliau meninggalkan istri, seorang anak laki-laki, satu anak perempuan, serta kakek. Hartanya Rp260.000.000. Mohon hitungan pembagiannya.",
    "Suami saya wafat, ahli waris yang tersisa adalah istri, tiga anak laki-laki, dua anak perempuan, dan seorang kakek. Harta warisan Rp410.000.000. Bagaimana pembagiannya?",
    "Suamiku meninggal, meninggalkan saya istri, dua anak laki-laki, seorang anak perempuan, dan seorang kakek. Hartanya Rp330.000.000. Bagaimana pembagiannya?",
    "Suamiku berpulang, ahli waris yang ada ialah istri, seorang anak lelaki, dua anak perempuan, serta seorang kakek. Harta Rp295.000.000. Bagaimana hitungannya?",
    "Suamiku sudah tidak ada, ahli waris yang ditinggalkan ialah istri, dua anak laki-laki, tiga anak perempuan, serta kakeknya. Harta Rp360.000.000. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan istri, seorang anak lelaki, seorang anak perempuan, serta kakeknya. Hartanya Rp280.000.000. Mohon perhitungannya.",
    "Suamiku meninggal, ahli waris yang ada terdiri dari istri, dua anak laki-laki, dua anak perempuan, serta seorang kakek. Harta Rp350.000.000. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan saya istri, tiga anak lelaki, dua anak perempuan, serta kakeknya. Jumlah harta Rp470.000.000. Bagaimana cara membaginya?",
    "Suamiku meninggal dunia, ahli warisnya terdiri dari istri, dua anak laki-laki, satu anak perempuan, dan kakeknya. Hartanya Rp310.000.000. Mohon pembagiannya.",
    "Suami saya wafat, beliau meninggalkan istri, seorang anak laki-laki, tiga anak perempuan, serta kakek. Hartanya Rp380.000.000. Bagaimana perhitungannya?",
    "Suamiku tiada, ahli waris yang tersisa ialah istri, dua anak lelaki, dua anak perempuan, serta kakeknya. Harta Rp420.000.000. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan saya istri, tiga anak laki-laki, seorang anak perempuan, dan kakek. Jumlah harta Rp400.000.000. Bagaimana cara pembagiannya?",
    "Suamiku berpulang, ahli warisnya adalah istri, dua anak laki-laki, satu anak perempuan, serta kakeknya. Harta Rp330.000.000. Bagaimana pembagiannya?",
    "Suamiku sudah meninggal, meninggalkan saya istri, dua anak lelaki, dua anak perempuan, serta kakeknya. Hartanya Rp360.000.000. Bagaimana cara membaginya?",
    "Suami saya wafat, ahli waris yang ditinggalkan ialah istri, seorang anak laki-laki, tiga anak perempuan, serta kakek. Hartanya Rp310.000.000. Bagaimana pembagiannya?",
    "Suamiku meninggal dunia, meninggalkan istri, dua anak lelaki, dua anak perempuan, serta seorang kakek. Harta Rp390.000.000. Bagaimana cara membaginya?",
    "Suami saya wafat, beliau meninggalkan istri, tiga anak laki-laki, seorang anak perempuan, serta kakeknya. Hartanya Rp420.000.000. Bagaimana pembagiannya?",
    "Suamiku sudah tiada, ahli waris yang tersisa yaitu istri, dua anak lelaki, satu anak perempuan, serta seorang kakek. Hartanya Rp300.000.000. Bagaimana cara membaginya?",
    "Suamiku meninggal, meninggalkan istri, seorang anak lelaki, dua anak perempuan, serta kakek. Hartanya Rp270.000.000. Mohon pembagiannya.",
    "Suami saya wafat, ahli waris yang ditinggalkan terdiri dari istri, dua anak laki-laki, dua anak perempuan, serta seorang kakek. Hartanya Rp340.000.000. Bagaimana cara membaginya?",
    "Suamiku wafat, ahli waris ada istri, tiga anak laki-laki, satu anak perempuan, serta kakeknya. Harta Rp450.000.000. Bagaimana perhitungannya?",
    "Suami saya meninggal, meninggalkan istri, seorang anak laki-laki, tiga anak perempuan, serta seorang kakek. Jumlah harta Rp320.000.000. Bagaimana pembagiannya?",
    "Suamiku sudah tiada, beliau meninggalkan saya istri, dua anak lelaki, dua anak perempuan, serta seorang kakek. Hartanya Rp370.000.000. Mohon pembagiannya.",
    "Suami saya wafat, ahli warisnya adalah istri, tiga anak laki-laki, satu anak perempuan, serta kakeknya. Hartanya Rp420.000.000. Bagaimana pembagiannya?",
    "Suamiku wafat, ahli waris terdiri dari istri, seorang anak lelaki, dua anak perempuan, serta kakeknya. Harta Rp310.000.000. Bagaimana pembagiannya?",
    "Suamiku meninggal, meninggalkan saya istri, dua anak laki-laki, dua anak perempuan, serta kakeknya. Jumlah harta Rp350.000.000. Bagaimana cara membaginya?",
    "Suami saya wafat, beliau meninggalkan istri, dua anak lelaki, satu anak perempuan, serta kakek. Hartanya Rp280.000.000. Bagaimana hitungannya?",
    "Suamiku sudah tiada, ahli waris terdiri dari istri, tiga anak laki-laki, dua anak perempuan, serta kakeknya. Hartanya Rp440.000.000. Bagaimana pembagiannya?",
    "Suami saya wafat, ahli waris yang ditinggalkan ialah istri, seorang anak laki-laki, tiga anak perempuan, serta kakeknya. Hartanya Rp330.000.000. Bagaimana perhitungannya?",
    "Suamiku meninggal dunia, meninggalkan istri, dua anak laki-laki, dua anak perempuan, serta seorang kakek. Hartanya Rp390.000.000. Bagaimana cara membaginya?",
    "Suamiku wafat, ahli warisnya adalah istri, tiga anak lelaki, satu anak perempuan, serta seorang kakek. Harta Rp410.000.000. Bagaimana pembagiannya?"
  ]
}