{
  "texts": [
    "Ayah saya wafat dan meninggalkan Mama serta saya sebagai anak perempuan tunggal. Warisan yang tersisa 900 juta, dengan hutang 200 juta. Bagaimana cara membaginya?",
    "Papah saya sudah tidak ada. Yang ditinggalkan hanya Mamah saya dan saya. Harta warisan 850 juta, tetapi ada utang 180 juta. Bagaimana pembagiannya?",
    "Bapak saya meninggal dunia, mewariskan harta 1,1 miliar dan utang sebesar 250 juta. Kami ahli warisnya hanya Mama dan dua anak perempuan. Bagaimana pembagiannya?",
    "Papa saya wafat. Beliau meninggalkan istri dan saya sebagai anak perempuan satu-satunya. Warisan 880 juta, tapi ada hutang 150 juta. Bagaimana perhitungannya?",
    "Ayah saya sudah wafat. Kami yang ditinggalkan hanya Mamah saya dan dua anak perempuan. Warisan 1,2 miliar dan utang 300 juta. Bagaimana cara membaginya?",
    "Bapak saya meninggal, meninggalkan Mama saya dan saya sebagai satu-satunya anak perempuan. Warisan 870 juta, dengan utang 160 juta. Mohon pembagian warisnya.",
    "Papah saya sudah tiada. Beliau mewariskan 1 miliar, namun masih ada utang 220 juta. Pewaris hanya meninggalkan Mama dan dua anak perempuan. Bagaimana pembagiannya?",
    "Ayah saya wafat, meninggalkan istri dan saya. Warisan 930 juta dan hutang 190 juta. Bagaimana pembagian yang sesuai?",
    "Papa saya meninggal. Beliau hanya punya satu anak perempuan, yaitu saya, dan Mamah saya. Warisan 850 juta dan hutang 170 juta. Bagaimana cara membaginya?",
    "Ayah saya telah tiada. Ia meninggalkan Mama dan dua anak perempuan. Warisan senilai 1,25 miliar, dengan utang 280 juta. Mohon penjelasan pembagiannya.",
    "Bapak saya wafat dan meninggalkan saya serta Ibu saya. Warisan 900 juta, tapi masih ada tanggungan hutang 200 juta. Bagaimana seharusnya dibagi?",
    "Papah saya sudah meninggal dunia. Warisan yang tersedia 890 juta, sementara hutangnya 190 juta. Kami ahli warisnya hanya saya dan Mama. Bagaimana pembagiannya?",
    "Ayah saya meninggal dunia. Pewaris meninggalkan Mamah dan dua anak perempuan. Warisan 1,1 miliar, utang 250 juta. Mohon perhitungannya.",
    "Papa saya wafat dan meninggalkan saya serta Mamah. Warisan 860 juta dan utang 180 juta. Bagaimana perhitungan warisnya?",
    "Ayah saya sudah tidak ada. Beliau hanya meninggalkan Mama dan saya. Warisan 870 juta, utangnya 160 juta. Mohon pembagiannya.",
    "Papah saya wafat. Beliau meninggalkan Mamah dan dua anak perempuan. Warisan 1,05 miliar dan hutang 230 juta. Bagaimana cara pembagian warisnya?",
    "Bapak saya sudah meninggal. Yang ditinggalkan hanya saya dan Ibu. Warisan 910 juta dan utang 200 juta. Bagaimana pembagiannya menurut Islam?",
    "Ayah saya meninggal dunia, meninggalkan saya dan Mama. Warisan sebesar 880 juta, dengan tanggungan hutang 190 juta. Mohon bantuannya.",
    "Papah saya sudah tidak ada. Beliau hanya meninggalkan saya dan Ibu saya. Warisan 850 juta dan utang 170 juta. Bagaimana cara membaginya?",
    "Ayah saya wafat, meninggalkan Mamah saya dan saya sendiri. Warisan 900 juta dan utang 200 juta. Bagaimana pembagian warisnya?",
    "Bapak saya wafat, meninggalkan saya sebagai anak perempuan tunggal dan Mama. Warisan 860 juta, utangnya 180 juta. Bagaimana pembagiannya?",
    "Papah saya wafat dan mewariskan 1 miliar, tetapi masih memiliki utang 250 juta. Yang ditinggalkan hanya saya dan Mama. Mohon penjelasan pembagian warisnya.",
    "Ayah saya meninggal dan hanya meninggalkan saya dan Mamah. Warisan 930 juta dan utang 210 juta. Bagaimana perhitungannya?",
    "Bapak saya meninggal dunia. Pewaris hanya meninggalkan istri dan dua anak perempuan. Warisan 1,15 miliar, utang 260 juta. Bagaimana pembagian yang sesuai?",
    "Papah saya wafat. Kami yang ditinggalkan hanya Mamah dan saya. Warisan 870 juta dan utang 180 juta. Bagaimana sebaiknya dibagi?",
    "Ayah saya sudah tiada. Beliau meninggalkan Ibu saya dan satu anak perempuan. Warisan 890 juta dan utang 190 juta. Bagaimana pembagian yang benar?",
    "Papa saya meninggal dunia. Beliau meninggalkan saya dan Mamah saya. Warisan 900 juta, utangnya 200 juta. Bagaimana cara menghitung warisnya?",
    "Ayah saya wafat dan mewariskan 880 juta, dengan utang 170 juta. Ahli warisnya hanya saya dan Mama. Bagaimana perhitungan warisnya?",
    "Bapak saya sudah tidak ada. Warisan yang tersisa 870 juta dan utang 160 juta. Kami hanya dua orang ahli waris: Mama dan saya. Bagaimana pembagiannya?",
    "Papah saya sudah wafat. Warisan 950 juta, dengan utang 220 juta. Yang ditinggalkan hanya Mamah dan dua anak perempuan. Bagaimana pembagiannya?",
    "Ayah saya meninggal, hanya meninggalkan saya dan Mama. Warisan sebesar 890 juta dan utang 190 juta. Mohon bantuan pembagiannya.",
    "Bapak saya wafat dan meninggalkan 870 juta, namun ada utang 180 juta. Ahli warisnya hanya saya dan Mama. Bagaimana pembagian yang tepat?",
    "Papah saya sudah meninggal dunia. Beliau meninggalkan Mama dan dua anak perempuan. Warisan 1,1 miliar dan utang 240 juta. Bagaimana perhitungannya?",
    "Ayah saya wafat, mewariskan 900 juta dan memiliki utang 200 juta. Kami hanya dua orang ahli waris: saya dan Mama. Bagaimana warisnya dibagikan?",
    "Bapak saya meninggal dunia, hanya meninggalkan Mamah dan saya. Warisan 850 juta dan utang 170 juta. Bagaimana cara pembagiannya?",
    "Papah saya wafat dan meninggalkan saya serta Ibu. Warisan 880 juta, namun masih ada utang 190 juta. Bagaimana pembagian warisnya?",
    "Ayah saya sudah tiada. Beliau meninggalkan Mamah dan satu anak perempuan. Warisan 900 juta, utangnya 200 juta. Bagaimana cara pembagiannya?",
    "Bapak saya meninggal dunia. Beliau mewariskan harta sebesar 890 juta dan meninggalkan utang 190 juta. Kami ahli warisnya hanya saya dan Mama. Bagaimana pembagiannya?",
    "Papah saya wafat, hanya meninggalkan saya dan Mamah. Warisan 870 juta dan utang 180 juta. Mohon perhitungan warisnya.",
    "Ayah saya wafat dan meninggalkan Mamah saya serta saya. Warisan sebesar 860 juta dan utang 170 juta. Bagaimana cara membaginya?",
    "Papa saya sudah tiada. Beliau meninggalkan warisan 900 juta dan utang 200 juta. Kami hanya dua ahli waris: saya dan Mama. Bagaimana pembagian yang sesuai?",
    "Ayah saya meninggal dunia. Warisan yang ada 920 juta dan utang 210 juta. Yang ditinggalkan hanya istri dan anak perempuan. Bagaimana perhitungannya?",
    "Bapak saya wafat. Warisan 890 juta, dengan utang 180 juta. Kami hanya dua orang ahli waris. Bagaimana pembagian warisnya?",
    "Papah saya sudah wafat. Beliau mewariskan 880 juta, namun ada utang 190 juta. Yang ditinggalkan hanya Mama dan saya. Bagaimana cara membaginya?",
    "Ayah saya meninggal dan hanya meninggalkan saya dan Mamah. Warisan 870 juta dan utang 170 juta. Bagaimana pembagian warisnya?",
    "Bapak saya meninggal dunia. Warisan 910 juta dan utang 200 juta. Yang ditinggalkan hanya Mama dan satu anak perempuan. Bagaimana pembagiannya?",
    "Papah saya wafat. Beliau meninggalkan Mama saya dan saya sendiri. Warisan 850 juta dan utang 160 juta. Bagaimana pembagian yang tepat?",
    "Ayah saya wafat. Warisan 900 juta dan utang 190 juta. Kami hanya dua ahli waris: saya dan Mamah. Bagaimana pembagiannya?",
    "Bapak saya wafat, meninggalkan warisan sebesar 930 juta dan utang 210 juta. Pewaris hanya meninggalkan saya dan Mama. Bagaimana perhitungannya?",
    "Papah saya sudah tiada. Warisan 890 juta dan masih ada tanggungan utang 190 juta. Kami hanya dua ahli waris. Bagaimana cara membaginya?",
    "Ayah saya telah meninggal dunia, dan beliau hanya meninggalkan saya dan Mama. Warisan 910 juta, dengan utang 210 juta. Bagaimana pembagiannya?",
    "Papah saya wafat dan mewariskan harta 880 juta, namun masih ada utang sebesar 190 juta. Kami hanya dua ahli waris. Bagaimana pembagian warisnya?",
    "Bapak saya sudah tiada. Pewaris hanya meninggalkan Mamah dan satu anak perempuan. Warisan 860 juta dan utang 170 juta. Mohon bantuannya.",
    "Ayah saya wafat, hanya meninggalkan Mamah dan saya. Harta warisan sebesar 890 juta, dan masih ada utang 180 juta. Bagaimana perhitungan warisnya?",
    "Papa saya meninggal dunia. Beliau mewariskan 930 juta dan meninggalkan utang 220 juta. Pewaris hanya meninggalkan saya dan Mamah. Bagaimana pembagiannya?",
    "Ayah saya telah wafat. Warisan yang ditinggalkan 870 juta, tetapi ada hutang 160 juta. Yang ditinggalkan hanya Mama dan saya. Bagaimana seharusnya dibagi?",
    "Papah saya sudah tidak ada. Beliau meninggalkan saya dan Mamah saya, dengan warisan 900 juta dan utang 200 juta. Mohon perhitungan warisnya.",
    "Bapak saya meninggal. Kami yang ditinggalkan hanya Mama dan dua anak perempuan. Warisan 1,1 miliar, tapi ada utang 250 juta. Bagaimana pembagiannya?",
    "Ayah saya wafat, hanya menyisakan saya dan Mamah. Warisan 850 juta, namun ada tanggungan hutang 170 juta. Bagaimana pembagian yang sesuai?",
    "Papah saya meninggal dunia. Harta warisannya 890 juta, dan utangnya 190 juta. Kami ahli warisnya hanya saya dan Mama. Bagaimana cara membaginya?",
    "Ayah saya sudah tiada. Yang beliau tinggalkan hanya Mama saya dan saya sebagai anak perempuan tunggal. Warisan 880 juta dan utang 180 juta. Bagaimana pembagiannya?",
    "Papa saya wafat dan meninggalkan Mama serta dua anak perempuan. Warisan 1,2 miliar dan utang 300 juta. Mohon perhitungannya.",
    "Ayah saya wafat. Warisan yang ada sebesar 860 juta, dengan utang 160 juta. Pewaris hanya meninggalkan saya dan Mama. Bagaimana pembagian yang benar?",
    "Bapak saya telah meninggal dunia. Warisan yang tersisa 870 juta dan utang 170 juta. Kami hanya dua ahli waris. Bagaimana sebaiknya dibagi?",
    "Papah saya sudah tiada. Warisan 910 juta dan hutang 210 juta. Pewaris hanya meninggalkan Mamah dan saya. Bagaimana pembagiannya?",
    "Ayah saya wafat dan meninggalkan Mamah serta satu anak perempuan. Warisan 880 juta dan utang 180 juta. Bagaimana perhitungan warisnya?",
    "Bapak saya meninggal dunia, hanya meninggalkan Mama dan saya. Warisan 850 juta, namun ada utang 150 juta. Bagaimana cara pembagian yang adil?",
    "Papah saya sudah meninggal. Warisan yang ditinggalkan 890 juta dan utang 200 juta. Pewaris hanya memiliki istri dan satu anak perempuan. Bagaimana pembagiannya?",
    "Ayah saya wafat dan hanya meninggalkan Mamah dan saya. Warisan 860 juta dan utang 180 juta. Bagaimana pembagian yang sesuai hukum Islam?",
    "Papa saya sudah tidak ada. Beliau mewariskan harta sebesar 900 juta, tapi juga punya utang 210 juta. Kami hanya dua ahli waris. Mohon bantuannya.",
    "Bapak saya meninggal dan hanya menyisakan Mamah serta satu anak perempuan. Warisan 890 juta dan utang 200 juta. Bagaimana seharusnya dibagi?",
    "Ayah saya wafat, hanya menyisakan Mama dan saya. Warisan 910 juta dan utang 220 juta. Bagaimana pembagian warisnya?",
    "Papah saya sudah meninggal. Warisan 870 juta dan masih ada utang sebesar 190 juta. Kami hanya dua orang yang ditinggalkan. Bagaimana pembagiannya?",
    "Ayah saya wafat dan hanya meninggalkan saya dan Mamah. Warisan 880 juta dan utang 180 juta. Bagaimana sebaiknya dibagi?",
    "Bapak saya telah meninggal. Warisan 850 juta dan utang 170 juta. Yang ditinggalkan hanya istri dan satu anak perempuan. Mohon bantuannya.",
    "Papah saya meninggal dunia. Warisan yang tersisa 900 juta dan utang 200 juta. Kami hanya dua orang ahli waris. Bagaimana perhitungannya?",
    "Ayah saya wafat dan mewariskan harta 890 juta dengan tanggungan hutang 180 juta. Pewaris hanya memiliki saya dan Mama. Bagaimana pembagian warisnya?",
    "Papa saya sudah tidak ada. Warisan 930 juta dan utang 210 juta. Yang ditinggalkan hanya Mamah dan satu anak perempuan. Bagaimana pembagiannya?",
    "Ayah saya meninggal dunia, meninggalkan saya dan Mama. Warisan 880 juta dan utang 180 juta. Mohon penjelasan pembagian warisnya.",
    "Bapak saya wafat. Warisan 910 juta dan hutang 220 juta. Kami hanya dua orang ahli waris. Bagaimana cara membaginya?",
    "Papah saya sudah tiada. Beliau meninggalkan Mama dan saya, warisan 850 juta, dengan utang 160 juta. Mohon pembagian warisnya.",
    "Ayah saya wafat. Yang tersisa hanya Mamah dan saya. Warisan sebesar 900 juta dan utang 200 juta. Bagaimana pembagian yang sesuai?",
    "Papa saya meninggal dan hanya meninggalkan istri dan satu anak perempuan. Warisan 870 juta dan utang 180 juta. Bagaimana perhitungannya?",
    "Bapak saya telah meninggal dunia. Warisan 880 juta dan utang 190 juta. Kami hanya dua ahli waris: saya dan Mama. Bagaimana membaginya?",
    "Ayah saya sudah tidak ada. Warisan 850 juta dan utang 170 juta. Kami hanya dua orang ahli waris. Bagaimana perhitungan warisnya?",
    "Papah saya meninggal dan meninggalkan saya serta Mamah. Warisan 890 juta dan utang 190 juta. Bagaimana pembagiannya?",
    "Ayah saya wafat dan meninggalkan warisan 910 juta, tetapi masih ada hutang sebesar 210 juta. Kami yang ditinggalkan hanya saya dan Mamah. Bagaimana cara membaginya?",
    "Bapak saya meninggal dunia, hanya meninggalkan Mama saya dan saya sebagai satu-satunya anak perempuan. Warisan 860 juta dan utang 170 juta. Bagaimana pembagiannya?",
    "Papah saya wafat. Beliau mewariskan harta sebesar 900 juta dan punya utang 200 juta. Hanya saya dan Mama yang ditinggalkan. Mohon penjelasan warisnya.",
    "Ayah saya sudah tidak ada. Warisan yang ada 880 juta dan utang 180 juta. Yang ditinggalkan hanya Mama dan satu anak perempuan. Bagaimana sebaiknya dibagi?",
    "Papa saya sudah tiada. Warisan 870 juta dan utang 190 juta. Kami hanya dua orang ahli waris: saya dan Mama. Bagaimana pembagiannya?",
    "Ayah saya wafat, meninggalkan 890 juta dan masih ada utang 200 juta. Beliau hanya memiliki istri dan satu anak perempuan. Mohon bantuannya.",
    "Bapak saya sudah meninggal dunia. Warisan 930 juta, utang 220 juta. Kami yang ditinggalkan hanya Mama dan saya. Bagaimana cara membaginya?",
    "Papah saya sudah tidak ada. Harta yang ditinggalkan 860 juta dan utang 170 juta. Mohon bantuan untuk pembagian warisnya.",
    "Ayah saya wafat. Warisan 900 juta, utang 200 juta. Hanya ada Mama dan saya sebagai ahli waris. Bagaimana seharusnya dibagi?",
    "Papa saya meninggal dan meninggalkan saya dan Mama saya. Warisan 880 juta dan utang 180 juta. Mohon penjelasan warisnya.",
    "Ayah saya sudah tiada. Warisan 870 juta dan utang 170 juta. Pewaris hanya meninggalkan istri dan satu anak perempuan. Bagaimana perhitungannya?",
    "Bapak saya wafat dan meninggalkan harta sebesar 910 juta serta utang 210 juta. Kami hanya dua orang ahli waris. Bagaimana pembagiannya?",
    "Papah saya sudah tidak ada. Warisan 890 juta dan utang 190 juta. Pewaris hanya meninggalkan Mamah dan satu anak perempuan. Bagaimana pembagiannya?",
    "Ayah saya meninggal. Beliau mewariskan harta 850 juta dan masih punya utang 160 juta. Kami ahli warisnya hanya saya dan Mama. Bagaimana cara membaginya?"
  ]
}