{
  "texts": [
    "Suami saya telah meninggal dunia. Ia meninggalkan saya sebagai istrinya, dua putra kami, dan ibunda beliau yang masih hidup. Warisan beliau sebesar 450 juta rupiah. Mohon jelaskan pembagiannya.",
    "Almarhum suami saya wafat dan meninggalkan saya, tiga anak laki-laki, serta ibu kandungnya. Beliau mewariskan tabungan senilai 800 juta rupiah. Bagaimana pembagian warisnya?",
    "Suami saya wafat beberapa waktu lalu. Beliau meninggalkan saya sebagai istri sah, satu anak laki-laki, dan ibu beliau. Jumlah harta yang ditinggalkan adalah 600 juta. Mohon penjelasan pembagiannya.",
    "Suami saya telah tiada, dan ahli waris yang ditinggalkan adalah saya, dua anak laki-laki, serta ibunya. Warisan berupa uang tunai sebesar 700 juta rupiah. Bagaimana cara pembagiannya?",
    "Suami saya baru saja meninggal. Saya sebagai istrinya, bersama tiga anak laki-laki dan ibu beliau, menjadi ahli waris. Harta warisannya sekitar 1 miliar rupiah. Tolong jelaskan cara membaginya.",
    "Suami saya meninggal dunia, meninggalkan saya, ibu kandungnya, serta dua orang putra kami. Beliau meninggalkan tabungan sebesar 500 juta rupiah. Bagaimana pembagian waris menurut syariat?",
    "Suami saya wafat dan meninggalkan saya, anak laki-laki kami yang berjumlah empat orang, serta ibunya. Warisan sejumlah 950 juta rupiah tersedia. Mohon bantuannya untuk pembagiannya.",
    "Saya baru saja kehilangan suami saya. Beliau meninggalkan saya sebagai istri satu-satunya, bersama dua putra dan ibunya. Harta warisan yang tersisa sebesar 630 juta. Bagaimana cara membaginya?",
    "Suami saya telah berpulang ke rahmatullah. Beliau meninggalkan saya, satu anak laki-laki, serta ibunya. Warisannya berupa uang tabungan sejumlah 400 juta rupiah. Bagaimana sebaiknya dibagi?",
    "Suami saya meninggal, menyisakan warisan 720 juta rupiah. Kami yang ditinggalkan adalah saya, satu anak laki-laki, dan ibunda beliau. Tolong jelaskan pembagian waris sesuai syariat Islam.",
    "Suami saya wafat dan meninggalkan saya, dua anak laki-laki, serta ibu kandung beliau. Uang warisan berjumlah 840 juta rupiah. Bagaimana pembagian yang tepat?",
    "Suami saya meninggal dunia. Beliau meninggalkan saya, anak laki-laki kami yang berjumlah tiga orang, serta ibunya. Terdapat harta sebesar 1,2 miliar. Bagaimana cara pembagian yang sesuai?",
    "Suami saya telah tiada. Saya sebagai istri, bersama dua anak laki-laki dan ibu beliau, menjadi ahli waris. Warisan berupa tabungan senilai 910 juta rupiah. Tolong bantu perhitungannya.",
    "Suami saya berpulang dan meninggalkan saya, satu anak laki-laki, serta ibunya. Harta warisnya mencapai 580 juta rupiah. Bagaimana kami harus membaginya?",
    "Almarhum suami saya meninggalkan saya, anak laki-laki satu orang, dan ibunya. Jumlah harta warisan 400 juta rupiah. Mohon dijelaskan pembagian warisnya.",
    "Suami saya telah wafat, ahli warisnya terdiri dari saya, ibu beliau, dan dua orang putra kami. Warisan berupa tabungan 670 juta rupiah. Bagaimana cara pembagian yang benar?",
    "Suami saya telah meninggal dunia dan meninggalkan warisan sebesar 890 juta rupiah. Kami yang ditinggalkan adalah saya, dua anak laki-laki, dan ibunda beliau. Mohon hitungan warisnya.",
    "Saya ditinggal wafat oleh suami. Beliau meninggalkan saya sebagai istrinya, dua putra kami, dan ibu kandung beliau. Warisan yang tersedia 760 juta rupiah. Tolong jelaskan pembagiannya.",
    "Suami saya meninggal dan mewariskan uang sebesar 1 miliar. Ahli waris yang ada adalah saya, satu anak laki-laki, dan ibunya. Bagaimana cara pembagian yang sesuai?",
    "Suami saya berpulang, meninggalkan saya sebagai istrinya, satu anak laki-laki, serta ibu beliau. Tersisa harta warisan sebesar 420 juta rupiah. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia. Warisan beliau sebesar 770 juta rupiah akan dibagikan kepada saya, anak laki-laki kami, dan ibu beliau. Mohon bantu pembagian warisnya.",
    "Suami saya wafat dan meninggalkan warisan senilai 500 juta rupiah. Saya sebagai istrinya, ibu beliau, dan satu anak laki-laki adalah ahli waris. Tolong bantu perhitungannya.",
    "Saya baru saja kehilangan suami. Beliau meninggalkan saya, tiga anak laki-laki kami, serta ibunya. Tabungan beliau mencapai 900 juta rupiah. Bagaimana pembagiannya?",
    "Suami saya meninggal dan kami yang ditinggalkan adalah saya, dua putra, dan ibunda beliau. Uang warisan sebesar 640 juta rupiah. Tolong bantu pembagiannya.",
    "Suami saya wafat, meninggalkan saya dan anak laki-laki kami dua orang, serta ibunya yang masih hidup. Warisan berupa uang tunai 710 juta. Bagaimana pembagiannya?",
    "Saya kehilangan suami saya. Beliau meninggalkan warisan 580 juta untuk saya, dua anak laki-laki, dan ibunya. Bagaimana pembagian warisnya?",
    "Suami saya berpulang ke rahmatullah, meninggalkan saya, dua anak laki-laki, dan ibunya. Kami mendapat warisan uang sebesar 830 juta rupiah. Bagaimana hitungan pembagiannya?",
    "Suami saya meninggal dunia, dan meninggalkan saya sebagai istrinya, ibu beliau, dan satu anak laki-laki. Warisan sebesar 600 juta. Mohon bantuannya untuk pembagian.",
    "Suami saya telah wafat. Beliau meninggalkan saya, ibu beliau yang masih hidup, dan tiga anak laki-laki. Warisan sejumlah 1,1 miliar rupiah. Tolong bantu hitungannya.",
    "Suami saya wafat dan meninggalkan warisan berupa uang tunai sebesar 730 juta rupiah. Saya, satu anak laki-laki, dan ibunya menjadi ahli waris. Bagaimana pembagiannya?",
    "Suami saya meninggal, ahli warisnya saya sebagai istri, dua anak laki-laki, dan ibunda beliau. Uang warisan sejumlah 920 juta rupiah. Bagaimana pembagian sesuai hukum Islam?",
    "Suami saya telah tiada. Beliau meninggalkan saya, satu anak laki-laki, dan ibunya. Kami menerima warisan sebesar 470 juta. Bagaimana seharusnya dibagi?",
    "Saya baru kehilangan suami saya. Ia meninggalkan saya, dua anak laki-laki, dan ibunya. Warisan yang ada sekitar 860 juta rupiah. Tolong jelaskan pembagiannya.",
    "Suami saya meninggal dunia, meninggalkan saya sebagai istri, dua putra, dan ibu kandungnya. Harta yang ditinggalkan mencapai 790 juta rupiah. Bagaimana pembagian yang benar?",
    "Suami saya wafat dan meninggalkan saya, ibu kandung beliau, dan seorang anak laki-laki. Harta warisan 540 juta rupiah. Bagaimana pembagiannya secara syariah?",
    "Suami saya berpulang, dan ahli warisnya adalah saya, dua anak laki-laki kami, dan ibu beliau. Jumlah warisan 970 juta rupiah. Bagaimana cara pembagiannya?",
    "Suami saya meninggal dan meninggalkan saya, satu anak laki-laki, serta ibunya. Warisan berupa uang sebesar 510 juta rupiah. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan saya, ibu beliau, dan tiga anak laki-laki kami. Harta yang tersedia sejumlah 880 juta rupiah. Tolong bantu hitung pembagiannya.",
    "Saya kehilangan suami, beliau meninggalkan saya, satu anak laki-laki, dan ibunya. Warisan berupa uang tunai senilai 620 juta rupiah. Bagaimana seharusnya dibagi?",
    "Suami saya wafat dan meninggalkan saya sebagai istri, dua putra kami, serta ibunya yang masih hidup. Uang warisan sebesar 700 juta. Bagaimana pembagian yang sesuai?",
    "Suami saya telah tiada. Ia meninggalkan saya, satu anak laki-laki, dan ibunya. Kami menerima harta warisan senilai 400 juta. Bagaimana cara membaginya?",
    "Suami saya wafat dan ahli warisnya adalah saya, dua anak laki-laki, serta ibu beliau. Warisan yang ada mencapai 990 juta rupiah. Tolong jelaskan pembagiannya.",
    "Suami saya berpulang, meninggalkan saya, ibu kandungnya, dan satu anak laki-laki kami. Harta warisan sebesar 550 juta rupiah. Bagaimana pembagian menurut syariat?",
    "Suami saya wafat. Kami yang ditinggalkan adalah saya, ibu beliau, serta dua anak laki-laki. Jumlah warisan 860 juta. Tolong bantu perhitungannya.",
    "Suami saya telah tiada. Beliau meninggalkan saya, tiga anak laki-laki, dan ibunya. Uang warisan sebesar 1 miliar rupiah. Bagaimana pembagian menurut hukum Islam?",
    "Suami saya meninggal dunia, ahli warisnya adalah saya sebagai istri, dua anak laki-laki, dan ibunya. Warisan senilai 670 juta. Mohon bantu hitung pembagiannya.",
    "Saya kehilangan suami saya. Ia meninggalkan saya, ibu beliau, dan satu anak laki-laki. Warisan berupa tabungan 490 juta. Bagaimana pembagian warisnya?",
    "Suami saya wafat, meninggalkan saya sebagai istrinya, dua anak laki-laki, serta ibu beliau. Uang warisan sekitar 750 juta rupiah. Bagaimana pembagiannya?",
    "Suami saya meninggal dan meninggalkan saya, ibu kandungnya, serta satu anak laki-laki. Harta warisan sebesar 610 juta rupiah. Tolong bantu hitungannya.",
    "Suami saya meninggal dunia. Ahli waris yang tersisa adalah saya, satu anak laki-laki, dan ibu beliau. Warisan sebesar 530 juta rupiah. Bagaimana cara pembagian yang benar?",
    "Suami saya meninggal dunia. Beliau meninggalkan saya sebagai istrinya, dua anak lelaki kami, serta ibunda beliau yang masih hidup. Total harta yang ditinggalkan adalah 700 juta rupiah. Bagaimana seharusnya warisan itu dibagikan?",
    "Telah wafat suami saya beberapa waktu lalu. Beliau meninggalkan saya, tiga putra kami, dan ibunya yang sudah sepuh. Kami memiliki warisan tunai sekitar 1,2 miliar. Bagaimana pembagian menurut hukum waris Islam?",
    "Almarhum suami saya meninggalkan saya sebagai istri sahnya, seorang anak laki-laki, serta ibunya. Kami menerima warisan berupa uang tabungan sebesar 560 juta rupiah. Mohon dijelaskan pembagiannya.",
    "Suami saya berpulang, menyisakan saya sebagai satu-satunya istri, dua anak lelaki, dan ibu kandung beliau. Warisan yang ditinggalkan mencapai 900 juta. Bagaimana perhitungannya?",
    "Suami saya wafat secara mendadak. Yang ditinggalkan beliau ialah saya, tiga anak laki-laki, dan ibunda beliau. Kami mendapati warisan tunai sebesar 800 juta rupiah. Bagaimana aturan bagi-bagi warisnya?",
    "Suami saya meninggal dunia dan meninggalkan saya, dua anak laki-laki, serta ibu beliau yang masih hidup. Warisan berupa uang sebesar 1 miliar. Tolong bantu rincikan pembagiannya.",
    "Setelah suami saya berpulang, saya sebagai istrinya, dua anak lelaki, dan ibunya masih hidup. Warisan tunai berjumlah 620 juta rupiah. Bagaimana cara membaginya?",
    "Suami saya telah tiada. Beliau meninggalkan saya, seorang anak laki-laki, dan ibunya yang sudah tua. Ada warisan berupa uang sebesar 400 juta. Bagaimana pembagian sesuai hukum Islam?",
    "Telah meninggal suami saya dan meninggalkan saya sebagai istri, empat anak laki-laki, serta ibunya. Kami menerima warisan berupa tabungan 1,5 miliar. Bagaimana hak masing-masing?",
    "Suami saya wafat dan meninggalkan saya sebagai istri, satu anak laki-laki kami, serta ibunya. Harta warisan berupa uang tunai mencapai 750 juta. Bagaimana sebaiknya dibagi?",
    "Saya kehilangan suami saya. Ia meninggalkan saya, tiga anak laki-laki kami, dan ibunya. Warisan berupa uang tunai sebesar 1,3 miliar. Mohon penjelasan pembagiannya.",
    "Suami saya meninggal dan meninggalkan saya, dua anak laki-laki kami, serta ibunya. Harta yang ditinggalkan senilai 900 juta rupiah. Bagaimana warisannya dibagi?",
    "Almarhum suami saya meninggalkan saya sebagai istrinya, dua anak laki-laki, dan ibu kandungnya. Warisan berupa uang sebesar 600 juta rupiah. Bagaimana perhitungannya?",
    "Suami saya berpulang dan meninggalkan saya, anak laki-laki kami satu orang, dan ibu beliau. Kami mendapatkan harta sebesar 500 juta. Bagaimana seharusnya dibagikan?",
    "Suami saya wafat, meninggalkan saya seorang istri, tiga anak laki-laki, dan ibunya. Kami memperoleh warisan 820 juta. Bagaimana pembagian berdasarkan syariat?",
    "Saya baru saja ditinggalkan suami saya. Beliau meninggalkan saya, dua anak laki-laki, serta ibu beliau. Kami menerima warisan tunai senilai 950 juta. Bagaimana bagian kami masing-masing?",
    "Suami saya sudah meninggal. Ia meninggalkan saya sebagai istri, empat anak laki-laki, dan ibunya. Kami mendapati warisan senilai 1,2 miliar. Bagaimana cara membaginya?",
    "Suami saya wafat dan meninggalkan saya, tiga anak laki-laki, serta ibunda beliau. Kami mendapatkan harta sebesar 1 miliar. Tolong bantu rincian pembagiannya.",
    "Suami saya telah tiada, dan ia meninggalkan saya, dua putra, serta ibu kandung beliau. Warisan mencapai 800 juta rupiah. Bagaimana perhitungan pembagiannya?",
    "Setelah kepergian suami saya, saya sebagai istri, dua anak lelaki, dan ibu beliau masih hidup. Harta yang ditinggalkan sebesar 700 juta. Bagaimana pembagian menurut Islam?",
    "Suami saya meninggal dan mewariskan kepada saya, tiga anak laki-laki kami, serta ibunya. Nilai warisan uang tunai mencapai 950 juta. Bagaimana bagian masing-masing?",
    "Saya ditinggal suami saya. Beliau meninggalkan saya, seorang anak laki-laki, dan ibu beliau. Kami mendapat warisan 580 juta rupiah. Mohon bantuannya membagi secara syar’i.",
    "Telah wafat suami saya, dengan meninggalkan saya sebagai istri, dua anak laki-laki kami, serta ibu beliau. Kami memperoleh warisan sebesar 840 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal. Ia meninggalkan saya, tiga anak laki-laki, serta ibu beliau yang masih hidup. Kami memiliki warisan tunai sebesar 920 juta. Bagaimana dibagikan?",
    "Suami saya wafat dan mewariskan kepada saya, dua anak lelaki, serta ibunya. Harta yang tersisa sebesar 630 juta. Mohon penjelasan pembagian warisnya.",
    "Saya sebagai istri ditinggal wafat suami saya. Ia meninggalkan saya, empat anak laki-laki kami, dan ibunya. Warisan tunai sejumlah 1,4 miliar. Bagaimana seharusnya dibagi?",
    "Suami saya berpulang ke rahmatullah. Beliau meninggalkan saya, dua anak laki-laki, dan ibunya yang lanjut usia. Warisan kami berupa uang tunai 720 juta. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan saya, seorang anak laki-laki, dan ibu kandungnya. Uang warisan yang tersisa sebesar 500 juta. Mohon bantuannya menjelaskan pembagian.",
    "Almarhum suami saya meninggalkan saya sebagai istri, tiga anak laki-laki, dan ibunya. Kami memiliki warisan berupa tabungan 1,1 miliar rupiah. Bagaimana bagian masing-masing ahli waris?",
    "Suami saya telah meninggal dan meninggalkan saya, dua anak laki-laki kami, serta ibunya. Kami memiliki harta warisan senilai 870 juta. Bagaimana pembagiannya?",
    "Suami saya wafat dan meninggalkan saya sebagai istri satu-satunya, tiga anak laki-laki, dan ibu beliau. Warisan berupa uang 980 juta rupiah. Bagaimana cara pembagiannya?",
    "Saya baru saja ditinggal wafat suami saya. Beliau meninggalkan saya, dua anak lelaki, serta ibunya. Warisan yang ada berupa tabungan senilai 640 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia. Saya sebagai istri, dua anak laki-laki, dan ibu beliau yang masih hidup menjadi ahli warisnya. Warisan berjumlah 790 juta. Mohon rincian pembagiannya.",
    "Setelah suami saya tiada, beliau meninggalkan saya, satu anak laki-laki, dan ibunya. Harta warisan yang tersisa adalah 520 juta rupiah. Bagaimana seharusnya dibagikan?",
    "Suami saya wafat, dan meninggalkan saya, dua anak lelaki, serta ibunya. Kami menerima warisan sebesar 600 juta. Tolong jelaskan pembagian yang tepat.",
    "Suami saya meninggal. Warisannya berupa uang tunai sebesar 880 juta. Ia meninggalkan saya sebagai istri, dua anak laki-laki, dan ibunya. Bagaimana rincian pembagiannya?",
    "Suami saya berpulang dan meninggalkan saya, tiga anak laki-laki kami, dan ibu kandung beliau. Kami memiliki warisan berupa tabungan 1,25 miliar. Bagaimana cara membaginya?",
    "Saya kehilangan suami saya. Ia meninggalkan saya, dua putra kami, dan ibu beliau. Warisan berupa uang tunai 900 juta. Bagaimana hak masing-masing dari kami?",
    "Suami saya meninggal dunia. Ia meninggalkan saya sebagai istri, tiga anak laki-laki, dan ibu beliau. Uang warisan yang tersedia 1 miliar. Mohon jelaskan pembagiannya.",
    "Suami saya wafat dan meninggalkan saya, dua anak laki-laki kami, serta ibunya. Warisan berjumlah 850 juta. Bagaimana pembagian sesuai hukum waris Islam?",
    "Suami saya telah berpulang. Saya ditinggalkan bersama tiga anak laki-laki kami dan ibu beliau. Kami memiliki warisan 970 juta rupiah. Bagaimana bagian masing-masing?",
    "Suami saya meninggal dan meninggalkan saya, dua anak laki-laki, serta ibunya. Warisan berupa uang tunai 600 juta. Bagaimana pembagiannya secara adil?",
    "Suami saya telah tiada dan meninggalkan saya sebagai istri, dua anak laki-laki kami, serta ibu beliau. Harta yang tersisa mencapai 740 juta. Mohon bantuannya membagi warisan.",
    "Setelah kepergian suami saya, beliau meninggalkan saya, tiga anak laki-laki, dan ibunya. Warisan kami berupa tabungan sebesar 1,3 miliar. Bagaimana perhitungannya?",
    "Suami saya wafat dan mewariskan kepada saya sebagai istri, dua anak laki-laki, serta ibunya. Warisan berupa uang tunai senilai 870 juta. Bagaimana pembagiannya?",
    "Suami saya berpulang dan meninggalkan saya sebagai istri, tiga anak lelaki kami, dan ibu beliau. Kami menerima warisan sebesar 1,1 miliar rupiah. Tolong dijelaskan pembagiannya.",
    "Saya baru saja kehilangan suami saya. Ia meninggalkan saya, satu anak laki-laki, dan ibunya. Kami memperoleh warisan sebesar 550 juta. Bagaimana perhitungannya?",
    "Suami saya wafat dan meninggalkan saya, dua anak laki-laki kami, serta ibu kandung beliau. Warisan berupa uang tunai 720 juta. Mohon rincian pembagiannya.",
    "Suami saya meninggal dan meninggalkan saya, tiga anak laki-laki, serta ibunya. Kami memiliki warisan tunai 880 juta rupiah. Bagaimana pembagiannya sesuai syariat?",
    "Setelah suami saya wafat, ia meninggalkan saya sebagai istri satu-satunya, dua anak laki-laki, dan ibunya. Kami menerima warisan berupa tabungan sebesar 910 juta. Mohon penjelasan pembagian warisnya."
  ]
}