{
  "texts": [
    "Suami saya wafat, meninggalkan saya sebagai istri, dua anak perempuan, serta ayah dan ibunya. Harta yang ditinggalkan mencapai 320 juta rupiah.",
    "Saya baru saja menjadi janda setelah suami berpulang, dengan ahli waris saya sendiri, seorang anak perempuan, serta kedua orang tuanya yang masih hidup. Nilai peninggalannya sebesar 410 juta rupiah.",
    "Suami saya meninggal dunia, menyisakan saya sebagai istri, tiga anak perempuan, dan ayah serta ibu beliau. Warisan yang ada sejumlah 275 juta rupiah.",
    "Dalam duka, saya kehilangan suami, yang meninggalkan saya, satu anak perempuan, serta kedua orang tuanya. Harta warisan berjumlah 380 juta rupiah.",
    "Suami tercinta berpulang, ahli warisnya adalah saya, dua anak perempuan, dan orang tua beliau (ayah dan ibu). Peninggalan beliau senilai 495 juta rupiah.",
    "Suami saya meninggal, meninggalkan saya sebagai istri, satu anak perempuan, dan ayah serta ibu kandungnya. Warisan sebesar 330 juta rupiah.",
    "Saya ditinggal wafat suami, ahli waris terdiri dari saya, tiga anak perempuan, dan kedua orang tua beliau. Total peninggalan 420 juta rupiah.",
    "Suami saya berpulang, meninggalkan saya, dua anak perempuan, serta ayah dan ibu beliau. Warisan bernilai 375 juta rupiah.",
    "Kehilangan suami membuat saya menjadi janda, ahli warisnya adalah saya sendiri, satu anak perempuan, serta kedua orang tua beliau. Total harta warisan 295 juta rupiah.",
    "Suami saya telah tiada, meninggalkan saya, tiga anak perempuan, dan ayah serta ibu beliau. Nilai peninggalan mencapai 485 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya adalah saya, dua anak perempuan, serta kedua orang tuanya. Warisan sebesar 440 juta rupiah.",
    "Suami wafat meninggalkan saya, satu anak perempuan, dan ayah serta ibu beliau. Harta warisan berjumlah 325 juta rupiah.",
    "Saya ditinggalkan suami untuk selamanya, ahli warisnya saya sendiri, dua anak perempuan, dan kedua orang tua beliau. Peninggalan senilai 400 juta rupiah.",
    "Suami saya berpulang ke rahmatullah, meninggalkan saya, tiga anak perempuan, serta ayah dan ibunya. Harta warisan senilai 350 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya adalah saya, satu anak perempuan, dan kedua orang tua beliau. Total harta peninggalan 270 juta rupiah.",
    "Saya menjadi janda karena suami meninggal, menyisakan saya, dua anak perempuan, serta ayah dan ibunya. Warisan mencapai 490 juta rupiah.",
    "Suami tercinta telah tiada, ahli warisnya saya, tiga anak perempuan, dan kedua orang tua beliau. Nilai peninggalan 310 juta rupiah.",
    "Saya ditinggal wafat suami, meninggalkan saya, satu anak perempuan, dan ayah serta ibu kandungnya. Warisan sebesar 455 juta rupiah.",
    "Suami saya meninggal, ahli warisnya saya, dua anak perempuan, dan kedua orang tuanya. Total peninggalan 345 juta rupiah.",
    "Dalam kesedihan, saya kehilangan suami, yang meninggalkan saya, tiga anak perempuan, dan ayah serta ibu beliau. Harta warisan senilai 390 juta rupiah.",
    "Suami wafat meninggalkan saya, satu anak perempuan, dan kedua orang tuanya. Peninggalan sebesar 280 juta rupiah.",
    "Saya ditinggal suami untuk selama-lamanya, ahli waris terdiri dari saya, dua anak perempuan, dan ayah serta ibu beliau. Harta mencapai 460 juta rupiah.",
    "Suami saya berpulang, ahli warisnya adalah saya, tiga anak perempuan, dan kedua orang tuanya. Warisan 350 juta rupiah.",
    "Saya kehilangan suami, meninggalkan saya, satu anak perempuan, dan ayah serta ibu kandungnya. Nilai peninggalan 370 juta rupiah.",
    "Suami saya meninggal, ahli waris terdiri dari saya, dua anak perempuan, dan kedua orang tua beliau. Warisan sebesar 325 juta rupiah.",
    "Saya menjadi janda setelah suami wafat, menyisakan saya, tiga anak perempuan, dan kedua orang tuanya. Peninggalan senilai 485 juta rupiah.",
    "Suami saya telah pergi, ahli warisnya saya, satu anak perempuan, dan ayah serta ibu beliau. Harta 310 juta rupiah.",
    "Suami tercinta wafat, meninggalkan saya, dua anak perempuan, dan kedua orang tuanya. Warisan bernilai 450 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya adalah saya, tiga anak perempuan, serta ayah dan ibunya. Nilai peninggalan 290 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan saya, satu anak perempuan, dan kedua orang tuanya. Warisan sebesar 395 juta rupiah.",
    "Saya ditinggal wafat suami, ahli waris terdiri dari saya, dua anak perempuan, dan ayah serta ibu beliau. Peninggalan senilai 480 juta rupiah.",
    "Suami saya berpulang, meninggalkan saya, tiga anak perempuan, dan kedua orang tuanya. Harta sebesar 340 juta rupiah.",
    "Suami wafat meninggalkan saya, satu anak perempuan, dan ayah serta ibu kandungnya. Warisan berjumlah 300 juta rupiah.",
    "Saya menjadi janda karena suami meninggal, ahli warisnya saya, dua anak perempuan, dan kedua orang tua beliau. Nilai peninggalan 420 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, tiga anak perempuan, dan ayah serta ibu beliau. Warisan mencapai 360 juta rupiah.",
    "Saya ditinggal suami, meninggalkan saya, satu anak perempuan, dan kedua orang tuanya. Peninggalan senilai 445 juta rupiah.",
    "Suami saya wafat, ahli warisnya saya, dua anak perempuan, dan ayah serta ibu beliau. Harta sebesar 310 juta rupiah.",
    "Saya kehilangan suami, meninggalkan saya, tiga anak perempuan, dan kedua orang tuanya. Warisan senilai 385 juta rupiah.",
    "Suami saya berpulang, ahli warisnya saya, satu anak perempuan, dan kedua orang tua beliau. Nilai peninggalan 355 juta rupiah.",
    "Saya menjadi janda setelah suami wafat, meninggalkan saya, dua anak perempuan, dan ayah serta ibunya. Warisan 470 juta rupiah.",
    "Suami wafat, ahli warisnya saya, tiga anak perempuan, dan kedua orang tua beliau. Harta sebesar 295 juta rupiah.",
    "Saya kehilangan suami, meninggalkan saya, satu anak perempuan, dan kedua orang tuanya. Warisan berjumlah 340 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, dua anak perempuan, dan ayah serta ibunya. Nilai peninggalan 490 juta rupiah.",
    "Saya ditinggal wafat suami, meninggalkan saya, tiga anak perempuan, dan kedua orang tuanya. Harta sebesar 315 juta rupiah.",
    "Suami saya wafat, ahli warisnya saya, satu anak perempuan, dan kedua orang tua beliau. Peninggalan 405 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal, ahli warisnya saya, dua anak perempuan, dan ayah serta ibunya. Warisan senilai 375 juta rupiah.",
    "Suami tercinta telah tiada, meninggalkan saya, tiga anak perempuan, dan kedua orang tuanya. Nilai peninggalan 285 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya saya, satu anak perempuan, dan ayah serta ibu beliau. Harta 390 juta rupiah.",
    "Suami saya meninggal, meninggalkan saya, dua anak perempuan, dan kedua orang tua beliau. Warisan senilai 325 juta rupiah.",
    "Saya ditinggal wafat suami, ahli warisnya saya, tiga anak perempuan, dan ayah serta ibunya. Peninggalan sebesar 455 juta rupiah.",
    "Setelah kepergian suami saya, beliau meninggalkan saya, dua anak perempuan, serta kedua orang tuanya. Harta peninggalan mencapai 220 juta rupiah.",
    "Suami wafat, meninggalkan istri, tiga putri, ayah, dan ibu kandungnya. Nilai peninggalan sebesar 340 juta rupiah.",
    "Saya kini janda, suami berpulang meninggalkan dua anak perempuan, ayah dan ibu, serta saya. Peninggalan sejumlah 410 juta rupiah.",
    "Kehilangan besar bagi kami, suami pergi meninggalkan saya, empat anak perempuan, dan kedua orang tua beliau. Harta tersisa senilai 370 juta rupiah.",
    "Suami tercinta meninggalkan saya, satu anak perempuan, dan kedua orang tuanya. Warisan berupa uang tunai 190 juta rupiah.",
    "Seusai wafatnya suami, beliau meninggalkan istri, dua anak perempuan, serta ayah dan ibunya. Total peninggalan 330 juta rupiah.",
    "Saya sebagai istri ditinggal suami yang wafat, bersama satu putri, ayah, dan ibu beliau. Harta yang ada berjumlah 250 juta rupiah.",
    "Suami meninggalkan saya, tiga anak perempuan, serta kedua orang tuanya. Nilai peninggalan sebesar 460 juta rupiah.",
    "Setelah suami wafat, beliau meninggalkan saya, empat putri, dan kedua orang tua beliau. Harta peninggalan senilai 390 juta rupiah.",
    "Saya ditinggalkan suami yang wafat, bersama satu anak perempuan, ayah, dan ibu kandungnya. Peninggalan 210 juta rupiah.",
    "Suami pergi untuk selamanya, meninggalkan saya, dua anak perempuan, serta kedua orang tuanya. Warisan berjumlah 280 juta rupiah.",
    "Kehilangan suami, beliau meninggalkan istri, tiga anak perempuan, ayah, dan ibunya. Harta peninggalan 350 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, empat anak perempuan, serta kedua orang tua beliau. Peninggalan berupa uang 400 juta rupiah.",
    "Seusai kepergian suami, beliau meninggalkan istri, satu putri, dan kedua orang tuanya. Harta senilai 180 juta rupiah.",
    "Saya kini janda, suami wafat meninggalkan dua anak perempuan, ayah, dan ibunya. Nilai peninggalan 320 juta rupiah.",
    "Suami tercinta pergi, meninggalkan saya, tiga putri, dan kedua orang tuanya. Harta warisan 370 juta rupiah.",
    "Saya kehilangan suami, yang meninggalkan saya, empat anak perempuan, serta ayah dan ibu beliau. Peninggalan 420 juta rupiah.",
    "Suami wafat, meninggalkan istri, satu putri, dan kedua orang tuanya. Harta tersisa senilai 230 juta rupiah.",
    "Seusai wafatnya suami, beliau meninggalkan saya, dua anak perempuan, serta ayah dan ibu. Warisan sebesar 310 juta rupiah.",
    "Suami saya meninggalkan saya, tiga anak perempuan, dan kedua orang tuanya. Harta peninggalan senilai 350 juta rupiah.",
    "Kehilangan suami, beliau meninggalkan istri, empat anak perempuan, serta kedua orang tuanya. Peninggalan sebesar 440 juta rupiah.",
    "Saya sebagai istri ditinggalkan suami, bersama satu putri, ayah, dan ibu beliau. Harta senilai 200 juta rupiah.",
    "Setelah suami wafat, beliau meninggalkan saya, dua anak perempuan, dan kedua orang tuanya. Peninggalan 300 juta rupiah.",
    "Suami meninggalkan saya, tiga putri, serta ayah dan ibunya. Nilai harta sebesar 370 juta rupiah.",
    "Saya kini janda, suami pergi meninggalkan empat anak perempuan, ayah, dan ibu beliau. Peninggalan senilai 430 juta rupiah.",
    "Suami wafat, meninggalkan saya, satu anak perempuan, serta kedua orang tuanya. Harta 210 juta rupiah.",
    "Seusai kepergian suami, beliau meninggalkan istri, dua putri, dan kedua orang tuanya. Warisan 290 juta rupiah.",
    "Kehilangan suami, beliau meninggalkan saya, tiga anak perempuan, serta ayah dan ibunya. Harta peninggalan 360 juta rupiah.",
    "Saya kehilangan suami, meninggalkan empat putri, ayah, dan ibu beliau. Warisan senilai 410 juta rupiah.",
    "Suami meninggalkan saya, satu putri, dan kedua orang tuanya. Peninggalan 190 juta rupiah.",
    "Seusai wafatnya suami, beliau meninggalkan istri, dua anak perempuan, serta kedua orang tuanya. Harta sebesar 280 juta rupiah.",
    "Saya kini janda, suami wafat meninggalkan tiga anak perempuan, ayah, dan ibu. Nilai warisan 350 juta rupiah.",
    "Suami tercinta pergi, meninggalkan saya, empat anak perempuan, serta kedua orang tuanya. Harta 420 juta rupiah.",
    "Saya kehilangan suami, beliau meninggalkan satu putri, ayah, dan ibunya. Peninggalan senilai 200 juta rupiah.",
    "Seusai kepergian suami, beliau meninggalkan istri, dua anak perempuan, dan kedua orang tuanya. Harta 310 juta rupiah.",
    "Suami saya meninggalkan saya, tiga putri, serta kedua orang tuanya. Nilai peninggalan sebesar 360 juta rupiah.",
    "Kehilangan suami, beliau meninggalkan istri, empat anak perempuan, ayah, dan ibunya. Peninggalan 450 juta rupiah.",
    "Suami wafat, meninggalkan saya, satu anak perempuan, serta kedua orang tuanya. Warisan senilai 220 juta rupiah.",
    "Seusai wafatnya suami, beliau meninggalkan saya, dua anak perempuan, dan kedua orang tuanya. Harta peninggalan 300 juta rupiah.",
    "Suami meninggalkan saya, tiga putri, ayah, dan ibunya. Harta senilai 370 juta rupiah.",
    "Saya kini janda, suami pergi meninggalkan empat anak perempuan, serta kedua orang tuanya. Peninggalan 410 juta rupiah.",
    "Kehilangan suami, beliau meninggalkan istri, satu putri, dan kedua orang tuanya. Warisan sebesar 210 juta rupiah.",
    "Seusai kepergian suami, beliau meninggalkan saya, dua anak perempuan, serta kedua orang tuanya. Harta 290 juta rupiah.",
    "Suami saya meninggalkan saya, tiga putri, ayah, dan ibunya. Nilai peninggalan 350 juta rupiah.",
    "Saya kehilangan suami, meninggalkan empat anak perempuan, serta kedua orang tuanya. Harta warisan 430 juta rupiah.",
    "Suami wafat, meninggalkan saya, satu anak perempuan, ayah, dan ibunya. Peninggalan sebesar 200 juta rupiah.",
    "Seusai wafatnya suami, beliau meninggalkan istri, dua anak perempuan, serta kedua orang tuanya. Harta 310 juta rupiah.",
    "Suami saya meninggalkan saya, tiga putri, ayah, dan ibunya. Warisan senilai 360 juta rupiah.",
    "Kehilangan suami, beliau meninggalkan istri, empat anak perempuan, serta kedua orang tuanya. Peninggalan 420 juta rupiah.",
    "Saya kini janda, suami pergi meninggalkan satu anak perempuan, ayah, dan ibunya. Nilai harta sebesar 190 juta rupiah."
  ]
}