{
  "texts": [
    "Suami saya meninggal dunia. Beliau memiliki dua istri, termasuk saya, serta tiga anak laki-laki dan satu anak perempuan. Warisan beliau sebesar 1 miliar rupiah. Bagaimana pembagiannya?",
    "Saya salah satu dari tiga istri almarhum. Kami dikaruniai dua anak laki-laki dan dua anak perempuan. Warisan beliau berupa tabungan 950 juta. Bagaimana pembagiannya tanpa hutang?",
    "Suami saya wafat dan meninggalkan empat istri. Kami memiliki tiga anak laki-laki dan satu anak perempuan. Warisan mencapai 1,2 miliar. Bagaimana kami membaginya?",
    "Setelah suami saya wafat, saya bersama dua istri lainnya dan dua anak laki-laki serta dua anak perempuan mewarisi uang 1 miliar. Bagaimana pembagian yang sesuai syariat?",
    "Saya istri kedua dari suami yang baru saja meninggal. Ia meninggalkan tiga anak laki-laki dan dua anak perempuan. Warisan sebesar 1,1 miliar rupiah. Bagaimana cara membaginya?",
    "Suami saya meninggal tanpa meninggalkan hutang. Beliau memiliki tiga istri, termasuk saya, serta dua anak laki-laki dan satu anak perempuan. Warisan 850 juta. Bagaimana pembagiannya?",
    "Kami empat istri dari almarhum. Ia meninggalkan warisan 1,3 miliar dan memiliki dua anak laki-laki serta dua anak perempuan. Bagaimana kami harus membaginya?",
    "Saya istri sah ketiga dari suami yang wafat. Anak kami ada satu laki-laki dan dua perempuan. Beliau meninggalkan tabungan 700 juta rupiah. Bagaimana pembagian warisnya?",
    "Setelah kepergian suami saya, kami bertiga sebagai istri dan anak-anak (tiga laki-laki dan dua perempuan) menerima warisan 1 miliar. Bagaimana pembagiannya menurut Islam?",
    "Saya istri pertama. Suami saya meninggal dunia dan memiliki dua anak laki-laki serta satu anak perempuan dari kami para istrinya. Warisan 900 juta rupiah. Mohon penjelasan pembagiannya.",
    "Suami saya meninggalkan kami empat istri dan dua anak laki-laki. Warisan yang tersisa sebesar 850 juta rupiah. Bagaimana cara membaginya sesuai syariat?",
    "Saya istri kedua almarhum. Ia meninggalkan tiga anak laki-laki dan satu anak perempuan. Tidak ada utang, dan warisan 1 miliar. Bagaimana sebaiknya dibagi?",
    "Suami saya wafat. Kami tiga istri ditinggalkan bersama dua anak laki-laki dan dua anak perempuan. Warisan sebesar 950 juta rupiah. Bagaimana perhitungan warisnya?",
    "Saya istri ketiga. Suami saya baru saja meninggal. Anak-anak kami terdiri dari tiga anak laki-laki dan satu anak perempuan. Beliau mewariskan 1,1 miliar rupiah. Mohon pembagiannya.",
    "Kami empat istri ditinggal oleh suami. Ia meninggalkan dua anak laki-laki dan dua anak perempuan. Warisan tunai sebesar 1,2 miliar rupiah. Bagaimana cara membaginya?",
    "Saya salah satu dari dua istri suami saya yang wafat. Anak-anak kami ada satu laki-laki dan satu perempuan. Beliau meninggalkan warisan sebesar 700 juta. Bagaimana pembagiannya?",
    "Suami saya memiliki tiga istri. Setelah wafat, beliau meninggalkan warisan 1 miliar untuk kami dan dua anak laki-laki. Bagaimana pembagiannya menurut hukum Islam?",
    "Saya istri keempat dari almarhum. Kami memiliki dua anak laki-laki dan satu anak perempuan. Beliau meninggalkan tabungan 950 juta rupiah. Bagaimana pembagiannya?",
    "Kami bertiga sebagai istri dari suami yang wafat, bersama empat anak (dua laki-laki, dua perempuan), mewarisi warisan sebesar 1,2 miliar. Bagaimana pembagiannya?",
    "Saya ditinggal suami. Beliau memiliki dua istri dan tiga anak laki-laki. Warisan mencapai 1 miliar rupiah. Bagaimana hak kami para istri dan anak-anak?",
    "Suami saya wafat dan meninggalkan empat istri serta dua anak laki-laki dan dua anak perempuan. Warisan sebesar 1,1 miliar. Bagaimana pembagian warisnya?",
    "Saya salah satu dari tiga istri suami saya yang telah meninggal. Kami memiliki satu anak laki-laki dan dua anak perempuan. Warisan yang tersisa sebesar 900 juta.",
    "Setelah suami saya wafat, kami dua istri dan dua anak laki-laki serta satu anak perempuan mewarisi warisan 950 juta rupiah. Bagaimana cara membaginya?",
    "Saya istri ketiga. Suami saya meninggal dan meninggalkan tiga anak laki-laki dan satu anak perempuan. Warisan 1 miliar. Bagaimana pembagiannya menurut syariah?",
    "Kami empat istri dari almarhum. Beliau meninggalkan satu anak laki-laki dan dua anak perempuan. Warisan sebesar 850 juta rupiah. Bagaimana pembagiannya?",
    "Saya ditinggal suami yang memiliki dua istri. Kami punya tiga anak laki-laki. Warisan 1 miliar rupiah. Bagaimana kami membaginya?",
    "Suami saya wafat tanpa meninggalkan utang. Ia meninggalkan kami tiga istri serta dua anak laki-laki dan dua anak perempuan. Warisan 1,1 miliar. Bagaimana pembagiannya?",
    "Saya istri pertama dari almarhum. Ia meninggalkan dua anak laki-laki dan satu anak perempuan serta warisan sebesar 950 juta. Kami ada tiga istri. Bagaimana cara membaginya?",
    "Saya istri sah ketiga. Setelah suami wafat, kami para istri dan dua anak laki-laki menerima warisan sebesar 900 juta. Mohon perhitungan pembagiannya.",
    "Kami empat istri dari suami yang telah tiada. Ia meninggalkan warisan sebesar 1,3 miliar dan anak-anak sebanyak tiga laki-laki dan satu perempuan. Bagaimana pembagiannya?",
    "Saya salah satu dari dua istri yang ditinggalkan suami saya. Kami memiliki satu anak laki-laki dan dua anak perempuan. Warisan 800 juta rupiah. Bagaimana perhitungannya?",
    "Suami saya memiliki tiga istri. Setelah wafat, beliau meninggalkan satu anak laki-laki dan dua anak perempuan. Warisan sebesar 850 juta. Bagaimana pembagiannya?",
    "Kami tiga istri dari almarhum. Beliau meninggalkan dua anak laki-laki dan satu anak perempuan. Warisan berupa uang tunai 950 juta rupiah. Bagaimana sebaiknya dibagi?",
    "Saya istri kedua dari suami yang wafat. Ia memiliki dua anak laki-laki dan dua anak perempuan. Warisan sebesar 1,1 miliar rupiah. Bagaimana pembagian warisnya?",
    "Suami saya meninggal dunia. Kami empat istri bersama tiga anak laki-laki dan dua anak perempuan mewarisi harta sebesar 1,3 miliar rupiah. Bagaimana cara membaginya?",
    "Saya salah satu istri dari suami yang meninggal dunia. Ia meninggalkan dua anak laki-laki dan satu anak perempuan. Warisan tunai sebesar 900 juta rupiah. Mohon pembagiannya.",
    "Suami saya meninggalkan kami dua istri dan tiga anak laki-laki. Warisan berupa uang 1 miliar. Bagaimana perhitungan warisnya?",
    "Kami tiga istri dari suami yang telah wafat. Ia meninggalkan satu anak laki-laki dan dua anak perempuan serta warisan sebesar 950 juta rupiah.",
    "Saya istri pertama. Suami saya wafat meninggalkan warisan 1 miliar rupiah. Kami memiliki dua anak laki-laki dan dua anak perempuan. Kami ada empat istri.",
    "Suami saya meninggal dunia tanpa hutang. Ia meninggalkan kami tiga istri dan dua anak laki-laki. Warisan berupa uang sebesar 900 juta rupiah. Bagaimana dibagikan?",
    "Saya istri keempat dari suami yang wafat. Kami memiliki dua anak laki-laki dan satu anak perempuan. Warisan 850 juta rupiah. Bagaimana pembagiannya?",
    "Suami saya wafat dan meninggalkan empat istri serta tiga anak laki-laki dan dua anak perempuan. Warisan mencapai 1,2 miliar rupiah. Bagaimana cara membaginya?",
    "Saya salah satu dari tiga istri yang ditinggal wafat suami. Ia meninggalkan satu anak laki-laki dan dua anak perempuan. Warisan 900 juta rupiah. Bagaimana pembagiannya?",
    "Suami saya memiliki dua istri. Setelah wafat, ia meninggalkan tiga anak laki-laki dan satu anak perempuan serta warisan sebesar 1 miliar. Bagaimana pembagiannya?",
    "Kami empat istri ditinggal wafat oleh suami. Ia mewariskan uang tunai sebesar 1,3 miliar dan meninggalkan dua anak laki-laki serta dua anak perempuan. Bagaimana pembagian warisnya?",
    "Saya istri kedua. Kami memiliki dua anak laki-laki dan satu anak perempuan. Warisan dari suami saya sebesar 950 juta rupiah. Kami ada tiga istri. Bagaimana cara membaginya?",
    "Setelah suami saya wafat, kami bertiga sebagai istri dan dua anak laki-laki mewarisi 1 miliar rupiah. Bagaimana pembagian yang sesuai hukum Islam?",
    "Saya istri keempat. Suami saya wafat, meninggalkan satu anak laki-laki dan dua anak perempuan serta harta warisan 850 juta rupiah. Bagaimana pembagiannya?",
    "Kami dua istri dari suami yang baru meninggal. Ia meninggalkan dua anak laki-laki dan satu anak perempuan. Warisan 900 juta rupiah. Bagaimana cara membaginya?",
    "Suami saya wafat dan meninggalkan kami empat istri, serta dua anak laki-laki dan dua anak perempuan. Warisan berupa uang 1,2 miliar rupiah. Bagaimana pembagian warisnya?",
    "Suami saya telah tiada. Kami empat istri ditinggal bersama tiga anak laki-laki dan satu anak perempuan. Warisan yang ditinggalkan sebesar 1,2 miliar rupiah. Bagaimana pembagiannya?",
    "Saya salah satu dari dua istri yang ditinggalkan almarhum. Kami memiliki satu anak laki-laki dan dua anak perempuan. Warisan kami sebesar 850 juta rupiah. Bagaimana pembagiannya menurut syariat?",
    "Setelah suami saya meninggal, kami tiga istri dan dua anak laki-laki serta dua anak perempuan mewarisi tabungan sebesar 1,1 miliar. Bagaimana sebaiknya dibagi?",
    "Saya istri kedua dari empat istri almarhum. Ia meninggalkan satu anak laki-laki dan dua anak perempuan. Warisan sebesar 900 juta. Bagaimana pembagiannya?",
    "Kami dua istri dari suami yang wafat. Beliau meninggalkan tiga anak laki-laki. Warisan berupa uang sebesar 1 miliar rupiah. Mohon perhitungannya.",
    "Saya istri pertama dari tiga istri almarhum. Kami memiliki dua anak laki-laki dan satu anak perempuan. Beliau mewariskan 1 miliar rupiah. Bagaimana pembagiannya?",
    "Suami saya wafat dan meninggalkan empat istri. Anak-anak kami ada dua laki-laki dan dua perempuan. Warisan sebesar 1,3 miliar rupiah. Bagaimana pembagiannya?",
    "Saya ditinggal oleh suami saya bersama tiga istri lainnya dan dua anak laki-laki. Kami menerima warisan 950 juta. Bagaimana pembagiannya sesuai hukum Islam?",
    "Kami bertiga sebagai istri ditinggal suami yang wafat. Beliau meninggalkan satu anak laki-laki dan dua anak perempuan. Warisan sebesar 850 juta. Bagaimana membaginya?",
    "Saya istri kedua dari almarhum. Kami memiliki tiga anak laki-laki dan satu anak perempuan. Warisan dari beliau sebesar 1,2 miliar. Mohon dijelaskan pembagian warisnya.",
    "Setelah suami saya wafat, kami dua istri dan dua anak laki-laki serta dua anak perempuan menerima harta 1 miliar rupiah. Bagaimana pembagiannya menurut syariat Islam?",
    "Suami saya meninggal dan meninggalkan tiga istri, serta dua anak laki-laki dan satu anak perempuan. Warisan yang ditinggalkan senilai 950 juta. Bagaimana pembagian yang adil?",
    "Saya istri keempat. Kami punya dua anak laki-laki dan dua anak perempuan. Warisan yang ditinggalkan suami saya sebesar 1,1 miliar. Bagaimana pembagiannya?",
    "Kami empat istri dari almarhum. Ia meninggalkan tiga anak laki-laki. Warisan berupa uang tunai sebesar 1,3 miliar. Bagaimana pembagiannya menurut syariah?",
    "Saya istri pertama dari suami yang wafat. Beliau memiliki tiga anak laki-laki dan satu anak perempuan. Warisan sebesar 1 miliar. Mohon bantuannya dalam pembagian waris.",
    "Kami tiga istri dari almarhum menerima warisan 900 juta bersama dua anak laki-laki dan dua anak perempuan. Bagaimana pembagian warisnya?",
    "Suami saya meninggal dunia. Kami dua istri memiliki satu anak laki-laki dan dua anak perempuan. Warisan beliau sebesar 850 juta rupiah. Bagaimana pembagiannya?",
    "Saya dan dua istri lainnya ditinggal suami. Anak kami tiga laki-laki. Warisan dari beliau adalah 950 juta rupiah. Mohon hitung pembagiannya.",
    "Kami empat istri dari suami yang telah wafat. Beliau meninggalkan dua anak laki-laki dan satu anak perempuan serta warisan 1,1 miliar. Bagaimana cara membaginya?",
    "Saya sebagai istri sah ketiga dari almarhum. Beliau memiliki dua anak laki-laki dan dua anak perempuan. Warisan yang kami terima 1 miliar. Bagaimana pembagiannya?",
    "Suami saya wafat dan meninggalkan tiga istri serta tiga anak laki-laki dan satu anak perempuan. Warisan sebesar 1,2 miliar rupiah. Bagaimana hak masing-masing?",
    "Saya istri kedua. Suami saya meninggal dan kami punya satu anak laki-laki dan dua anak perempuan. Warisan beliau sebesar 850 juta. Bagaimana pembagiannya menurut Islam?",
    "Setelah kepergian suami saya, kami dua istri dan dua anak laki-laki serta satu anak perempuan mewarisi uang sebesar 950 juta. Bagaimana pembagiannya?",
    "Saya salah satu dari empat istri suami saya yang baru saja meninggal. Ia meninggalkan dua anak laki-laki dan dua anak perempuan. Warisan 1,1 miliar rupiah. Bagaimana membaginya?",
    "Kami bertiga sebagai istri menerima warisan dari suami saya sebesar 1 miliar, bersama tiga anak laki-laki dan dua anak perempuan. Mohon perhitungan pembagiannya.",
    "Saya istri pertama dari suami yang wafat. Kami memiliki dua anak laki-laki dan satu anak perempuan. Warisan berupa tabungan 900 juta. Bagaimana cara membaginya?",
    "Kami empat istri ditinggal oleh suami. Anak-anak kami ada dua laki-laki dan dua perempuan. Warisan 1,2 miliar rupiah. Bagaimana pembagian warisnya menurut Islam?",
    "Saya salah satu dari tiga istri. Setelah suami saya wafat, beliau meninggalkan tiga anak laki-laki dan satu anak perempuan serta warisan sebesar 1 miliar. Bagaimana dibagi?",
    "Suami saya meninggal dunia. Kami dua istri memiliki dua anak laki-laki dan satu anak perempuan. Warisan yang ditinggalkan 850 juta. Bagaimana pembagiannya?",
    "Saya dan tiga istri lainnya ditinggalkan oleh suami saya yang wafat. Kami memiliki dua anak laki-laki dan dua anak perempuan. Warisan 1,3 miliar. Bagaimana membaginya?",
    "Kami bertiga sebagai istri menerima warisan 1 miliar dari suami saya. Ia meninggalkan dua anak laki-laki dan satu anak perempuan. Bagaimana perhitungan pembagiannya?",
    "Saya istri keempat dari almarhum. Beliau meninggalkan satu anak laki-laki dan dua anak perempuan. Warisan yang tersisa sebesar 900 juta. Bagaimana pembagiannya?",
    "Kami dua istri ditinggal suami. Anak-anak kami terdiri dari tiga anak laki-laki. Warisan berupa tabungan 1 miliar rupiah. Bagaimana cara membaginya?",
    "Saya istri pertama dari suami yang telah meninggal. Beliau mewariskan 950 juta untuk saya, dua istri lainnya, dan dua anak laki-laki. Mohon pembagiannya menurut syariah.",
    "Suami saya wafat dan meninggalkan kami empat istri serta tiga anak laki-laki dan satu anak perempuan. Warisan senilai 1,2 miliar rupiah. Bagaimana kami membaginya?",
    "Saya salah satu dari dua istri. Suami saya meninggal dan meninggalkan warisan sebesar 850 juta untuk saya, istri kedua, serta dua anak laki-laki dan dua anak perempuan. Bagaimana pembagiannya?",
    "Kami tiga istri dari almarhum dan memiliki dua anak laki-laki serta satu anak perempuan. Warisan beliau sebesar 950 juta rupiah. Mohon bantuannya untuk menghitung.",
    "Saya istri kedua. Kami punya dua anak laki-laki dan dua anak perempuan. Suami saya meninggalkan warisan sebesar 1,1 miliar. Bagaimana sebaiknya dibagi?",
    "Kami empat istri dari almarhum. Anak-anak kami ada satu laki-laki dan dua perempuan. Warisan 1 miliar rupiah. Bagaimana pembagiannya menurut hukum Islam?",
    "Saya istri ketiga. Kami memiliki tiga anak laki-laki dan satu anak perempuan. Warisan dari suami saya sebesar 1,2 miliar. Bagaimana cara menghitungnya?",
    "Suami saya wafat dan meninggalkan kami dua istri serta dua anak laki-laki dan satu anak perempuan. Warisan berupa uang tunai 950 juta. Bagaimana pembagiannya?",
    "Saya istri pertama. Suami saya meninggal dan meninggalkan tiga anak laki-laki. Kami tiga istri menerima warisan sebesar 1 miliar. Bagaimana cara membaginya?",
    "Kami empat istri dari suami yang telah tiada. Ia meninggalkan dua anak laki-laki dan dua anak perempuan serta harta sebesar 1,3 miliar rupiah. Bagaimana pembagian warisnya?",
    "Saya istri kedua dari almarhum. Kami memiliki dua anak laki-laki dan satu anak perempuan. Warisan beliau sebesar 1 miliar rupiah. Bagaimana sebaiknya dibagi?",
    "Setelah suami saya wafat, kami dua istri dan tiga anak laki-laki mewarisi uang 950 juta. Bagaimana pembagiannya menurut ketentuan waris Islam?",
    "Saya istri ketiga dari suami yang meninggal dunia. Ia meninggalkan satu anak laki-laki dan dua anak perempuan. Warisan tunai sebesar 900 juta. Bagaimana dibagi?",
    "Suami saya wafat dan kami empat istri menerima warisan bersama dua anak laki-laki dan satu anak perempuan. Harta yang ditinggalkan 1,2 miliar rupiah. Bagaimana cara membaginya?",
    "Kami tiga istri dari almarhum dan memiliki tiga anak laki-laki dan satu anak perempuan. Warisan mencapai 1,1 miliar rupiah. Mohon pembagiannya.",
    "Saya salah satu istri dari suami yang telah tiada. Beliau meninggalkan dua anak laki-laki dan dua anak perempuan. Warisan sebesar 1 miliar. Bagaimana kami membaginya?",
    "Suami saya meninggal tanpa meninggalkan hutang. Kami empat istri serta tiga anak laki-laki dan dua anak perempuan menerima warisan 1,3 miliar rupiah. Bagaimana pembagiannya?"
  ]
}