{
  "texts": [
    "Suami saya wafat, meninggalkan dua anak laki-laki dan kakek dari pihak ayah. Warisan yang tersedia 1,2 miliar, dengan hutang sebesar 270 juta. Bagaimana pembagian warisnya?",
    "Suami saya meninggal dunia dan mewariskan dua putra serta seorang kakek dari garis ayah. Total harta 1,1 miliar, masih ada utang 230 juta. Mohon penjelasan warisnya.",
    "Suami saya telah tiada. Ia meninggalkan seorang anak laki-laki dan ayah dari ayahnya. Warisan mencapai 950 juta, tapi masih ada tanggungan hutang 180 juta. Bagaimana pembagian yang benar?",
    "Suami saya berpulang dan meninggalkan saya, dua anak laki-laki, serta kakek dari pihak ayahnya. Tersisa warisan sebesar 1,25 miliar dan utang 310 juta. Bagaimana waris ini dibagi?",
    "Suami saya meninggal dan mewariskan satu anak laki-laki serta kakek dari jalur ayah. Warisan 900 juta, namun ada utang 200 juta. Bagaimana seharusnya pembagiannya?",
    "Suami saya wafat, meninggalkan dua putra dan ayah dari ayahnya. Warisan yang tersedia 1 miliar, tetapi ada hutang 250 juta. Bagaimana perhitungannya?",
    "Suami saya meninggal dunia. Ia meninggalkan tiga anak laki-laki dan seorang kakek dari pihak ayah. Warisan senilai 1,4 miliar dan utang sebesar 400 juta. Mohon pembagiannya.",
    "Suami saya wafat dan hanya meninggalkan satu anak laki-laki serta kakek dari garis ayah. Warisan 890 juta, dan masih ada hutang 160 juta. Bagaimana cara pembagiannya?",
    "Suami saya meninggal dan mewariskan dua anak laki-laki serta seorang kakek dari pihak ayah. Warisan yang tersisa 1,15 miliar, dengan tanggungan utang 290 juta. Bagaimana pembagiannya?",
    "Suami saya wafat. Ia meninggalkan saya bersama dua anak laki-laki dan kakek dari jalur ayah. Warisan 1,3 miliar dan hutang sebesar 320 juta. Bagaimana warisan ini dibagi?",
    "Suami saya wafat dan meninggalkan saya dengan satu anak laki-laki serta ayah dari ayah beliau. Warisan 850 juta dan hutang 190 juta. Bagaimana sebaiknya dibagi?",
    "Suami saya berpulang, mewariskan dua anak laki-laki dan seorang kakek dari pihak ayah. Harta 1,2 miliar dengan utang sebesar 280 juta. Bagaimana waris dibagi?",
    "Suami saya wafat dan hanya meninggalkan satu anak laki-laki serta kakek dari garis ayah. Warisan 920 juta, namun masih ada hutang 210 juta. Bagaimana perhitungannya?",
    "Suami saya meninggal dunia, meninggalkan dua anak laki-laki dan ayah dari ayahnya. Warisan sebesar 1,1 miliar dan utang 260 juta. Bagaimana pembagian waris sesuai syariat?",
    "Suami saya wafat. Ia meninggalkan tiga anak laki-laki dan seorang kakek dari pihak ayah. Warisan yang tersisa 1,5 miliar dan hutang sebesar 430 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal, meninggalkan satu anak laki-laki dan kakek dari garis ayah. Warisan 870 juta dan masih ada hutang 170 juta. Mohon penjelasan pembagian warisnya.",
    "Suami saya wafat dan meninggalkan dua anak laki-laki serta ayah dari ayahnya. Warisan 1 miliar dan hutang 240 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia, hanya meninggalkan satu anak laki-laki dan kakek dari jalur ayah. Warisan 930 juta dan utang 200 juta. Bagaimana warisnya dibagi?",
    "Suami saya wafat dan meninggalkan saya, dua anak laki-laki dan kakek dari pihak ayah. Warisan 1,2 miliar dan tanggungan utang 300 juta. Bagaimana perhitungannya?",
    "Suami saya wafat. Ia meninggalkan satu anak laki-laki dan kakek dari ayah beliau. Warisan senilai 890 juta dan utang 180 juta. Bagaimana cara pembagian warisnya?",
    "Suami saya wafat dan mewariskan dua anak laki-laki serta kakek dari pihak ayah. Warisan 1,05 miliar dan hutang sebesar 270 juta. Bagaimana sebaiknya dibagi?",
    "Suami saya meninggal dunia, meninggalkan saya, dua anak laki-laki, serta ayah dari ayahnya. Warisan 1,3 miliar dan masih ada hutang 310 juta. Bagaimana pembagian waris?",
    "Suami saya wafat dan hanya meninggalkan satu anak laki-laki serta kakek dari garis ayah. Warisan sebesar 900 juta, namun ada utang 190 juta. Bagaimana pembagian warisan tersebut?",
    "Suami saya berpulang. Ia meninggalkan dua anak laki-laki dan seorang kakek dari pihak ayah. Warisan 1,2 miliar dan hutang 280 juta. Bagaimana perhitungannya?",
    "Suami saya wafat dan meninggalkan saya bersama satu anak laki-laki serta kakek dari pihak ayah. Warisan 870 juta dan tanggungan utang 160 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia. Ia mewariskan dua anak laki-laki dan ayah dari ayahnya. Warisan 1,15 miliar dan hutang 290 juta. Bagaimana waris ini dibagi?",
    "Suami saya wafat dan meninggalkan satu anak laki-laki serta seorang kakek dari garis ayah. Warisan 890 juta, masih ada utang 180 juta. Bagaimana cara membaginya?",
    "Suami saya wafat dan hanya meninggalkan dua anak laki-laki serta kakek dari pihak ayah. Warisan senilai 1,1 miliar dan utang 250 juta. Bagaimana pembagian warisan menurut Islam?",
    "Suami saya wafat. Ia meninggalkan saya bersama dua anak laki-laki dan kakek dari ayah beliau. Warisan sebesar 1,25 miliar dan hutang 320 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia. Ia meninggalkan satu anak laki-laki dan ayah dari ayahnya. Warisan 930 juta dan hutang 200 juta. Mohon perhitungannya.",
    "Suami saya wafat dan meninggalkan dua anak laki-laki serta kakek dari pihak ayah. Warisan 1,2 miliar dan utang 280 juta. Bagaimana cara membaginya?",
    "Suami saya wafat. Ia meninggalkan saya, dua anak laki-laki, dan seorang kakek dari garis ayah. Warisan 1,35 miliar dengan hutang 360 juta. Bagaimana pembagian yang tepat?",
    "Suami saya meninggal dan meninggalkan satu anak laki-laki serta ayah dari ayahnya. Warisan 900 juta dan tanggungan hutang 180 juta. Bagaimana pembagian warisnya?",
    "Suami saya wafat, meninggalkan saya dan dua anak laki-laki serta kakek dari pihak ayah. Warisan 1,15 miliar dan utang 300 juta. Bagaimana pembagian warisnya?",
    "Suami saya wafat dan mewariskan satu anak laki-laki dan kakek dari garis ayah. Warisan sebesar 850 juta dan utang 160 juta. Mohon bantuan perhitungannya.",
    "Suami saya meninggal dunia, meninggalkan dua anak laki-laki dan seorang kakek dari pihak ayah. Warisan senilai 1,2 miliar dan hutang 290 juta. Bagaimana warisnya dibagikan?",
    "Suami saya wafat dan meninggalkan satu anak laki-laki serta kakek dari pihak ayah. Warisan 900 juta dan tanggungan hutang 190 juta. Bagaimana pembagiannya?",
    "Suami saya wafat, mewariskan dua anak laki-laki dan kakek dari garis ayah. Warisan 1,1 miliar dan hutang 260 juta. Bagaimana pembagian waris menurut syariat?",
    "Suami saya wafat. Ia meninggalkan satu anak laki-laki dan ayah dari ayah beliau. Warisan 870 juta dan utang 170 juta. Bagaimana cara membaginya?",
    "Suami saya meninggal dunia, meninggalkan saya, dua anak laki-laki, dan kakek dari pihak ayah. Warisan sebesar 1,3 miliar dan hutang 330 juta. Bagaimana pembagiannya?",
    "Suami saya wafat, mewariskan satu anak laki-laki dan seorang kakek dari jalur ayah. Warisan 930 juta dan utang 200 juta. Mohon perhitungannya.",
    "Suami saya wafat dan meninggalkan dua anak laki-laki serta ayah dari ayah beliau. Warisan 1,2 miliar dan hutang 290 juta. Bagaimana cara membaginya?",
    "Suami saya wafat, meninggalkan saya dan dua anak laki-laki serta kakek dari pihak ayah. Warisan 1,1 miliar dan utang 270 juta. Bagaimana pembagiannya?",
    "Suami saya wafat dan hanya meninggalkan satu anak laki-laki serta kakek dari jalur ayah. Warisan 900 juta dan hutang 190 juta. Bagaimana pembagian waris ini?",
    "Suami saya wafat, meninggalkan dua anak laki-laki dan seorang kakek dari pihak ayah. Warisan 1,25 miliar dan tanggungan hutang 310 juta. Bagaimana perhitungannya?",
    "Suami saya meninggal dunia. Ia meninggalkan satu anak laki-laki dan ayah dari ayah beliau. Warisan sebesar 890 juta dan hutang 180 juta. Bagaimana pembagiannya?",
    "Suami saya wafat dan mewariskan dua anak laki-laki serta kakek dari garis ayah. Warisan 1,05 miliar dan hutang 250 juta. Bagaimana cara membaginya?",
    "Suami saya wafat. Ia meninggalkan saya dengan satu anak laki-laki dan kakek dari pihak ayah. Warisan 910 juta dan hutang 200 juta. Bagaimana pembagiannya?",
    "Suami saya wafat dan meninggalkan dua anak laki-laki serta kakek dari jalur ayah. Warisan 1,1 miliar dan utang 260 juta. Mohon penjelasan warisnya.",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan seorang kakek dari pihak ayah. Warisan sebesar 850 juta dan hutang 170 juta. Bagaimana pembagian yang sesuai?",
    "Suami saya baru saja meninggal dunia. Ia meninggalkan dua anak laki-laki dan kakek dari pihak ayah, dengan harta warisan 1,2 miliar dan utang 290 juta. Bagaimana cara membaginya?",
    "Saya kehilangan suami saya yang tercinta. Ia meninggalkan saya bersama satu anak laki-laki dan kakek dari jalur ayah. Warisan sebesar 850 juta, dengan hutang 180 juta. Mohon bantuannya dalam pembagian waris.",
    "Suami saya wafat dan meninggalkan dua anak laki-laki serta seorang kakek dari pihak ayahnya. Warisan yang tersisa sebesar 1,05 miliar dan utang 240 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dan mewariskan satu anak laki-laki serta ayah dari ayahnya. Warisan 920 juta, namun masih ada tanggungan hutang sebesar 200 juta. Bagaimana pembagian yang sesuai syariat?",
    "Suami saya wafat dan meninggalkan saya serta dua anak laki-laki, juga kakek dari pihak ayah. Warisan 1,3 miliar, dengan hutang 310 juta. Bagaimana cara membaginya?",
    "Suami saya meninggal dunia, meninggalkan satu anak laki-laki dan seorang kakek dari jalur ayah. Harta yang ditinggalkan 900 juta dan utang 190 juta. Bagaimana pembagiannya menurut hukum Islam?",
    "Suami saya wafat. Ia meninggalkan dua anak laki-laki serta ayah dari ayah beliau. Warisan yang tersedia 1,15 miliar dan utang 270 juta. Bagaimana warisnya dibagikan?",
    "Suami saya berpulang, meninggalkan saya, seorang anak laki-laki dan kakek dari pihak ayah. Warisan senilai 880 juta dengan utang 170 juta. Mohon penjelasan pembagian waris.",
    "Suami saya wafat, meninggalkan dua anak laki-laki dan seorang kakek dari garis ayah. Warisan 1,1 miliar dengan tanggungan hutang sebesar 250 juta. Bagaimana perhitungannya?",
    "Suami saya meninggal dan hanya meninggalkan saya bersama satu anak laki-laki dan kakek dari jalur ayah. Harta warisan sebesar 900 juta dan utang 180 juta. Bagaimana pembagian warisan ini?",
    "Suami saya wafat. Ia mewariskan dua anak laki-laki serta ayah dari ayahnya. Harta sebesar 1,25 miliar dengan utang 290 juta. Bagaimana sebaiknya dibagikan?",
    "Suami saya wafat, meninggalkan saya, satu anak laki-laki dan kakek dari pihak ayah. Warisan 850 juta, namun suami saya memiliki utang 160 juta. Bagaimana pembagian waris yang tepat?",
    "Suami saya meninggal, hanya meninggalkan dua anak laki-laki dan seorang kakek dari jalur ayah. Warisan yang tersedia 1,2 miliar dan utang 300 juta. Bagaimana pembagian yang benar?",
    "Suami saya wafat dan meninggalkan satu anak laki-laki serta kakek dari pihak ayah. Harta warisannya 930 juta, sementara utangnya 200 juta. Bagaimana cara membaginya?",
    "Suami saya wafat dan hanya meninggalkan dua anak laki-laki serta ayah dari ayah beliau. Warisan senilai 1,15 miliar dan hutang sebesar 280 juta. Bagaimana pembagian warisnya?",
    "Suami saya meninggal, meninggalkan saya, satu anak laki-laki dan seorang kakek dari garis ayah. Warisan 880 juta dengan utang 170 juta. Bagaimana cara membaginya?",
    "Suami saya wafat, meninggalkan dua anak laki-laki dan seorang kakek dari pihak ayah. Warisan 1,1 miliar dan utang 260 juta. Mohon bantuannya.",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan kakek dari jalur ayah. Warisan sebesar 890 juta dengan utang 180 juta. Bagaimana pembagian warisnya?",
    "Suami saya meninggal dunia, meninggalkan dua anak laki-laki serta ayah dari ayahnya. Warisan 1,05 miliar dan utang 250 juta. Mohon penjelasan pembagiannya.",
    "Suami saya wafat, meninggalkan saya dengan satu anak laki-laki dan kakek dari pihak ayah. Warisan 910 juta, dengan utang 190 juta. Bagaimana seharusnya warisan itu dibagi?",
    "Suami saya meninggal, mewariskan dua anak laki-laki dan seorang kakek dari jalur ayah. Harta warisan sebesar 1,2 miliar dan tanggungan hutang 270 juta. Bagaimana pembagian yang sesuai?",
    "Suami saya wafat, hanya meninggalkan satu anak laki-laki dan kakek dari pihak ayah. Warisan 860 juta dan masih ada utang 170 juta. Bagaimana cara membaginya?",
    "Suami saya meninggal dunia. Ia meninggalkan dua anak laki-laki dan ayah dari ayah beliau. Warisan 1,1 miliar dan utang 260 juta. Mohon pembagian waris sesuai ketentuan.",
    "Suami saya wafat, meninggalkan saya, seorang anak laki-laki dan kakek dari pihak ayah. Warisan 890 juta dan utang 180 juta. Bagaimana pembagian warisnya?",
    "Suami saya wafat dan meninggalkan dua anak laki-laki serta seorang kakek dari garis ayah. Warisan 1,2 miliar dan utang 280 juta. Bagaimana sebaiknya dibagi?",
    "Suami saya meninggal, hanya meninggalkan satu anak laki-laki dan kakek dari jalur ayah. Warisan 880 juta dan utang 170 juta. Bagaimana pembagian menurut syariat?",
    "Suami saya wafat dan mewariskan dua anak laki-laki serta kakek dari pihak ayah. Warisan 1,15 miliar dan utang 270 juta. Mohon bantuannya untuk menghitung warisan.",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan kakek dari pihak ayah. Harta warisan 900 juta dan utang 200 juta. Bagaimana warisan ini dibagi?",
    "Suami saya meninggal dunia, meninggalkan dua anak laki-laki serta ayah dari ayahnya. Warisan 1,05 miliar dan hutang 250 juta. Mohon penjelasan pembagiannya.",
    "Suami saya wafat, hanya meninggalkan saya dan satu anak laki-laki serta kakek dari garis ayah. Warisan 930 juta dan utang 190 juta. Bagaimana cara pembagiannya?",
    "Suami saya wafat. Ia meninggalkan dua anak laki-laki dan seorang kakek dari pihak ayah. Warisan sebesar 1,25 miliar dan tanggungan hutang 300 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dunia, meninggalkan satu anak laki-laki dan ayah dari ayahnya. Warisan 890 juta dan utang 170 juta. Bagaimana pembagiannya?",
    "Suami saya wafat dan mewariskan dua anak laki-laki serta kakek dari garis ayah. Harta 1,15 miliar dan utang 280 juta. Bagaimana pembagian warisnya?",
    "Suami saya wafat, meninggalkan saya dan satu anak laki-laki serta kakek dari pihak ayah. Warisan 910 juta dengan hutang 200 juta. Bagaimana perhitungan warisnya?",
    "Suami saya wafat dan meninggalkan dua anak laki-laki serta kakek dari jalur ayah. Warisan 1,1 miliar dan utang 270 juta. Bagaimana pembagian menurut hukum Islam?",
    "Suami saya meninggal dunia. Ia mewariskan satu anak laki-laki dan kakek dari pihak ayah. Warisan 850 juta dan utang 180 juta. Mohon penjelasan pembagiannya.",
    "Suami saya wafat, hanya meninggalkan dua anak laki-laki dan ayah dari ayahnya. Warisan 1 miliar dan tanggungan hutang 260 juta. Bagaimana warisnya dibagikan?",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan kakek dari pihak ayah. Warisan 930 juta dan hutang 190 juta. Bagaimana pembagiannya?",
    "Suami saya meninggal dan meninggalkan dua anak laki-laki serta kakek dari garis ayah. Warisan 1,2 miliar dan utang 290 juta. Mohon bantuannya.",
    "Suami saya wafat, hanya meninggalkan saya, satu anak laki-laki dan kakek dari pihak ayah. Warisan 900 juta dengan utang 180 juta. Bagaimana perhitungannya?",
    "Suami saya wafat, meninggalkan dua anak laki-laki dan seorang kakek dari pihak ayah. Warisan 1,1 miliar dan hutang 270 juta. Bagaimana pembagian warisnya?",
    "Suami saya wafat. Ia mewariskan satu anak laki-laki dan ayah dari ayahnya. Warisan 870 juta dan utang 170 juta. Bagaimana pembagian yang benar?",
    "Suami saya wafat, meninggalkan saya, dua anak laki-laki dan kakek dari pihak ayah. Warisan 1,3 miliar dan utang 310 juta. Mohon penjelasannya.",
    "Suami saya wafat dan hanya meninggalkan satu anak laki-laki serta kakek dari garis ayah. Warisan 880 juta dan tanggungan utang 160 juta. Bagaimana seharusnya warisan ini dibagi?",
    "Suami saya wafat dan mewariskan dua anak laki-laki serta kakek dari pihak ayah. Warisan 1,2 miliar dan utang 280 juta. Bagaimana pembagiannya?",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan kakek dari jalur ayah. Warisan 910 juta dan utang 190 juta. Bagaimana cara pembagiannya?",
    "Suami saya wafat, hanya meninggalkan dua anak laki-laki serta kakek dari pihak ayah. Warisan 1,1 miliar dan utang 250 juta. Bagaimana pembagian warisnya?",
    "Suami saya wafat dan meninggalkan saya, satu anak laki-laki dan kakek dari pihak ayah. Warisan 870 juta dan hutang 180 juta. Bagaimana warisan ini dibagi?",
    "Suami saya meninggal, meninggalkan dua anak laki-laki dan kakek dari pihak ayah. Warisan 1,25 miliar dan utang 300 juta. Mohon perhitungannya.",
    "Suami saya wafat, meninggalkan satu anak laki-laki dan seorang kakek dari pihak ayah. Warisan 890 juta dan hutang 170 juta. Bagaimana cara membaginya?"
  ]
}