{
  "texts": [
    "Suami saya wafat, meninggalkan saya, satu anak laki-laki, dan nenek sebagai ahli waris. Harta peninggalan senilai 320 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal dunia, meninggalkan dua anak laki-laki serta nenek yang turut mewarisi. Total warisan 450 juta rupiah.",
    "Suami saya berpulang, ahli warisnya saya, tiga anak laki-laki, dan nenek yang masih hidup. Warisan sebesar 400 juta rupiah.",
    "Suami saya tutup usia, meninggalkan saya, empat anak laki-laki, dan nenek sebagai bagian dari ahli waris. Harta warisan mencapai 370 juta rupiah.",
    "Suami saya meninggal, ahli warisnya terdiri dari saya, lima anak laki-laki, dan nenek yang turut mewarisi harta. Total nilai harta 480 juta rupiah.",
    "Saya kehilangan suami tercinta yang meninggalkan satu anak laki-laki dan nenek sebagai ahli waris. Harta peninggalan 310 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, dua anak laki-laki, dan nenek yang ikut menerima bagian. Warisan 390 juta rupiah.",
    "Suami saya wafat, meninggalkan tiga anak laki-laki, saya, dan nenek sebagai ahli waris. Peninggalan senilai 430 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal, ahli warisnya termasuk empat anak laki-laki dan nenek. Warisan sebesar 360 juta rupiah.",
    "Suami saya berpulang, meninggalkan saya, lima anak laki-laki, serta nenek sebagai ahli waris. Harta yang ditinggalkan 400 juta rupiah.",
    "Suami saya meninggal, ahli warisnya saya, satu anak laki-laki, dan nenek yang turut mewarisi. Peninggalan 350 juta rupiah.",
    "Saya kehilangan suami, yang meninggalkan dua anak laki-laki serta nenek sebagai ahli waris. Warisan 420 juta rupiah.",
    "Suami saya wafat, meninggalkan tiga anak laki-laki, saya, dan nenek. Harta peninggalan senilai 370 juta rupiah.",
    "Suami saya tutup usia, ahli warisnya saya, empat anak laki-laki, dan nenek. Warisan sebesar 450 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan lima anak laki-laki, saya, dan nenek sebagai bagian ahli waris. Harta 390 juta rupiah.",
    "Saya menjadi janda setelah suami wafat, meninggalkan satu anak laki-laki dan nenek sebagai ahli waris. Total harta 430 juta rupiah.",
    "Suami saya meninggal, ahli warisnya saya, dua anak laki-laki, dan nenek yang turut menerima warisan. Peninggalan 350 juta rupiah.",
    "Suami saya berpulang, meninggalkan tiga anak laki-laki, saya, dan nenek sebagai ahli waris. Harta warisan 400 juta rupiah.",
    "Saya kehilangan suami, meninggalkan empat anak laki-laki serta nenek yang ikut menerima. Warisan 375 juta rupiah.",
    "Suami saya wafat, ahli warisnya saya, lima anak laki-laki, dan nenek. Harta yang ditinggalkan 420 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan satu anak laki-laki dan nenek sebagai ahli waris bersama saya. Total warisan 360 juta rupiah.",
    "Saya menjadi janda setelah suami tutup usia, ahli warisnya meliputi dua anak laki-laki dan nenek. Peninggalan 390 juta rupiah.",
    "Suami saya berpulang, meninggalkan tiga anak laki-laki, nenek, dan saya. Warisan sebesar 410 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, empat anak laki-laki, dan nenek. Harta peninggalan 350 juta rupiah.",
    "Saya kehilangan suami tercinta, yang meninggalkan lima anak laki-laki serta nenek sebagai ahli waris. Harta senilai 470 juta rupiah.",
    "Suami saya tutup usia, meninggalkan saya, satu anak laki-laki, dan nenek. Peninggalan sebesar 380 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya meliputi dua anak laki-laki dan nenek bersama saya. Harta warisan 340 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal, meninggalkan tiga anak laki-laki dan nenek sebagai ahli waris. Warisan 395 juta rupiah.",
    "Suami saya wafat, ahli warisnya saya, empat anak laki-laki, dan nenek yang turut mewarisi. Total harta 410 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan lima anak laki-laki, nenek, dan saya. Peninggalan 430 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya saya, satu anak laki-laki, dan nenek sebagai bagian dari ahli waris. Harta 370 juta rupiah.",
    "Suami saya berpulang, meninggalkan dua anak laki-laki, nenek, dan saya. Warisan 360 juta rupiah.",
    "Suami saya wafat, ahli warisnya meliputi tiga anak laki-laki dan nenek bersama saya. Harta peninggalan 400 juta rupiah.",
    "Saya menjadi janda setelah suami tutup usia, meninggalkan empat anak laki-laki dan nenek sebagai ahli waris. Warisan 390 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, lima anak laki-laki, dan nenek yang turut mewarisi harta. Peninggalan 420 juta rupiah.",
    "Suami saya tutup usia, meninggalkan saya, satu anak laki-laki, dan nenek. Total warisan 350 juta rupiah.",
    "Suami saya meninggal, ahli warisnya saya, dua anak laki-laki, dan nenek sebagai bagian ahli waris. Harta 370 juta rupiah.",
    "Saya menjadi janda setelah suami berpulang, meninggalkan tiga anak laki-laki dan nenek. Peninggalan 400 juta rupiah.",
    "Suami saya wafat, ahli warisnya saya, empat anak laki-laki, dan nenek. Warisan sebesar 450 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan lima anak laki-laki, nenek, dan saya sebagai ahli waris. Harta peninggalan 480 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya saya, satu anak laki-laki, dan nenek. Total harta 370 juta rupiah.",
    "Suami saya berpulang, meninggalkan dua anak laki-laki dan nenek bersama saya. Warisan 410 juta rupiah.",
    "Suami saya wafat, ahli warisnya meliputi tiga anak laki-laki, nenek, dan saya. Harta peninggalan 390 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal dunia, meninggalkan empat anak laki-laki dan nenek. Warisan 420 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, lima anak laki-laki, dan nenek sebagai bagian dari ahli waris. Peninggalan 450 juta rupiah.",
    "Suami saya tutup usia, meninggalkan saya, satu anak laki-laki, dan nenek. Harta warisan 400 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, dua anak laki-laki, dan nenek. Total harta 430 juta rupiah.",
    "Saya menjadi janda setelah suami wafat, meninggalkan tiga anak laki-laki serta nenek sebagai ahli waris. Warisan sebesar 390 juta rupiah.",
    "Suami saya wafat, ahli warisnya meliputi empat anak laki-laki dan nenek bersama saya. Peninggalan 410 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan lima anak laki-laki dan nenek sebagai ahli waris bersama saya. Harta senilai 470 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan saya sebagai istri, dua anak laki-laki, dan nenek sebagai ahli warisnya. Warisan yang ditinggalkan sebesar 400 juta rupiah.",
    "Setelah suami berpulang, saya dan lima anak laki-laki serta nenek menjadi ahli waris yang menerima harta senilai 450 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, tiga anak laki-laki, dan nenek yang turut mewarisi. Peninggalan 380 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal, ahli warisnya meliputi empat anak laki-laki dan nenek. Harta warisan mencapai 420 juta rupiah.",
    "Suami saya tutup usia, meninggalkan satu anak laki-laki dan nenek, serta saya sebagai istri. Warisan senilai 350 juta rupiah.",
    "Setelah suami saya meninggal, saya, dua anak laki-laki, dan nenek menjadi ahli waris yang berbagi harta sebesar 390 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, tiga anak laki-laki, dan nenek sebagai bagian ahli waris. Peninggalan senilai 410 juta rupiah.",
    "Saya kehilangan suami tercinta, ahli warisnya terdiri dari empat anak laki-laki dan nenek bersama saya. Warisan 370 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan lima anak laki-laki dan nenek, serta saya sebagai istri. Harta warisan 460 juta rupiah.",
    "Suami saya berpulang, ahli warisnya saya, satu anak laki-laki, dan nenek. Peninggalan harta sebesar 320 juta rupiah.",
    "Saya menjadi janda setelah suami wafat, meninggalkan dua anak laki-laki dan nenek sebagai ahli waris. Total warisan 380 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya terdiri dari tiga anak laki-laki, nenek, dan saya. Harta peninggalan 400 juta rupiah.",
    "Setelah suami tutup usia, saya, empat anak laki-laki, dan nenek menjadi ahli waris yang berbagi harta 420 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, lima anak laki-laki, dan nenek. Warisan senilai 450 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya saya, satu anak laki-laki, dan nenek. Peninggalan harta sebesar 350 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan dua anak laki-laki, nenek, dan saya. Harta warisan 390 juta rupiah.",
    "Setelah suami saya berpulang, ahli warisnya saya, tiga anak laki-laki, dan nenek. Total harta 410 juta rupiah.",
    "Suami saya tutup usia, meninggalkan empat anak laki-laki dan nenek bersama saya. Warisan 370 juta rupiah.",
    "Saya menjadi janda setelah suami wafat, ahli warisnya saya, lima anak laki-laki, dan nenek. Harta peninggalan 440 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan saya, satu anak laki-laki, dan nenek sebagai ahli waris. Warisan sebesar 360 juta rupiah.",
    "Suami saya wafat, meninggalkan dua anak laki-laki, nenek, dan saya. Peninggalan harta 400 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya meliputi tiga anak laki-laki, nenek, dan saya. Total warisan 430 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, empat anak laki-laki, dan nenek. Warisan 380 juta rupiah.",
    "Setelah suami berpulang, saya, lima anak laki-laki, dan nenek menjadi ahli waris yang menerima harta 470 juta rupiah.",
    "Suami saya tutup usia, meninggalkan saya, satu anak laki-laki, dan nenek sebagai ahli waris. Peninggalan harta 350 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal, ahli warisnya saya, dua anak laki-laki, dan nenek. Warisan 400 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, tiga anak laki-laki, dan nenek sebagai ahli waris. Harta peninggalan 410 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, empat anak laki-laki, dan nenek. Warisan 390 juta rupiah.",
    "Saya kehilangan suami, meninggalkan lima anak laki-laki dan nenek sebagai ahli waris bersama saya. Peninggalan harta 450 juta rupiah.",
    "Suami saya meninggal, ahli warisnya saya, satu anak laki-laki, dan nenek. Warisan 350 juta rupiah.",
    "Setelah suami wafat, saya, dua anak laki-laki, dan nenek menjadi ahli waris yang berbagi harta 400 juta rupiah.",
    "Suami saya berpulang, meninggalkan saya, tiga anak laki-laki, dan nenek. Harta peninggalan 420 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal, ahli warisnya saya, empat anak laki-laki, dan nenek. Warisan 370 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, lima anak laki-laki, dan nenek sebagai ahli waris. Peninggalan 460 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, satu anak laki-laki, dan nenek. Warisan 360 juta rupiah.",
    "Saya kehilangan suami, meninggalkan dua anak laki-laki dan nenek. Harta peninggalan 400 juta rupiah.",
    "Suami saya tutup usia, ahli warisnya saya, tiga anak laki-laki, dan nenek. Peninggalan 430 juta rupiah.",
    "Suami saya wafat, meninggalkan saya, empat anak laki-laki, dan nenek. Warisan sebesar 390 juta rupiah.",
    "Saya menjadi janda setelah suami meninggal dunia, ahli warisnya saya, lima anak laki-laki, dan nenek. Harta 450 juta rupiah.",
    "Suami saya meninggal dunia, meninggalkan saya, satu anak laki-laki, dan nenek. Peninggalan harta 370 juta rupiah.",
    "Suami saya wafat, ahli warisnya saya, dua anak laki-laki, dan nenek. Warisan sebesar 400 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya saya, tiga anak laki-laki, dan nenek. Harta peninggalan 420 juta rupiah.",
    "Suami saya tutup usia, meninggalkan saya, empat anak laki-laki, dan nenek sebagai ahli waris. Peninggalan 390 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, lima anak laki-laki, dan nenek. Warisan 460 juta rupiah.",
    "Saya menjadi janda setelah suami wafat, meninggalkan saya, satu anak laki-laki, dan nenek. Harta warisan 380 juta rupiah.",
    "Suami saya wafat, ahli warisnya saya, dua anak laki-laki, dan nenek sebagai bagian ahli waris. Peninggalan 400 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, tiga anak laki-laki, dan nenek. Warisan 430 juta rupiah.",
    "Saya kehilangan suami, ahli warisnya saya, empat anak laki-laki, dan nenek. Peninggalan 390 juta rupiah.",
    "Suami saya tutup usia, meninggalkan saya, lima anak laki-laki, dan nenek sebagai ahli waris. Warisan sebesar 460 juta rupiah.",
    "Suami saya meninggal dunia, ahli warisnya saya, satu anak laki-laki, dan nenek. Harta peninggalan 400 juta rupiah."
  ]
}