{
	"intents": [
		{
			"intent": "sapaan",
			"text": [
				"Hai",
				"Halo",
				"Hallo",
				"Hai Amana",
				"Halo Amana",
				"Halo Amana, apa kabar",
				"Apa kabar Amana",
				"Hai Amana, apa kabar"
			],
			"responses": [
				"Halo! Saya Amana, siap membantu perhitungan warisan.",
				"Hai! Yuk, mulai hitung harta warisnya.",
				"Halo juga! Ada yang bisa saya bantu?",
				"Hi! Saya Amana. Mari kita mulai jika Anda ingin membahas warisan."
			]
		},
		{
			"intent": "sapaan_pagi",
			"text": [
				"Selamat pagi, Amana",
				"Pagi Amana",
				"Hai Amana, selamat pagi",
				"Amana, selamat pagi",
				"Pagi Amana",
				"Amana pagi",
				"Selamat pagi",
				"Pagi"
			],
			"responses": [
				"Selamat pagi! Saya Amana, apakah ada yang bisa saya bantu?",
				"Pagi! Dengan Amana di sini, ada yang bisa dibantu?",
				"Selamat pagi juga! Siap bantu hitung pembagian warisan.",
				"Hai, selamat pagi! Ada hal seputar warisan yang ingin Anda tanyakan?"
			]
		},
		{
			"intent": "sapaan_siang",
			"text": [
				"Selamat siang, Amana",
				"Siang Amana",
				"Hai Amana, selamat siang",
				"Amana, selamat siang",
				"Selamat siang Amana, apa kabar",
				"Siang Amana, apa kabar",
				"Siang",
				"Halo Amana, selamat siang"
			],
			"responses": [
				"Selamat siang! Saya Amana apakah ada yang bisa saya bantu?",
				"Siang! Dengan Amana disini, ada yang bisa dibantu?",
				"Hai, selamat siang! Dengan Amana disini, ada yang bisa saya bantu?",
				"Siang, kabar baik. Saya Amana, ada yang bisa dibantu?"
			]
		},
		{
			"intent": "sapaan_malam",
			"text": [
				"Selamat malam, Amana",
				"Malam Amana",
				"Hai Amana, selamat malam",
				"Amana selamat malam",
				"Selamat malam Amana, apa kabar",
				"Malam Amana, apa kabar",
				"Malam",
				"Halo Amana, selamat malam"
			],
			"responses": [
				"Selamat malam! Saya Amana apakah ada yang bisa saya bantu?",
				"Malam! Dengan Amana disini, ada yang bisa dibantu?",
				"Hai, selamat malam! Dengan Amana disini, ada yang bisa saya bantu?",
				"Malam, kabar baik. Saya Amana, ada yang bisa dibantu?"
			]
		},
		{
			"intent": "sapaan_islam",
			"text": [
				"Assalamualaikum",
				"Assalamualaikum Amana",
				"Assalamualaikum Amana, apa kabar",
				"Assalamu'alaikum Amana",
				"Assalamu'alaikum",
				"Assalamualaikum warahmatullahi wabarakatuh",
				"Assalamu'alaikum warahmatullahi wabarakatuh",
				"Assalamu'alaikum wr. wb."
			],
			"responses": [
				"Waalaikumussalam, selamat datang! Saya Amana dapat membantu menghitung harta waris menurut hukum Islam.",
				"Wa'alaikumussalam, selamat datang! Saya Amana dapat membantu menghitung harta waris sesuai syariat.",
				"Wa'alaikumussalam, kabar baik dan selamat datang! Saya Amana, siap membantu pembagian warisan sesuai Islam.",
				"Waalaikumussalam warahmatullahi wabarakatuh. Saya Amana, ada yang bisa saya bantu?"
			]
		},
		{
			"intent": "balasan_intro",
			"text": [
				"Waalaikumsalam",
				"Wa'alaikumsalam",
				"Waalaikumsalam Amana",
				"Wa'alaikumsalam Amana",
				"Waalaikumsalam warahmatullahi wabarakatuh",
				"Wa'alaikumsalam warahmatullahi wabarakatuh",
				"Waalaikumsalam wr wb",
				"Wa'alaikumussalam wr. wb."
			],
			"responses": [
				"Hai, apa kabar? Apakah ada yang bisa Amana bantu?",
				"Halo, apa kabar? Apakah ada yang bisa Amana bantu?"
			]
		},
		{
			"intent": "tanya_bantuan",
			"text": [
				"Kabar baik Amana, saya ingin menanyakan perihal warisan Islam",
				"Baik Amana, saya ingin menanyakan perihal warisan Islam",
				"Hai juga Amana, saya ingin menanyakan perihal perhitungan warisan Islam",
				"Alhamdulillah kabar baik Amana, saya ingin menanyakan perihal pembagian warisan Islam",
				"Kabar baik, saya ingin menanyakan perihal pembagian waris Islam",
				"Alhamdulillah Amana, kabar baik. Bisakah Amana bantu saya menghitung pembagian waris secara Islam?",
				"Kabar baik Amana, saya punya kasus waris, apakah Amana bisa bantu hitungkan menurut hukum Islam?",
				"Saya ingin berkonsultasi soal waris Islam, apakah Amana bisa bantu?"
			],
			"responses": [
				"Tentu saja, Amana bisa bantu. Silahkan tulis pertanyaan yang detail",
				"Dengan senang hati. Sampaikan kondisi atau data ahli warisnya ya.",
				"Silakan jelaskan siapa saja ahli warisnya dan berapa harta yang ditinggalkan.",
				"Boleh, saya siap bantu. Tulis situasinya, misalnya siapa yang meninggal dan siapa ahli warisnya."
			]
		},
		{
			"intent": "pertanyaan",
			"text": [
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta dua anak laki-laki. Warisan berupa uang tunai sebesar 600 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya meninggal dan meninggalkan saya sebagai seorang istri, serta dua anak perempuan. Ia masih memiliki hutang sebesar 150 juta. Harta tabungan sebesar 700 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat dan meninggalkan dua istri dan empat anak laki-laki. Warisan berupa tabungan 1,5 miliar. Tidak ada hutang. Bagaimana pembagiannya?",
				"Ayah saya meninggal dan meninggalkan ibu saya sebagai istri sah beliau, serta saya sebagai satu-satunya anak laki-laki. Ia masih memiliki hutang sebesar 100 juta. Harta berupa uang 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak perempuan. Tidak ada hutang. Tabungan sebesar 350 juta. Bagaimana warisan dibagi?",
				"Suami saya meninggal, meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Warisan berupa uang 400 juta. Ada hutang 50 juta. Bagaimana warisan dibagikan?",
				"Seorang pria meninggal dan meninggalkan tiga istri dan lima anak laki-laki. Tidak ada hutang. Harta berupa tabungan 2 miliar. Bagaimana pembagiannya?",
				"Ayah saya meninggal dan meninggalkan ibu saya sebagai istri sah beliau, serta tiga anak perempuan. Tidak ada hutang. Warisan berupa uang 700 juta. Bagaimana pembagian waris?",
				"Seorang pria meninggal, meninggalkan satu istri, dua anak laki-laki, satu anak perempuan, dan hutang 200 juta. Warisan berupa uang 1,2 miliar. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebeagai seorang istri dan satu anak perempuan. Tidak ada hutang. Harta sebesar 450 juta. Bagaimana warisan dibagikan?",
				"Seorang pria wafat, meninggalkan dua istri dan tiga anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 1,1 miliar. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta saya sebagai anak perempuan satu-satunya. Ia masih memiliki hutang 80 juta. Harta sebesar 400 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak laki-laki. Tidak ada orang tua yang masih hidup. Warisan berupa uang 500 juta. Tidak ada hutang. Bagaimana warisannya?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri, dua anak perempuan, dan seorang nenek. Ia masih memiliki hutang 100 juta. Tabungan 650 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan empat istri dan enam anak laki-laki. Warisan berupa tabungan 2,5 miliar. Tidak ada hutang. Bagaimana waris dibagi?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau serta dua anak laki-laki dan seorang nenek. Tidak ada hutang. Warisan 800 juta. Bagaimana pembagian waris?",
				"Seorang pria meninggal dunia dan meninggalkan satu istri dan dua anak laki-laki. Ia memiliki hutang sebesar 150 juta. Harta 700 juta. Bagaimana pembagian warisan?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri dan satu anak perempuan. Tidak ada orang tua yang masih hidup. Warisan berupa uang 350 juta. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Seorang pria meninggal, tidak memiliki orang tua yang masih hidup. Ia meninggalkan satu istri, dua anak perempuan, dan hutang 100 juta. Harta sebesar 600 juta. Bagaimana pembagian waris?",
				"Ayah saya meninggal dan meninggalkan ibu saya sebagai istri sah beliau, serta satu anak laki-laki dan satu anak perempuan. Tidak ada hutang. Warisan 850 juta. Bagaimana pembagian waris?",
				"Seorang pria meninggal dan meninggalkan dua istri dan empat anak laki-laki. Tidak ada hutang. Harta sebesar 1,3 miliar. Bagaimana warisannya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Ia memiliki hutang 90 juta. Warisan berupa tabungan 550 juta. Bagaimana waris dibagi?",
				"Ayah saya wafat dan hanya meninggalkan ibu saya sebagai istri sah beliau serta satu anak perempuan. Warisan berupa uang tunai 450 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri, dua anak perempuan, dan nenek. Tidak ada hutang. Warisan 600 juta. Bagaimana warisan dibagikan?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan tiga anak laki-laki. Ia memiliki hutang sebesar 250 juta. Warisan berupa tabungan 1 miliar. Bagaimana pembagian waris?",
				"Seorang pria meninggal dan meninggalkan tiga istri, dua anak laki-laki, dan dua anak perempuan. Tidak ada hutang. Warisan berupa uang 1,8 miliar. Bagaimana pembagian waris?",
				"Ayah saya meninggal dan meninggalkan ibu saya sebagai istri sah beliau serta dua anak perempuan. Ia memiliki hutang 150 juta. Harta sebesar 600 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat, meninggalkan satu istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri, dua anak perempuan, dan satu anak laki-laki. Warisan berupa tabungan 900 juta. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Seorang pria meninggal dan meninggalkan dua istri dan lima anak laki-laki. Ia memiliki hutang 300 juta. Harta 2 miliar. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta tiga anak laki-laki. Tidak ada hutang. Harta berupa uang 1,1 miliar. Bagaimana waris dibagi?",
				"Seorang pria wafat, meninggalkan satu istri, satu anak perempuan, dan nenek. Ia memiliki hutang 70 juta. Harta 500 juta. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Tidak ada hutang. Warisan berupa uang 450 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau serta satu anak perempuan. Tidak ada orang tua yang masih hidup. Warisan berupa tabungan 400 juta. Tidak ada hutang. Bagaimana waris dibagikan?",
				"Seorang pria wafat dan hanya meninggalkan satu istri dan satu anak perempuan. Ia memiliki hutang 80 juta. Warisan berupa uang 350 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sah dan satu anak laki-laki. Tidak ada hutang. Warisan berupa uang 500 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat, meninggalkan dua istri, dua anak laki-laki, dan satu anak perempuan. Ia masih memiliki hutang sebesar 250 juta. Harta berupa tabungan 1,2 miliar. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta dua anak laki-laki. Tidak ada hutang. Harta sebesar 800 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri, tiga anak perempuan, dan nenek. Warisan berupa tabungan 600 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri sah, dua anak perempuan, dan satu anak laki-laki. Ia masih memiliki hutang sebesar 100 juta. Warisan berupa uang 850 juta. Bagaimana pembagian waris?",
				"Seorang pria meninggal dan hanya meninggalkan satu istri dan satu anak perempuan. Tidak ada hutang. Harta berupa uang 300 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat, meninggalkan ibu saya sebagai istri sah beliau, serta dua anak perempuan. Tidak ada anak laki-laki. Warisan berupa uang 500 juta. Tidak ada hutang. Bagaimana warisannya?",
				"Seorang pria wafat dan meninggalkan tiga istri dan lima anak laki-laki. Ia memiliki hutang 400 juta. Warisan berupa uang 2,5 miliar. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sahnya, serta satu anak laki-laki. Tidak ada hutang. Harta sebesar 400 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta satu anak perempuan. Tidak ada hutang. Warisan berupa tabungan 450 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan dua istri, tiga anak laki-laki, dan nenek. Warisan 1,7 miliar. Tidak ada hutang. Bagaimana warisannya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri sahnya beliau dan satu anak perempuan. Ia memiliki hutang 70 juta. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan hanya meninggalkan satu istri dan satu anak laki-laki. Tidak ada hutang. Harta sebesar 500 juta. Bagaimana warisannya?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, satu anak laki-laki, dan satu anak perempuan. Ia memiliki hutang 200 juta. Warisan berupa tabungan 1 miliar. Bagaimana pembagiannya?",
				"Seorang pria wafat dan meninggalkan tiga istri, empat anak laki-laki, dan dua anak perempuan. Tidak ada hutang. Harta sebesar 2 miliar. Bagaimana waris dibagi?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta dua anak laki-laki. Harta berupa uang 800 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri sah, dua anak perempuan, dan hutang sebesar 100 juta. Warisan berupa tabungan 600 juta. Bagaimana warisannya?",
				"Seorang pria wafat, meninggalkan tiga istri dan empat anak laki-laki. Warisan berupa tabungan 1,9 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Ayah saya meninggal dan meninggalkan ibu saya sebagai istri sahnya beliau serta satu anak perempuan. Warisan berupa uang 400 juta. Ada hutang sebesar 50 juta. Bagaimana pembagiannya?",
				"Seorang pria wafat, meninggalkan satu istri dan satu anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 300 juta. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak perempuan. Ia memiliki hutang 60 juta. Harta berupa uang tunai 500 juta. Bagaimana waris dibagi?",
				"Seorang pria meninggal, meninggalkan dua istri dan lima anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 2,2 miliar. Bagaimana pembagiannya?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta dua anak perempuan. Nenek masih hidup. Warisan berupa uang 700 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri, satu anak laki-laki, dan hutang ke teman sebesar 150 juta. Warisan berupa tabungan 900 juta. Bagaimana warisannya?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sahnya beliau dan satu anak laki-laki. Tidak ada hutang. Harta berupa uang 400 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat, meninggalkan dua istri, satu anak laki-laki, dan satu anak perempuan. Tidak ada hutang. Warisan berupa tabungan 1,1 miliar. Bagaimana pembagian waris?",
				"Ayah saya wafat dan hanya meninggalkan ibu saya sebagai istri sahnya beliau dan saya sebagai anak laki-laki. Warisan berupa uang tunai 500 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak perempuan. Ia memiliki hutang sebesar 80 juta. Harta berupa uang 400 juta. Bagaimana pembagiannya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri sahnya, dua anak laki-laki, dan nenek. Tidak ada hutang. Warisan berupa tabungan 800 juta. Bagaimana warisannya?",
				"Seorang pria wafat dan meninggalkan empat istri dan enam anak laki-laki. Warisan berupa uang tunai 2,8 miliar. Tidak ada hutang. Bagaimana waris dibagi?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sahnya beliau, dua anak laki-laki, dan hutang sebesar 200 juta. Warisan berupa uang 1,3 miliar. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan dua anak perempuan. Tidak ada hutang. Warisan berupa uang 600 juta. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri sahnya beliau, dan satu anak laki-laki. Warisan berupa tabungan 500 juta. Meninggalkan hutang 70 juta. Bagaimana warisan dibagi?",
				"Seorang pria meninggal dunia dan meninggalkan dua istri dan tiga anak laki-laki. Nenek masih hidup. Warisan berupa uang 1,5 miliar. Bagaimana waris dibagi?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sahnya beliau, serta satu anak perempuan. Tidak ada hutang. Harta berupa uang 400 juta. Bagaimana pembagiannya?",
				"Seorang pria wafat, meninggalkan satu istri, satu anak laki-laki, dan dua anak perempuan. Ia memiliki hutang 250 juta. Warisan berupa uang tunai 1,2 miliar. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri, serta dua anak perempuan. Tidak ada anak laki-laki. Warisan berupa tabungan 600 juta. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Ibu saya meninggal dan meninggalkan ayah saya sebagai suami sah, serta saya sebagai satu-satunya anak laki-laki. Ia memiliki hutang 100 juta. Harta warisan sebesar 500 juta. Bagaimana waris dibagi?",
				"Seorang pria wafat dan meninggalkan tiga istri, dan empat anak laki-laki. Warisan berupa uang 2 miliar. Tidak ada hutang. Bagaimana pembagiannya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri sahnya beliau dan satu anak laki-laki. Ia memiliki hutang 90 juta. Warisan berupa uang 600 juta. Bagaimana warisannya?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa tabungan 350 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau serta dua anak laki-laki dan satu anak perempuan. Warisan berupa uang tunai 1 miliar. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Seorang pria wafat dan hanya meninggalkan seorang istri dan dua anak perempuan. Ia memiliki hutang 120 juta. Warisan berupa tabungan 700 juta. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri, satu anak laki-laki, dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 900 juta. Bagaimana warisan dibagikan?",
				"Seorang pria wafat dan meninggalkan dua istri dan lima anak laki-laki. Ia memiliki hutang 300 juta. Warisan berupa tabungan 2,2 miliar. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, satu anak perempuan, dan tidak ada ahli waris lain. Warisan berupa uang 500 juta. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Seorang pria wafat, meninggalkan tiga istri, dua anak laki-laki, dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 1,6 miliar. Bagaimana waris dibagi?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri sah dan satu anak perempuan. Ia memiliki hutang sebesar 70 juta. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta dua anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 800 juta. Bagaimana warisannya?",
				"Seorang pria meninggal dan meninggalkan empat istri dan enam anak laki-laki. Tidak ada hutang. Warisan berupa uang 3 miliar. Bagaimana warisan dibagikan?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sahnya beliau, dua anak perempuan, dan seorang nenek. Ia masih memiliki hutang sebesar 50 juta. Harta 600 juta. Bagaimana waris dibagi?",
				"Seorang pria wafat dan meninggalkan satu istri, satu anak perempuan, dan hutang sebesar 90 juta. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta dua anak laki-laki. Tidak ada hutang. Warisan berupa uang 750 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan tiga istri dan lima anak laki-laki. Tidak ada orang tua yang masih hidup. Warisan berupa uang 2,5 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri, serta satu anak perempuan. Ia memiliki hutang sebesar 120 juta. Harta sebesar 600 juta. Bagaimana waris dibagikan?",
				"Seorang pria wafat dan hanya meninggalkan satu istri dan satu anak laki-laki. Tidak ada hutang. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta satu anak laki-laki dan satu anak perempuan. Ia memiliki hutang 100 juta. Warisan sebesar 850 juta. Bagaimana warisannya?",
				"Seorang pria wafat dan meninggalkan dua istri, empat anak laki-laki, dan nenek. Tidak ada hutang. Warisan berupa uang 1,9 miliar. Bagaimana warisan dibagi?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri, serta satu anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 500 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, satu anak laki-laki, dan satu anak perempuan. Warisan berupa uang 800 juta. Tidak ada hutang. Bagaimana waris dibagi?",
				"Seorang pria wafat dan hanya meninggalkan satu istri dan dua anak perempuan. Ia memiliki hutang sebesar 100 juta. Harta sebesar 600 juta. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa tabungan 400 juta. Bagaimana waris dibagi?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak laki-laki. Ia memiliki hutang sebesar 150 juta. Warisan berupa uang 700 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan hanya meninggalkan ibu saya sebagai istri sah beliau, serta dua anak perempuan. Tidak ada hutang. Warisan berupa uang tunai 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan tiga istri, empat anak laki-laki, dan dua anak perempuan. Warisan berupa tabungan 2,2 miliar. Tidak ada hutang. Bagaimana waris dibagikan?",
				"Ayah saya meninggal dan meninggalkan ibu saya sebagai istri sah beliau, serta dua anak laki-laki. Warisan berupa tabungan 800 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sah dan dua anak perempuan. Ia memiliki hutang 120 juta. Harta yang tersisa berupa uang 700 juta. Bagaimana warisan dibagi?",
				"Seorang pria meninggal, meninggalkan dua istri dan empat anak laki-laki. Warisan berupa uang tunai 1,5 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Ayah saya meninggal dan meninggalkan ibu saya sebagai istri sah beliau, serta satu anak laki-laki dan satu anak perempuan. Warisan berupa uang 600 juta. Ia memiliki hutang sebesar 150 juta. Bagaimana pembagian warisnya?",
				"Seorang pria meninggal dan meninggalkan satu istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa tabungan 400 juta. Bagaimana pembagian warisan?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Ia memiliki utang usaha sebesar 100 juta. Tabungan yang ditinggalkan 500 juta. Bagaimana waris dibagi?",
				"Seorang pria meninggal dunia, meninggalkan tiga istri dan lima anak laki-laki. Tidak ada hutang. Harta sebesar 2 miliar. Bagaimana pembagian waris?",
				"Ayah saya wafat, meninggalkan ibu saya sebagai istri sah, serta tiga anak perempuan. Tidak ada hutang. Warisan berupa tabungan 700 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat dan meninggalkan satu istri, dua anak laki-laki, satu anak perempuan, serta hutang sebesar 250 juta. Warisan berupa uang 1,2 miliar. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa tabungan 350 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan dua istri dan tiga anak laki-laki. Warisan berupa uang 1,1 miliar. Tidak ada hutang. Bagaimana pembagian warisan?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliu, serta saya sebagai satu-satunya anak laki-laki. Ia memiliki hutang sebesar 80 juta. Harta berupa uang 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak perempuan. Tidak ada orang tua yang masih hidup. Warisan berupa tabungan 300 juta. Tidak ada hutang. Bagaimana warisannya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan dua anak perempuan serta seorang nenek. Warisan berupa tabungan 700 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan empat istri dan enam anak laki-laki. Harta berupa uang tunai 2,5 miliar. Tidak ada hutang. Bagaimana waris dibagi?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau serta dua anak laki-laki. Warisan berupa tabungan 1 miliar. Ada hutang 200 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan dua anak perempuan. Tidak ada anak laki-laki. Warisan berupa uang tunai 600 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Warisan berupa uang 500 juta. Ada hutang pribadi 70 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat dan meninggalkan satu istri, dua anak perempuan, dan nenek. Tidak ada orang tua lain yang masih hidup. Warisan berupa uang 750 juta. Tidak ada hutang. Bagaimana warisannya?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta satu anak perempuan. Warisan berupa uang 450 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan dua istri, satu anak laki-laki, dua anak perempuan, dan hutang 300 juta. Warisan sebesar 1,5 miliar. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri, dua anak perempuan, dan tidak ada anak laki-laki. Warisan berupa uang tunai 500 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Ayah saya meninggal dan meninggalkan ibu saya sebagai istri sah dan satu anak laki-laki. Warisan berupa tabungan 600 juta. Tidak ada hutang. Bagaimana waris dibagikan?",
				"Seorang pria wafat dan meninggalkan tiga istri, empat anak laki-laki, dan tidak ada orang tua yang masih hidup. Warisan berupa uang 2 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Ia memiliki hutang sebesar 90 juta. Warisan berupa tabungan 700 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah, dua anak laki-laki, dan satu anak perempuan. Warisan berupa uang 900 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria wafat dan hanya meninggalkan seorang istri dan dua anak perempuan. Ia memiliki hutang 130 juta. Warisan berupa tabungan 600 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri, satu anak laki-laki, satu anak perempuan. Tidak ada hutang. Warisan berupa uang tunai 800 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan dua istri dan lima anak laki-laki. Warisan berupa uang 2 miliar. Ada hutang dagang 250 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta satu anak perempuan. Tidak ada hutang. Warisan berupa uang 500 juta. Bagaimana waris dibagikan?",
				"Seorang pria wafat, meninggalkan tiga istri, dua anak laki-laki, dan satu anak perempuan. Warisan berupa tabungan 1,7 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri dan satu anak perempuan. Ia memiliki hutang sebesar 80 juta. Harta berupa uang 450 juta. Bagaimana warisan dibagi?",
				"Ayah saya wafat dan hanya meninggalkan ibu saya sebagai istri sah serta dua anak laki-laki. Warisan berupa uang 700 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan empat istri dan lima anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 2,8 miliar. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri, satu anak laki-laki, dan nenek. Ia memiliki hutang 60 juta. Warisan berupa uang 600 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri, satu anak perempuan, dan hutang sebesar 100 juta. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah, dua anak laki-laki. Tidak ada hutang. Warisan berupa uang 900 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan tiga istri dan lima anak laki-laki. Warisan berupa uang 2,2 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak perempuan. Ia memiliki hutang pribadi 90 juta. Warisan berupa tabungan 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan satu istri dan satu anak laki-laki. Tidak ada hutang. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah, serta satu anak laki-laki dan satu anak perempuan. Warisan berupa uang 850 juta. Ia memiliki hutang 200 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan dua istri, tiga anak laki-laki, dan nenek. Warisan berupa tabungan 2 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Warisan berupa uang 500 juta. Tidak ada hutang. Bagaimana waris dibagi?",
				"Ayah saya wafat, meninggalkan ibu saya sebagai istri sah, serta satu anak laki-laki dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 700 juta. Bagaimana waris dibagikan?",
				"Seorang pria wafat dan meninggalkan satu istri dan dua anak perempuan. Ia memiliki hutang sebesar 150 juta. Warisan berupa uang 600 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak laki-laki. Ia memiliki hutang 200 juta. Warisan berupa uang 700 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan hanya meninggalkan ibu saya sebagai istri sah dan dua anak perempuan. Tidak ada hutang. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan tiga istri, empat anak laki-laki, dan dua anak perempuan. Tidak ada hutang. Warisan berupa uang 2,3 miliar. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah, serta dua anak laki-laki. Warisan berupa tabungan 900 juta. Tidak ada hutang. Bagaimana pembagian warisnya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak perempuan. Ia memiliki hutang sebesar 80 juta. Warisan berupa uang 500 juta. Bagaimana warisan dibagikan?",
				"Seorang pria wafat, meninggalkan dua istri dan lima anak laki-laki. Warisan berupa uang tunai 2 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Ayah saya meninggal dan meninggalkan ibu saya sebagai istri sah serta satu anak laki-laki dan satu anak perempuan. Ia memiliki hutang sebesar 100 juta. Tabungan yang ditinggalkan sebesar 1 miliar. Bagaimana pembagian waris?",
				"Seorang pria meninggal dan hanya meninggalkan satu istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 350 juta. Bagaimana pembagiannya?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Ia memiliki hutang dagang sebesar 70 juta. Harta warisan berupa uang 400 juta. Bagaimana warisannya?",
				"Seorang pria meninggal, meninggalkan tiga istri dan enam anak laki-laki. Warisan berupa uang tunai 2,4 miliar. Tidak ada hutang. Bagaimana pembagian warisnya?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta tiga anak perempuan. Tidak ada hutang. Harta warisan berupa tabungan 750 juta. Bagaimana pembagian warisnya?",
				"Seorang pria wafat dan meninggalkan satu istri, dua anak laki-laki, satu anak perempuan, serta hutang sebesar 200 juta. Warisan berupa tabungan 1,5 miliar. Bagaimana pembagian warisnya?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa tabungan 400 juta. Bagaimana warisannya?",
				"Seorang pria wafat dan meninggalkan dua istri dan tiga anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 1,3 miliar. Bagaimana pembagiannya?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah, serta saya sebagai anak laki-laki satu-satunya. Ia memiliki hutang sebesar 150 juta. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak perempuan. Tidak ada orang tua yang masih hidup. Warisan berupa tabungan 300 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan dua anak perempuan serta nenek. Warisan berupa uang 700 juta. Tidak ada hutang. Bagaimana pembagian warisnya?",
				"Seorang pria wafat dan meninggalkan empat istri dan lima anak laki-laki. Tidak ada hutang. Warisan berupa uang tunai 2,6 miliar. Bagaimana warisan dibagikan?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah, serta dua anak laki-laki. Warisan berupa uang tunai 1,2 miliar. Ia memiliki hutang sebesar 300 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan dua anak perempuan. Tidak ada anak laki-laki. Warisan berupa tabungan 650 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang suami dan satu anak laki-laki. Warisan berupa uang tunai 600 juta. Ada hutang pribadi sebesar 100 juta. Bagaimana pembagiannya?",
				"Seorang pria wafat dan hanya meninggalkan satu istri dan dua anak perempuan. Nenek masih hidup. Warisan berupa uang 700 juta. Tidak ada hutang. Bagaimana warisannya?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta satu anak perempuan. Warisan berupa tabungan 450 juta. Tidak ada hutang. Bagaimana waris dibagikan?",
				"Seorang pria wafat, meninggalkan dua istri, satu anak laki-laki, dua anak perempuan, dan hutang sebesar 250 juta. Warisan berupa tabungan 1,3 miliar. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sah, serta dua anak perempuan. Tidak ada anak laki-laki. Warisan berupa tabungan 550 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Ayah saya meninggal dan meninggalkan ibu saya sebagai istri sah dan saya sebagai anak laki-laki satu-satunya. Tidak ada hutang. Harta warisan berupa uang 600 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan tiga istri, empat anak laki-laki, dan tidak ada orang tua yang masih hidup. Warisan berupa uang 2,2 miliar. Tidak ada hutang. Bagaimana warisannya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Ia memiliki hutang pribadi 90 juta. Warisan berupa tabungan 650 juta. Bagaimana waris dibagi?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 350 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta dua anak laki-laki dan satu anak perempuan. Warisan berupa uang tunai 1 miliar. Tidak ada hutang. Bagaimana pembagiannya?",
				"Seorang pria wafat dan hanya meninggalkan istri dan dua anak perempuan. Ia memiliki hutang 100 juta. Warisan berupa uang 700 juta. Bagaimana pembagiannya?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri, satu anak laki-laki, dan satu anak perempuan. Tidak ada hutang. Warisan berupa tabungan 900 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan dua istri dan lima anak laki-laki. Warisan berupa uang 2,1 miliar. Ia memiliki hutang dagang sebesar 200 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta satu anak perempuan. Tidak ada hutang. Warisan berupa uang tunai 500 juta. Bagaimana warisannya?",
				"Seorang pria wafat, meninggalkan tiga istri, dua anak laki-laki, dan satu anak perempuan. Warisan berupa tabungan 1,6 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri dan satu anak perempuan. Ia memiliki hutang 120 juta. Harta warisan berupa uang 450 juta. Bagaimana warisannya?",
				"Ayah saya wafat dan hanya meninggalkan ibu saya sebagai istri sah serta dua anak laki-laki. Tidak ada hutang. Warisan berupa uang tunai 800 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan empat istri dan enam anak laki-laki. Warisan berupa uang 2,9 miliar. Tidak ada hutang. Bagaimana waris dibagikan?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri, satu anak laki-laki, dan nenek. Ia memiliki hutang sebesar 50 juta. Warisan berupa uang 700 juta. Bagaimana pembagiannya?",
				"Seorang pria wafat dan meninggalkan satu istri, satu anak perempuan, dan hutang sebesar 110 juta. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta dua anak laki-laki. Tidak ada hutang. Warisan berupa uang 850 juta. Bagaimana waris dibagikan?",
				"Seorang pria wafat, meninggalkan tiga istri dan lima anak laki-laki. Warisan berupa uang tunai 2,4 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak perempuan. Ia memiliki hutang sebesar 80 juta. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak laki-laki. Tidak ada hutang. Warisan berupa uang tunai 400 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta satu anak laki-laki dan satu anak perempuan. Warisan berupa uang 950 juta. Ada hutang sebesar 200 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan dua istri, tiga anak laki-laki, dan nenek. Warisan berupa uang 1,9 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Warisan berupa uang 600 juta. Tidak ada hutang. Bagaimana waris dibagi?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta satu anak laki-laki dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 850 juta. Bagaimana warisannya?",
				"Seorang pria wafat dan meninggalkan satu istri dan dua anak perempuan. Ia memiliki hutang sebesar 150 juta. Warisan berupa uang 700 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sah dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak laki-laki. Ia memiliki hutang sebesar 250 juta. Warisan berupa uang 900 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan hanya meninggalkan ibu saya sebagai istri sah dan dua anak perempuan. Tidak ada hutang. Warisan berupa uang tunai 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan tiga istri, empat anak laki-laki, dan dua anak perempuan. Warisan berupa uang 2,3 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Ayah saya wafat meninggalkan istri sah, dua anak laki-laki, dan satu anak perempuan. Tabungan 500 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri sah, satu anak laki-laki, dan ibu kandungnya. Tabungan 300 juta. Tidak ada hutang. Bagaimana pembagian warisan?",
				"Seorang laki-laki meninggal dunia, meninggalkan seorang ayah, ibu, istri, dan satu anak perempuan. Warisan berupa tabungan 400 juta. Bagaimana pembagiannya?",
				"Seorang wanita wafat, meninggalkan seorang suami, dua anak perempuan, dan ibunya. Tabungan 800 juta. Tidak ada hutang. Siapa saja yang berhak dan berapa bagian masing-masing?",
				"Ayah saya meninggal dengan meninggalkan ibu saya sebagai istri sah, satu anak laki-laki, dan satu anak perempuan. Warisan 600 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Seorang pria wafat, meninggalkan seorang istri dan satu anak perempuan saja. Harta berupa uang tunai 1,2 miliar. Tidak ada hutang. Siapa yang mendapat warisan dan berapa besarannya?",
				"Seorang wanita wafat, meninggalkan seorang suami, ibu, dan satu anak laki-laki. Harta 500 juta. Bagaimana pembagiannya?",
				"Seorang ayah wafat, meninggalkan seorang istri, dua anak laki-laki, dan ayah kandung. Tabungan 700 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria meninggal, meninggalkan seorang istri, anak laki-laki, dan anak perempuan. Ia juga meninggalkan hutang 100 juta dari total tabungan 600 juta. Bagaimana pembagian waris setelah pelunasan hutang?",
				"Seorang wanita wafat dan meninggalkan seorang suami, ibu, ayah, dan satu anak perempuan. Warisan berupa tabungan 900 juta. Bagaimana pembagiannya?",
				"Seorang pria meninggal, meninggalkan seorang istri, satu anak laki-laki, dan kakek dari jalur ayah. Warisan 700 juta. Bagaimana pembagiannya?",
				"Seorang wanita wafat, meninggalkan seorang suami, dua anak perempuan, dan nenek. Warisan harta 800 juta. Siapa yang berhak dan berapa bagian masing-masing?",
				"Seorang pria meninggal, meninggalkan satu anak perempuan, ibu, dan nenek. Harta 400 juta. Bagaimana pembagiannya?",
				"Seorang wanita meninggal, meninggalkan seorang suami, ayah, dan nenek. Tabungan 600 juta. Siapa saja yang berhak?",
				"Seorang pria wafat, meninggalkan seorang istri, satu anak perempuan, dan kakek dari jalur ayah. Warisan 450 juta. Bagaimana pembagiannya?",
				"Seorang wanita wafat, meninggalkan seorang suami, satu anak laki-laki, dan nenek. Warisan 500 juta. Bagaimana pembagiannya?",
				"Seorang pria wafat, meninggalkan dua anak perempuan, ayah, dan nenek. Warisan 1 miliar. Tidak ada hutang. Bagaimana pembagiannya?",
				"Seorang wanita meninggal, meninggalkan satu anak laki-laki dan kakek dari ayah. Warisan 300 juta. Siapa yang berhak dan berapa bagiannya?",
				"Seorang pria wafat, meninggalkan seorang istri, ibu, dua anak perempuan, dan kakek dari ayah. Warisan 200 juta. Bagaimana pembagiannya?",
				"Seorang wanita wafat, meninggalkan seorang suami, satu anak perempuan, dan nenek. Tabungan 500 juta. Tidak ada hutang. Bagaimana warisannya?",
				"Istri saya meninggal dan meninggalkan saya sebagai seorang suami, serta dua anak perempuan. Tidak ada hutang. Harta warisan berupa tabungan 600 juta. Bagaimana pembagiannya?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah, serta dua anak laki-laki. Tidak ada hutang. Warisan berupa uang 800 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta satu anak laki-laki. Ia memiliki hutang sebesar 120 juta. Tabungan yang ditinggalkan 700 juta. Bagaimana pembagian waris?",
				"Ibu saya atau istrinya ayah saya meninggal dunia dan hanya meninggalkan satu anak laki-laki dan dua anak perempuan. Harta warisan berupa tabungan 500 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Seorang pria meninggal dan hanya meninggalkan seorang istri dan satu anak perempuan. Ia memiliki hutang 150 juta. Warisan berupa uang tunai 700 juta. Bagaimana waris dibagi?",
				"Seorang wanita wafat dan meninggalkan seorang suami, satu anak laki-laki, dan ibunya. Tidak ada hutang. Harta sebesar 400 juta. Bagaimana pembagian waris?",
				"Suami saya meninggal dunia dan meninggalkan saya sebagai seorang istri serta tiga anak laki-laki. Tidak ada hutang. Harta warisan berupa uang 1 miliar. Bagaimana pembagian waris?",
				"Seorang wanita meninggal dan meninggalkan dua anak laki-laki dan seorang suami. Ia memiliki hutang 100 juta. Harta berupa tabungan 600 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri serta satu anak perempuan. Tidak ada hutang. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta dua anak perempuan. Warisan berupa tabungan 700 juta. Bagaimana waris dibagi?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami dan satu anak laki-laki. Tidak ada hutang. Warisan berupa uang 300 juta. Bagaimana pembagiannya?",
				"Seorang pria wafat dan meninggalkan tiga istri dan lima anak laki-laki. Warisan berupa uang 2 miliar. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Seorang wanita wafat dan meninggalkan satu anak perempuan dan ibunya. Warisan berupa uang 500 juta. Bagaimana waris dibagikan?",
				"Istri saya meninggal dunia dan hanya meninggalkan saya sebagai seorang suami, satu anak laki-laki, dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta satu anak perempuan. Ia memiliki hutang pribadi sebesar 60 juta. Warisan berupa uang 300 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan dua istri dan empat anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 1,6 miliar. Bagaimana waris dibagi?",
				"Istri saya meninggal dan meninggalkan saya sebagai seorang suami, satu anak laki-laki, dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 750 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat, meninggalkan seorang suami, satu anak laki-laki dan seorang nenek. Tidak ada ayah maupun ibu yang masih hidup. Warisan berupa tabungan 600 juta. Bagaimana warisan dibagi?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri serta dua anak perempuan. Tidak ada hutang. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan dua anak laki-laki dan seorang ibu. Warisan berupa tabungan 700 juta. Bagaimana pembagian waris?",
				"Seorang wanita meninggal, meninggalkan seorang suami dan satu anak perempuan, serta hutang sebesar 90 juta. Warisan berupa uang tunai 400 juta. Bagaimana waris dibagikan?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta satu anak perempuan. Warisan berupa tabungan 500 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Istri saya wafat, meninggalkan saya sebagai seorang suami, satu anak laki-laki dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 600 juta. Bagaimana pembagian waris?",
				"Seorang wanita meninggal, meninggalkan seorang suami dan dua anak perempuan. Warisan berupa uang 450 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan hanya meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Ia memiliki hutang sebesar 80 juta. Warisan berupa uang 500 juta. Bagaimana waris dibagi?",
				"Seorang pria wafat dan meninggalkan tiga istri dan dua anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 1,4 miliar. Bagaimana warisannya?",
				"Seorang wanita wafat, meninggalkan dua anak perempuan dan seorang nenek. Warisan berupa uang 400 juta dan hutang 50 juta. Bagaimana pembagian waris?",
				"Suami saya meninggal dunia, meninggalkan seorang istri, satu anak laki-laki, dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 800 juta. Bagaimana waris dibagi?",
				"Istri saya meninggal dunia dan meninggalkan saya sebagai seorang suami dan dua anak laki-laki. Warisan berupa tabungan 500 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan satu anak laki-laki. Warisan berupa uang 300 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Seorang pria wafat dan meninggalkan satu istri dan tiga anak perempuan. Warisan berupa tabungan 600 juta. Bagaimana waris dibagikan?",
				"Seorang wanita wafat dan meninggalkan seorang suami dan satu anak laki-laki. Ia memiliki hutang sebesar 120 juta. Warisan berupa tabungan 700 juta. Bagaimana waris dibagi?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang tunai 300 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta dua anak laki-laki. Tidak ada hutang. Warisan berupa uang 850 juta. Bagaimana pembagiannya?",
				"Seorang wanita meninggal dunia dan meninggalkan dua anak perempuan serta seorang nenek. Warisan berupa uang 500 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Ia memiliki hutang 100 juta. Warisan berupa uang 700 juta. Bagaimana waris dibagi?",
				"Seorang wanita wafat dan meninggalkan satu anak laki-laki dan tidak memiliki orang tua. Warisan berupa tabungan 400 juta. Tidak ada hutang. Bagaimana waris dibagikan?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta dua anak perempuan. Warisan berupa uang 600 juta. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami serta dua anak perempuan. Tidak ada hutang. Warisan berupa tabungan 500 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami, satu anak laki-laki, dan hutang sebesar 200 juta. Warisan berupa uang 800 juta. Bagaimana pembagian waris?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan satu anak perempuan. Warisan berupa uang 350 juta. Tidak ada hutang. Bagaimana waris dibagi?",
				"Seorang wanita wafat, meninggalkan seorang suami, satu anak laki-laki dan satu anak perempuan. Warisan berupa tabungan 600 juta. Bagaimana waris dibagikan?",
				"Ayah saya wafat dan hanya meninggalkan ibu saya sebagai istri sah dan satu anak perempuan. Warisan berupa uang 400 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami, dua anak perempuan, dan seorang nenek. Warisan berupa tabungan 650 juta. Bagaimana warisannya?",
				"Suami saya wafat, meninggalkan saya sebagai seorang istri dan dua anak laki-laki. Ia memiliki hutang 150 juta. Warisan berupa tabungan 900 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami dan satu anak laki-laki. Tidak ada hutang. Warisan berupa uang 350 juta. Bagaimana waris dibagikan?",
				"Istri saya wafat dan hanya meninggalkan saya sebagai seorang istri dan satu anak perempuan. Warisan berupa uang 300 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan tiga istri dan lima anak laki-laki. Tidak ada hutang. Warisan berupa uang tunai 2,4 miliar. Bagaimana waris dibagi?",
				"Seorang wanita wafat dan meninggalkan satu suami dan satu anak laki-laki. Ia memiliki hutang 100 juta. Warisan berupa tabungan 600 juta. Bagaimana waris dibagikan?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah serta dua anak laki-laki. Warisan berupa uang 700 juta. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Seorang wanita wafat, meninggalkan seorang suami dan dua anak perempuan. Ia memiliki hutang sebesar 150 juta. Warisan berupa tabungan 600 juta. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami dan satu anak perempuan. Warisan berupa uang tunai 400 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak perempuan. Ia memiliki hutang 100 juta. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan satu anak laki-laki dan seorang suami. Tidak ada hutang. Warisan berupa uang 450 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri dan tiga anak laki-laki. Warisan berupa uang 900 juta. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Seorang wanita wafat dan meninggalkan dua anak laki-laki serta seorang nenek. Warisan berupa uang 600 juta. Bagaimana pembagian waris?",
				"Seorang pria meninggal dan hanya meninggalkan satu istri dan satu anak perempuan. Warisan berupa tabungan 400 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Ayah saya wafat, meninggalkan ibu saya sebagai istri sah dan dua anak perempuan. Warisan berupa uang 650 juta. Bagaimana pembagian waris?",
				"Istri saya meninggal dan meninggalkan saya sebagai seorang suami dan satu anak perempuan. Ia memiliki hutang sebesar 80 juta. Warisan berupa tabungan 500 juta. Bagaimana waris dibagikan?",
				"Seorang pria wafat dan meninggalkan tiga istri dan empat anak laki-laki. Warisan berupa uang 2 miliar. Tidak ada hutang. Bagaimana pembagiannya?",
				"Seorang wanita wafat, meninggalkan dua anak perempuan dan seorang nenek. Warisan berupa uang 550 juta. Bagaimana waris dibagi?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami dan satu anak laki-laki. Warisan berupa uang tunai 300 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta satu anak perempuan. Ia memiliki hutang pribadi 70 juta. Warisan berupa uang 400 juta. Bagaimana waris dibagikan?",
				"Seorang pria wafat dan meninggalkan dua istri dan tiga anak laki-laki. Warisan berupa uang 1,5 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami, satu anak laki-laki, dan satu anak perempuan. Warisan berupa tabungan 800 juta. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Seorang wanita meninggal, meninggalkan satu anak laki-laki dan seorang nenek. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri serta satu anak perempuan. Warisan berupa uang tunai 450 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan dua anak laki-laki dan satu ibu. Warisan berupa uang 800 juta. Bagaimana warisan dibagi?",
				"Seorang wanita wafat, meninggalkan seorang suami dan satu anak laki-laki. Ia memiliki hutang 120 juta. Warisan berupa uang 600 juta. Bagaimana warisan dibagikan?",
				"Ayah saya wafat, meninggalkan ibu saya sebagai istri sah dan satu anak laki-laki. Warisan berupa uang 500 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Istri saya wafat, meninggalkan saya sebagai seorang suami, satu anak laki-laki dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 700 juta. Bagaimana warisannya?",
				"Seorang wanita wafat dan meninggalkan seorang suami, dua anak perempuan, dan seorang nenek. Warisan berupa uang 750 juta. Bagaimana waris dibagi?",
				"Suami saya wafat dan hanya meninggalkan saya sebagai seorang istri dan satu anak laki-laki. Ia memiliki hutang 100 juta. Warisan berupa uang 600 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat dan meninggalkan tiga istri dan dua anak laki-laki. Warisan berupa uang 1,3 miliar. Tidak ada hutang. Bagaimana warisannya?",
				"Seorang wanita wafat dan meninggalkan dua anak perempuan serta seorang nenek. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Suami saya meninggal dunia dan meninggalkan saya sebagai seorang istri, satu anak laki-laki, dan satu anak perempuan. Warisan berupa tabungan 900 juta. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami serta dua anak laki-laki. Warisan berupa uang 450 juta. Tidak ada hutang. Bagaimana waris dibagi?",
				"Seorang wanita wafat, meninggalkan satu anak laki-laki. Warisan berupa tabungan 300 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan tiga anak perempuan. Warisan berupa tabungan 600 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta satu anak laki-laki. Ia memiliki hutang sebesar 100 juta. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkansaya sebagai seorang suami, serta satu anak perempuan. Tidak ada hutang. Warisan berupa uang 300 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta dua anak laki-laki. Tidak ada hutang. Warisan berupa uang 850 juta. Bagaimana waris dibagikan?",
				"Seorang wanita wafat dan meninggalkan dua anak perempuan serta nenek. Warisan berupa uang 600 juta. Tidak ada hutang. Bagaimana waris dibagi?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak perempuan. Warisan berupa uang 400 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri serta satu anak laki-laki. Ia memiliki hutang sebesar 90 juta. Warisan berupa uang 600 juta. Bagaimana waris dibagikan?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta satu anak laki-laki. Warisan berupa uang 350 juta. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta dua anak perempuan. Warisan berupa uang tunai 600 juta. Tidak ada hutang. Bagaimana warisannya?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami, serta dua anak perempuan. Tidak ada hutang. Warisan berupa uang 500 juta. Bagaimana waris dibagi?",
				"Seorang wanita wafat dan meninggalkan seorang suami, satu anak laki-laki, dan hutang sebesar 100 juta. Warisan berupa uang 600 juta. Bagaimana warisannya?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri serta satu anak perempuan. Warisan berupa uang 400 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan satu anak laki-laki dan satu anak perempuan. Tidak ada orang tua. Warisan berupa tabungan 700 juta. Bagaimana waris dibagi?",
				"Ayah saya wafat dan hanya meninggalkan ibu saya sebagai istri sah beliau, serta satu anak perempuan. Warisan berupa uang 450 juta. Tidak ada hutang. Bagaimana warisannya?",
				"Seorang wanita wafat dan meninggalkan seorang suami, dua anak perempuan, dan nenek. Warisan berupa uang 700 juta. Tidak ada hutang. Bagaimana warisannya?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri, serta dua anak laki-laki. Ia memiliki hutang sebesar 200 juta. Warisan berupa tabungan 1 miliar. Bagaimana warisannya?",
				"Seorang wanita wafat dan meninggalkan satu anak laki-laki. Tidak ada hutang. Warisan berupa uang 300 juta. Bagaimana waris dibagikan?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami, serta satu anak perempuan. Warisan berupa uang 250 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat dan meninggalkan tiga istri serta lima anak laki-laki. Warisan berupa uang 2,5 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami dan satu anak laki-laki. Ia memiliki hutang 120 juta. Warisan berupa uang 650 juta. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami, serta dua anak perempuan. Tidak ada hutang. Warisan berupa tabungan 600 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta satu anak laki-laki dan satu anak perempuan. Warisan berupa uang 750 juta. Tidak ada hutang. Bagaimana pembagiannya?",
				"Seorang wanita wafat, meninggalkan seorang suami dan dua anak laki-laki. Ia memiliki hutang sebesar 100 juta. Warisan berupa uang 800 juta. Bagaimana pembagian waris?",
				"Istri saya wafat dan hanya meninggalkan saya sebagai seorang suami, serta dua anak laki-laki. Warisan berupa tabungan 500 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria meninggal dunia dan meninggalkan satu istri dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Seorang wanita meninggal, meninggalkan seorang suami dan satu anak laki-laki. Ia memiliki hutang 150 juta. Warisan berupa uang 600 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri serta dua anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 1 miliar. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan dua anak perempuan serta seorang nenek. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan satu anak laki-laki. Warisan berupa uang 300 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta tiga anak perempuan. Tidak ada anak laki-laki. Warisan berupa uang 700 juta. Bagaimana warisan dibagi?",
				"Istri saya meninggal dan meninggalkan saya sebagai seorang suami, serta satu anak perempuan. Ia memiliki hutang 90 juta. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan dua istri serta empat anak laki-laki. Warisan berupa uang 1,8 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan hanya meninggalkan dua anak perempuan dan seorang nenek. Warisan berupa uang 450 juta. Bagaimana waris dibagikan?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami sah beliau, serta satu anak perempuan. Warisan berupa tabungan 300 juta. Bagaimana warisannya?",
				"Seorang wanita meninggal dunia dan meninggalkan seorang suami serta satu anak perempuan. Ia memiliki hutang 50 juta. Warisan berupa uang 400 juta. Bagaimana warisan dibagikan?",
				"Seorang pria wafat dan meninggalkan tiga istri serta dua anak laki-laki. Warisan berupa tabungan 1,2 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami, satu anak laki-laki, dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 800 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan hanya meninggalkan satu anak laki-laki serta nenek. Warisan berupa uang 400 juta. Bagaimana waris dibagikan?",
				"Suami saya wafat dan meninggalkan saya sebagai istri sahnya beliau, serta satu anak perempuan. Warisan berupa uang 350 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan dua anak laki-laki serta seorang ibu. Warisan berupa uang 850 juta. Bagaimana warisan dibagi?",
				"Seorang wanita wafat dan meninggalkan seorang suami dan satu anak laki-laki. Ia memiliki hutang sebesar 110 juta. Warisan berupa uang 600 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta satu anak perempuan. Warisan berupa tabungan 450 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami, satu anak laki-laki dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 650 juta. Bagaimana warisan dibagi?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta dua anak perempuan. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri serta satu anak laki-laki. Ia memiliki hutang sebesar 90 juta. Warisan berupa tabungan 700 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan tiga istri serta lima anak laki-laki. Warisan berupa uang 2,2 miliar. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Seorang wanita wafat dan meninggalkan dua anak perempuan serta seorang nenek. Warisan berupa tabungan 600 juta. Bagaimana pembagian waris?",
				"Suami saya meninggal dunia dan meninggalkan saya sebagai seorang istri sah beliau, satu anak laki-laki, dan satu anak perempuan. Warisan berupa tabungan 1 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami, serta dua anak laki-laki. Warisan berupa uang 550 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan satu anak laki-laki. Tidak ada ahli waris lain. Warisan berupa uang 350 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat dan meninggalkan satu istri dan tiga anak perempuan. Warisan berupa uang 700 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta satu anak laki-laki. Ia memiliki hutang sebesar 130 juta. Warisan berupa uang 600 juta. Bagaimana warisan dibagi?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami, serta satu anak perempuan. Tidak ada hutang. Warisan berupa uang 350 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta dua anak laki-laki. Warisan berupa uang 900 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan dua anak perempuan serta seorang nenek. Warisan berupa uang 550 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri serta satu anak perempuan. Warisan berupa uang 450 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sah beliau, serta satu anak laki-laki. Ia memiliki hutang sebesar 120 juta. Warisan berupa uang 700 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan dua anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 400 juta. Bagaimana pembagian waris?",
				"Istri saya wafat dan hanya meninggalkan saya sebagai seorang suami sah, serta satu anak perempuan. Warisan berupa uang 300 juta. Bagaimana warisan dibagi?",
				"Seorang pria wafat dan meninggalkan tiga istri serta lima anak laki-laki. Warisan berupa tabungan 2,5 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta satu anak laki-laki. Ia memiliki hutang sebesar 100 juta. Warisan berupa uang 600 juta. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai istri sah beliau, serta dua anak perempuan. Tidak ada hutang. Warisan berupa uang 500 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta satu anak laki-laki dan satu anak perempuan. Warisan berupa uang 800 juta. Tidak ada hutang. Bagaimana warisannya?",
				"Seorang wanita wafat dan meninggalkan seorang suami, dua anak perempuan, dan seorang nenek. Warisan berupa uang 650 juta. Tidak ada hutang. Bagaimana waris dibagikan?",
				"Suami saya wafat dan meninggalkan saya serta dua anak laki-laki. Ia memiliki hutang sebesar 200 juta. Warisan berupa uang 1 miliar. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami dan dua anak perempuan. Tidak ada hutang. Warisan berupa uang 300 juta. Bagaimana warisannya?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami, serta satu anak perempuan. Warisan berupa tabungan 250 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan tiga istri serta enam anak laki-laki. Warisan berupa uang 2,8 miliar. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta satu anak laki-laki. Ia memiliki hutang sebesar 110 juta. Warisan berupa uang 700 juta. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami sah, serta satu anak laki-laki dan satu anak perempuan. Tidak ada hutang. Warisan berupa tabungan 750 juta. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami, serta dua anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 800 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai istri sah beliau, serta satu anak laki-laki dan satu anak perempuan. Warisan berupa uang 700 juta. Tidak ada hutang. Bagaimana pembagian warisnya?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta satu anak perempuan. Ia memiliki hutang sebesar 150 juta. Warisan berupa tabungan 600 juta. Bagaimana pembagian waris?",
				"Istri saya meninggal dunia dan meninggalkan saya sebagai seorang suami, serta dua anak perempuan. Tidak ada hutang. Harta warisan berupa uang 500 juta. Bagaimana warisan dibagikan?",
				"Seorang pria wafat dan hanya meninggalkan  seorang istri dan satu anak perempuan. Warisan berupa uang 400 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat, meninggalkan seorang suami dan satu anak laki-laki. Ia memiliki hutang 100 juta. Warisan berupa tabungan 700 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sah beliau, serta tiga anak laki-laki. Tidak ada hutang. Warisan berupa uang 1,2 miliar. Bagaimana warisan dibagi?",
				"Seorang wanita wafat dan meninggalkan dua anak perempuan serta seorang nenek. Warisan berupa uang 550 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan satu istri dan dua anak laki-laki. Ia memiliki hutang sebesar 200 juta. Warisan berupa uang 1 miliar. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai seorang istri sah beliau, serta dua anak perempuan. Warisan berupa uang 600 juta. Tidak ada hutang. Bagaimana warisan dibagikan?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami sah beliau, serta satu anak perempuan. Tidak ada hutang. Warisan berupa tabungan 450 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan tiga istri dan lima anak laki-laki. Tidak ada hutang. Warisan berupa uang 2 miliar. Bagaimana waris dibagikan?",
				"Seorang wanita wafat dan hanya meninggalkan dua anak laki-laki dan seorang nenek. Warisan berupa uang 500 juta. Bagaimana warisan dibagikan?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami sah, serta satu anak laki-laki. Warisan berupa uang 400 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami serta satu anak perempuan. Ia memiliki hutang sebesar 90 juta. Warisan berupa tabungan 600 juta. Bagaimana warisannya?",
				"Seorang pria wafat dan meninggalkan dua istri dan tiga anak laki-laki. Tidak ada hutang. Warisan berupa uang 1,5 miliar. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami sah, satu anak laki-laki, dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 900 juta. Bagaimana warisan dibagi?",
				"Seorang wanita wafat, meninggalkan satu anak laki-laki dan seorang nenek. Warisan berupa uang 550 juta. Bagaimana pembagian waris?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sah beliau, serta satu anak laki-laki. Ia memiliki hutang sebesar 150 juta. Warisan berupa uang 800 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat, meninggalkan dua anak perempuan dan seorang ibu. Warisan berupa uang 700 juta. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Seorang wanita wafat, meninggalkan seorang suami dan satu anak laki-laki. Ia memiliki hutang sebesar 130 juta. Warisan berupa uang 750 juta. Bagaimana pembagian waris?",
				"Ayah saya wafat dan meninggalkan ibu saya sebagai seorang istri sah beliau, serta satu anak perempuan. Warisan berupa uang 500 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami sah, serta dua anak laki-laki dan satu anak perempuan. Tidak ada hutang. Warisan berupa uang 950 juta. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami dan dua anak perempuan. Ia memiliki hutang 100 juta. Warisan berupa uang 600 juta. Bagaimana warisan dibagi?",
				"Suami saya wafat dan meninggalkan saya sebagai seorang istri sah, serta satu anak laki-laki. Tidak ada hutang. Warisan berupa tabungan 500 juta. Bagaimana pembagian waris?",
				"Seorang pria wafat dan meninggalkan tiga istri dan empat anak laki-laki. Tidak ada hutang. Warisan berupa uang 2,4 miliar. Bagaimana waris dibagikan?",
				"Seorang wanita wafat dan tidak memiliki suami atau orang tua. Ia meninggalkan dua anak perempuan dan seorang nenek. Warisan berupa uang 550 juta. Bagaimana pembagian waris?",
				"Suami saya meninggal dunia dan meninggalkan saya sebagai istri sah beliau, satu anak laki-laki, dan dua anak perempuan. Warisan berupa tabungan 1 miliar. Tidak ada hutang. Bagaimana warisan dibagi?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami sah, serta dua anak laki-laki. Warisan berupa uang 600 juta. Tidak ada hutang. Bagaimana pembagian waris?",
				"Seorang wanita wafat dan meninggalkan seorang suami, serta satu anak laki-laki dan satu anak perempuan. Warisan berupa uang 400 juta. Tidak ada hutang. Bagaimana warisan dibagikan?",
				"Istri saya wafat dan meninggalkan saya sebagai seorang suami sah, serta tiga anak laki-laki dan satu anak perempuan. Meninggalkan hutang 100 juta. Warisan berupa uang 800 juta. Bagaimana pembagiannya?"
			],
			"responses": [
				"Baik, akan Amana proses terlebih dahulu pertanyaan tersebut",
				"Terima kasih atas pertanyaan tersebut, Amana akan proses terlebih dahulu",
				"Tunggu sebentar ya, Amana sedang memproses pertanyaan tersebut",
				"Baiklah, berdasarkan pertanyaan tersebut, akan Amana proses terlebih dahulu"
			]
		},
		{
			"intent": "terima_kasih",
			"text": [
				"Terima kasih untuk jawabannya",
				"Terima kasih banyak Amana atas bantuannya.",
				"Syukron jazakumullah",
				"Syukron",
				"Makasih ya",
				"Makasih banyak ya Amana",
				"Terima kasih Amana",
				"Syukron jazakallah khairan katsiran Amana"
			],
			"responses": [
				"Sama-sama, semoga bermanfaat!",
				"Senang bisa membantu!",
				"Sama-sama, jangan ragu untuk bertanya lagi ya.",
				"Alhamdulillah, senang bisa membantu!"
			]
		}
	]
}
